[Killed] ConditionalExpression
src/stores/chatStore.ts:100:9
 
     // Cancel any in-flight subscribe for this workspace
     const existing = _chatSubscribeTokens.get(workspaceId);
-    if (existing) existing.cancelled = true;
+    if (false) existing.cancelled = true;
 
     const token = { cancelled: false };
killedBy: chatStore - subscribe cancellation tokens calling subscribe again sets existing token.cancelled=true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/stores/chatStore.ts:100:40
 
     // Cancel any in-flight subscribe for this workspace
     const existing = _chatSubscribeTokens.get(workspaceId);
-    if (existing) existing.cancelled = true;
+    if (existing) existing.cancelled = false;
 
     const token = { cancelled: false };
killedBy: chatStore - subscribe cancellation tokens calling subscribe again sets existing token.cancelled=true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/stores/chatStore.ts:102:32
     const existing = _chatSubscribeTokens.get(workspaceId);
     if (existing) existing.cancelled = true;
 
-    const token = { cancelled: false };
+    const token = { cancelled: true };
     _chatSubscribeTokens.set(workspaceId, token);
 
killedBy: chatStore - subscribe registers a listener and stores unlisten
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent-stream:ws-1', Any<Function> ]

Number of calls: 0

[Killed] ObjectLiteral
src/stores/chatStore.ts:102:19
     const existing = _chatSubscribeTokens.get(workspaceId);
     if (existing) existing.cancelled = true;
 
-    const token = { cancelled: false };
+    const token = {};
     _chatSubscribeTokens.set(workspaceId, token);
 
killedBy: chatStore - subscribe cancellation tokens subscribe creates token with cancelled=false in _chatSubscribeTokens
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/stores/chatStore.ts:107:51
 
     try {
       // Load persisted messages if we don't have any in memory
-      if (!(get().messages[workspaceId]?.length)) {
-        await get().loadMessages(workspaceId);
-      }
+      if (!(get().messages[workspaceId]?.length)) {}
 
       if (token.cancelled) {
killedBy: chatStore - subscribe loads persisted messages if none in memory
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-1' ]

Number of calls: 0

[Killed] OptionalChaining
src/stores/chatStore.ts:107:13
 
     try {
       // Load persisted messages if we don't have any in memory
-      if (!(get().messages[workspaceId]?.length)) {
+      if (!(get().messages[workspaceId].length)) {
         await get().loadMessages(workspaceId);
       }
killedBy: chatStore - subscribe registers a listener and stores unlisten
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent-stream:ws-1', Any<Function> ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/chatStore.ts:111:11
         await get().loadMessages(workspaceId);
       }
 
-      if (token.cancelled) {
+      if (true) {
         _chatSubscribeTokens.delete(workspaceId);
         return;
killedBy: chatStore - subscribe registers a listener and stores unlisten
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent-stream:ws-1', Any<Function> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/chatStore.ts:111:28
         await get().loadMessages(workspaceId);
       }
 
-      if (token.cancelled) {
-        _chatSubscribeTokens.delete(workspaceId);
-        return;
-      }
+      if (token.cancelled) {}
 
       // Re-check after await — another subscribe may have completed
killedBy: chatStore - subscribe cancellation tokens cancels previous in-flight subscribe
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/stores/chatStore.ts:117:11
       }
 
       // Re-check after await — another subscribe may have completed
-      if (get().subscriptions[workspaceId]) {
+      if (true) {
         _chatSubscribeTokens.delete(workspaceId);
         return;
killedBy: chatStore - subscribe registers a listener and stores unlisten
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent-stream:ws-1', Any<Function> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/chatStore.ts:117:45
       }
 
       // Re-check after await — another subscribe may have completed
-      if (get().subscriptions[workspaceId]) {
-        _chatSubscribeTokens.delete(workspaceId);
-        return;
-      }
+      if (get().subscriptions[workspaceId]) {}
 
       const unlisten = await listen<FrontendStreamEvent>(
killedBy: chatStore - subscribe re-check guard L116 bails without calling listen when subscription appears during loadMessages
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/stores/chatStore.ts:123:9
       }
 
       const unlisten = await listen<FrontendStreamEvent>(
-        `agent-stream:${workspaceId}`,
+        ``,
         (event) => {
           if (token.cancelled) return;
killedBy: chatStore - subscribe registers a listener and stores unlisten
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent-stream:ws-1', Any<Function> ]

Received: 

  1st vi.fn() call:

  [
-   "agent-stream:ws-1",

[Killed] BlockStatement
src/stores/chatStore.ts:124:20
 
       const unlisten = await listen<FrontendStreamEvent>(
         `agent-stream:${workspaceId}`,
-        (event) => {
-          if (token.cancelled) return;
-          const payload = event.payload;
-          pushStreamEvent(workspaceId, "event_received", payload.type);
-          handleStreamEvent(workspaceId, payload, set, get);
-        },
+        (event) => {},
       );
 
killedBy: chatStore - stream events handles system event with message
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/stores/chatStore.ts:125:15
       const unlisten = await listen<FrontendStreamEvent>(
         `agent-stream:${workspaceId}`,
         (event) => {
-          if (token.cancelled) return;
+          if (true) return;
           const payload = event.payload;
           pushStreamEvent(workspaceId, "event_received", payload.type);
killedBy: chatStore - stream events handles system event with message
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/stores/chatStore.ts:125:15
       const unlisten = await listen<FrontendStreamEvent>(
         `agent-stream:${workspaceId}`,
         (event) => {
-          if (token.cancelled) return;
+          if (false) return;
           const payload = event.payload;
           pushStreamEvent(workspaceId, "event_received", payload.type);
killedBy: chatStore - clearMessages token cancellation L215 clearMessages cancels token so stream events are ignored
statusReason: expected 'should be ignored' to be '' // Object.is equality

[Killed] StringLiteral
src/stores/chatStore.ts:127:40
         (event) => {
           if (token.cancelled) return;
           const payload = event.payload;
-          pushStreamEvent(workspaceId, "event_received", payload.type);
+          pushStreamEvent(workspaceId, "", payload.type);
           handleStreamEvent(workspaceId, payload, set, get);
         },
killedBy: chatStore - subscribe cancellation tokens pushStreamEvent is called with event_received on handler invocation
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-push', 'event_received', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "ws-push",

[Killed] BlockStatement
src/stores/chatStore.ts:132:28
         },
       );
 
-      if (token.cancelled) {
-        unlisten();
-        _chatSubscribeTokens.delete(workspaceId);
-        return;
-      }
+      if (token.cancelled) {}
 
       set((state) => ({
killedBy: chatStore - subscribe cancellation tokens token cancelled after listen causes unlisten and token cleanup
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/stores/chatStore.ts:132:11
         },
       );
 
-      if (token.cancelled) {
+      if (false) {
         unlisten();
         _chatSubscribeTokens.delete(workspaceId);
killedBy: chatStore - subscribe cancellation tokens token cancelled after listen causes unlisten and token cleanup
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
src/stores/chatStore.ts:138:11
         return;
       }
 
-      set((state) => ({
-        subscriptions: { ...state.subscriptions, [workspaceId]: unlisten },
-      }));
+      set(() => undefined);
 
       // Recover any pending permission request that was lost during HMR.
killedBy: chatStore - subscribe registers a listener and stores unlisten
statusReason: Cannot read properties of undefined (reading 'subscriptions')

[Killed] BlockStatement
src/stores/chatStore.ts:145:26
       // Recover any pending permission request that was lost during HMR.
       // The backend tracks these so we can restore the UI after a frontend reload.
       getPendingPermission(workspaceId)
-        .then((event) => {
-          if (event && event.type === "permissionRequest" && !token.cancelled) {
-            set((state) => ({
-              permissionRequest: {
-                ...state.permissionRequest,
-                [workspaceId]: {
-                  toolName: event.toolName,
-                  input: event.input,
-                  suggestions: event.suggestions,
-                },
-              },
-            }));
-          }
-        })
+        .then((event) => {})
         .catch(() => {
           // Non-critical — permission will time out on the sidecar side
killedBy: chatStore - subscribe cancellation tokens recovers pending permission request after subscribe
statusReason: expected undefined to be truthy

[Killed] LogicalOperator
src/stores/chatStore.ts:146:15
       // The backend tracks these so we can restore the UI after a frontend reload.
       getPendingPermission(workspaceId)
         .then((event) => {
-          if (event && event.type === "permissionRequest" && !token.cancelled) {
+          if (event || event.type === "permissionRequest" && !token.cancelled) {
             set((state) => ({
               permissionRequest: {
killedBy: chatStore - subscribe cancellation tokens permission recovery ignores non-permissionRequest event types
statusReason: expected { toolName: undefined, …(2) } to be undefined

[Killed] ConditionalExpression
src/stores/chatStore.ts:146:15
       // The backend tracks these so we can restore the UI after a frontend reload.
       getPendingPermission(workspaceId)
         .then((event) => {
-          if (event && event.type === "permissionRequest" && !token.cancelled) {
+          if (true) {
             set((state) => ({
               permissionRequest: {
killedBy: chatStore - subscribe cancellation tokens permission recovery ignores non-permissionRequest event types
statusReason: expected { toolName: undefined, …(2) } to be undefined

[Killed] ArrowFunction
src/stores/chatStore.ts:147:17
       getPendingPermission(workspaceId)
         .then((event) => {
           if (event && event.type === "permissionRequest" && !token.cancelled) {
-            set((state) => ({
-              permissionRequest: {
-                ...state.permissionRequest,
-                [workspaceId]: {
-                  toolName: event.toolName,
-                  input: event.input,
-                  suggestions: event.suggestions,
-                },
-              },
-            }));
+            set(() => undefined);
           }
         })
killedBy: chatStore - subscribe cancellation tokens recovers pending permission request after subscribe
statusReason: Cannot read properties of undefined (reading 'permissionRequest')

[Killed] ObjectLiteral
src/stores/chatStore.ts:148:34
         .then((event) => {
           if (event && event.type === "permissionRequest" && !token.cancelled) {
             set((state) => ({
-              permissionRequest: {
-                ...state.permissionRequest,
-                [workspaceId]: {
-                  toolName: event.toolName,
-                  input: event.input,
-                  suggestions: event.suggestions,
-                },
-              },
+              permissionRequest: {},
             }));
           }
killedBy: chatStore - subscribe cancellation tokens recovers pending permission request after subscribe
statusReason: expected undefined to be truthy

[Killed] ObjectLiteral
src/stores/chatStore.ts:150:32
             set((state) => ({
               permissionRequest: {
                 ...state.permissionRequest,
-                [workspaceId]: {
-                  toolName: event.toolName,
-                  input: event.input,
-                  suggestions: event.suggestions,
-                },
+                [workspaceId]: {},
               },
             }));
killedBy: chatStore - subscribe cancellation tokens recovers pending permission request after subscribe
statusReason: expected undefined to be 'Bash' // Object.is equality

[Killed] BlockStatement
src/stores/chatStore.ts:162:17
         .catch(() => {
           // Non-critical — permission will time out on the sidecar side
         });
-    } catch (e) {
-      console.error(`[chatStore] subscribe failed for ${workspaceId}:`, e);
-      _chatSubscribeTokens.delete(workspaceId);
-      // Remove any partial subscription state so a retry can succeed
-      // Stryker disable next-line ObjectLiteral: rest spread preserves other workspaces
-      set((state) => {
-        const { [workspaceId]: _, ...rest } = state.subscriptions;
-        return { subscriptions: rest };
-      });
-    }
+    } catch (e) {}
   },
 
killedBy: chatStore - subscribe cancellation tokens error handler logs and cleans up partial subscription state
statusReason: expected "error" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] StringLiteral
src/stores/chatStore.ts:163:21
           // Non-critical — permission will time out on the sidecar side
         });
     } catch (e) {
-      console.error(`[chatStore] subscribe failed for ${workspaceId}:`, e);
+      console.error(``, e);
       _chatSubscribeTokens.delete(workspaceId);
       // Remove any partial subscription state so a retry can succeed
killedBy: chatStore - subscribe cancellation tokens error handler logs and cleans up partial subscription state
statusReason: expected "error" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Received: 

  1st error call:

  [
-   StringContaining "[chatStore] subscribe failed",

[Killed] BlockStatement
src/stores/chatStore.ts:167:22
       _chatSubscribeTokens.delete(workspaceId);
       // Remove any partial subscription state so a retry can succeed
       // Stryker disable next-line ObjectLiteral: rest spread preserves other workspaces
-      set((state) => {
-        const { [workspaceId]: _, ...rest } = state.subscriptions;
-        return { subscriptions: rest };
-      });
+      set((state) => {});
     }
   },
killedBy: chatStore - error catch cleans up only failed subscription L167 error catch preserves other workspace subscriptions
statusReason: Cannot read properties of undefined (reading 'subscriptions')

[Survived] ObjectLiteral
src/stores/chatStore.ts:169:16
       // Stryker disable next-line ObjectLiteral: rest spread preserves other workspaces
       set((state) => {
         const { [workspaceId]: _, ...rest } = state.subscriptions;
-        return { subscriptions: rest };
+        return {};
       });
     }

[Killed] BlockStatement
src/stores/chatStore.ts:174:41
     }
   },
 
-  unsubscribe: (workspaceId: string) => {
-    // Cancel any in-flight subscribe so it bails out on resume
-    const token = _chatSubscribeTokens.get(workspaceId);
-    if (token) {
-      token.cancelled = true;
-      _chatSubscribeTokens.delete(workspaceId);
-    }
-
-    const unsub = get().subscriptions[workspaceId];
-    if (unsub) {
-      unsub();
-      set((state) => {
-        const { [workspaceId]: _, ...rest } = state.subscriptions;
-        return { subscriptions: rest };
-      });
-    }
-  },
+  unsubscribe: (workspaceId: string) => {},
 
   addUserMessage: (workspaceId: string, text: string, displayText?: string) => {
killedBy: chatStore - unsubscribe calls unlisten and removes subscription
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/stores/chatStore.ts:177:9
   unsubscribe: (workspaceId: string) => {
     // Cancel any in-flight subscribe so it bails out on resume
     const token = _chatSubscribeTokens.get(workspaceId);
-    if (token) {
+    if (true) {
       token.cancelled = true;
       _chatSubscribeTokens.delete(workspaceId);
killedBy: chatStore - unsubscribe calls unlisten and removes subscription
statusReason: Cannot set properties of undefined (setting 'cancelled')

[Killed] ConditionalExpression
src/stores/chatStore.ts:177:9
   unsubscribe: (workspaceId: string) => {
     // Cancel any in-flight subscribe so it bails out on resume
     const token = _chatSubscribeTokens.get(workspaceId);
-    if (token) {
+    if (false) {
       token.cancelled = true;
       _chatSubscribeTokens.delete(workspaceId);
killedBy: chatStore - subscribe token timing edge cases token cancelled between loadMessages and listen bails out
statusReason: expected [Function Mock] to be undefined

[Killed] BooleanLiteral
src/stores/chatStore.ts:178:25
     // Cancel any in-flight subscribe so it bails out on resume
     const token = _chatSubscribeTokens.get(workspaceId);
     if (token) {
-      token.cancelled = true;
+      token.cancelled = false;
       _chatSubscribeTokens.delete(workspaceId);
     }
killedBy: chatStore - subscribe token timing edge cases token cancelled between loadMessages and listen bails out
statusReason: expected [Function Mock] to be undefined

[Killed] ConditionalExpression
src/stores/chatStore.ts:183:9
     }
 
     const unsub = get().subscriptions[workspaceId];
-    if (unsub) {
+    if (true) {
       unsub();
       set((state) => {
killedBy: chatStore - unsubscribe is a no-op for unknown workspace
statusReason: unsub is not a function

[Killed] ConditionalExpression
src/stores/chatStore.ts:183:9
     }
 
     const unsub = get().subscriptions[workspaceId];
-    if (unsub) {
+    if (false) {
       unsub();
       set((state) => {
killedBy: chatStore - unsubscribe calls unlisten and removes subscription
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/stores/chatStore.ts:185:22
     const unsub = get().subscriptions[workspaceId];
     if (unsub) {
       unsub();
-      set((state) => {
-        const { [workspaceId]: _, ...rest } = state.subscriptions;
-        return { subscriptions: rest };
-      });
+      set((state) => {});
     }
   },
killedBy: chatStore - unsubscribe calls unlisten and removes subscription
statusReason: Cannot read properties of undefined (reading 'subscriptions')

[Killed] BlockStatement
src/stores/chatStore.ts:192:80
     }
   },
 
-  addUserMessage: (workspaceId: string, text: string, displayText?: string) => {
-    const msg: ChatMessage = {
-      id: crypto.randomUUID(),
-      role: "user",
-      content: [{ type: "text", text }],
-      timestamp: Date.now(),
-      ...(displayText ? { displayText } : {}),
-    };
-    set((state) => ({
-      messages: {
-        ...state.messages,
-        [workspaceId]: [...(state.messages[workspaceId] ?? []), msg],
-      },
-      planApproval: { ...state.planApproval, [workspaceId]: false },
-      permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
-      questionRequest: { ...state.questionRequest, [workspaceId]: null },
-      conductorPhase: { ...state.conductorPhase, [workspaceId]: "idle" },
-    }));
-    persistMessage(workspaceId, msg);
-  },
+  addUserMessage: (workspaceId: string, text: string, displayText?: string) => {},
 
   clearMessages: (workspaceId: string) => {
killedBy: chatStore - addUserMessage adds a user message to the workspace
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
src/stores/chatStore.ts:200:9
       timestamp: Date.now(),
       ...(displayText ? { displayText } : {}),
     };
-    set((state) => ({
-      messages: {
-        ...state.messages,
-        [workspaceId]: [...(state.messages[workspaceId] ?? []), msg],
-      },
-      planApproval: { ...state.planApproval, [workspaceId]: false },
-      permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
-      questionRequest: { ...state.questionRequest, [workspaceId]: null },
-      conductorPhase: { ...state.conductorPhase, [workspaceId]: "idle" },
-    }));
+    set(() => undefined);
     persistMessage(workspaceId, msg);
   },
killedBy: chatStore - addUserMessage adds a user message to the workspace
statusReason: Cannot read properties of undefined (reading 'messages')

[Killed] LogicalOperator
src/stores/chatStore.ts:203:29
     set((state) => ({
       messages: {
         ...state.messages,
-        [workspaceId]: [...(state.messages[workspaceId] ?? []), msg],
+        [workspaceId]: [...(state.messages[workspaceId] && []), msg],
       },
       planApproval: { ...state.planApproval, [workspaceId]: false },
killedBy: chatStore - addUserMessage adds a user message to the workspace
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ArrayDeclaration
src/stores/chatStore.ts:203:60
     set((state) => ({
       messages: {
         ...state.messages,
-        [workspaceId]: [...(state.messages[workspaceId] ?? []), msg],
+        [workspaceId]: [...(state.messages[workspaceId] ?? ["Stryker was here"]), msg],
       },
       planApproval: { ...state.planApproval, [workspaceId]: false },
killedBy: chatStore - addUserMessage adds a user message to the workspace
statusReason: expected [ 'Stryker was here', { …(4) } ] to have a length of 1 but got 2

[Killed] BooleanLiteral
src/stores/chatStore.ts:205:61
         ...state.messages,
         [workspaceId]: [...(state.messages[workspaceId] ?? []), msg],
       },
-      planApproval: { ...state.planApproval, [workspaceId]: false },
+      planApproval: { ...state.planApproval, [workspaceId]: true },
       permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
       questionRequest: { ...state.questionRequest, [workspaceId]: null },
killedBy: chatStore - addUserMessage resets conductor state resets planApproval to false
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/stores/chatStore.ts:208:65
       planApproval: { ...state.planApproval, [workspaceId]: false },
       permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
       questionRequest: { ...state.questionRequest, [workspaceId]: null },
-      conductorPhase: { ...state.conductorPhase, [workspaceId]: "idle" },
+      conductorPhase: { ...state.conductorPhase, [workspaceId]: "" },
     }));
     persistMessage(workspaceId, msg);
killedBy: chatStore - addUserMessage resets conductor state resets conductorPhase to idle
statusReason: expected '' to be 'idle' // Object.is equality

[Killed] ConditionalExpression
src/stores/chatStore.ts:222:9
 
     // Tear down the stream listener.
     const unsub = get().subscriptions[workspaceId];
-    if (unsub) unsub();
+    if (false) unsub();
 
     set((state) => {
killedBy: chatStore - clearMessages cancels tokens and tears down tears down subscription on clearMessages
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/stores/chatStore.ts:222:9
 
     // Tear down the stream listener.
     const unsub = get().subscriptions[workspaceId];
-    if (unsub) unsub();
+    if (true) unsub();
 
     set((state) => {
killedBy: chatStore - clearMessages clears messages and streaming text
statusReason: unsub is not a function

[Killed] BlockStatement
src/stores/chatStore.ts:224:20
     const unsub = get().subscriptions[workspaceId];
     if (unsub) unsub();
 
-    set((state) => {
-      const { [workspaceId]: _, ...restStats } = state.sessionStats;
-      const { [workspaceId]: _sub, ...restSubs } = state.subscriptions;
-      return {
-        messages: { ...state.messages, [workspaceId]: [] },
-        streamingText: { ...state.streamingText, [workspaceId]: "" },
-        planApproval: { ...state.planApproval, [workspaceId]: false },
-        permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
-        questionRequest: { ...state.questionRequest, [workspaceId]: null },
-        conductorPhase: { ...state.conductorPhase, [workspaceId]: "idle" },
-        sessionStats: restStats,
-        subscriptions: restSubs,
-      };
-    });
+    set((state) => {});
     // Wait for the backend DB clear to finish BEFORE re-subscribing.
     // subscribe() calls loadMessages() when the in-memory array is empty,
killedBy: chatStore - clearMessages clears messages and streaming text
statusReason: Cannot read properties of undefined (reading 'messages')

[Killed] ObjectLiteral
src/stores/chatStore.ts:228:19
       const { [workspaceId]: _, ...restStats } = state.sessionStats;
       const { [workspaceId]: _sub, ...restSubs } = state.subscriptions;
       return {
-        messages: { ...state.messages, [workspaceId]: [] },
+        messages: {},
         streamingText: { ...state.streamingText, [workspaceId]: "" },
         planApproval: { ...state.planApproval, [workspaceId]: false },
killedBy: chatStore - clearMessages clears messages and streaming text
statusReason: expected undefined to deeply equal []

[Killed] ObjectLiteral
src/stores/chatStore.ts:229:24
       const { [workspaceId]: _sub, ...restSubs } = state.subscriptions;
       return {
         messages: { ...state.messages, [workspaceId]: [] },
-        streamingText: { ...state.streamingText, [workspaceId]: "" },
+        streamingText: {},
         planApproval: { ...state.planApproval, [workspaceId]: false },
         permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
killedBy: chatStore - clearMessages clears messages and streaming text
statusReason: expected undefined to be '' // Object.is equality

[Killed] BooleanLiteral
src/stores/chatStore.ts:230:63
       return {
         messages: { ...state.messages, [workspaceId]: [] },
         streamingText: { ...state.streamingText, [workspaceId]: "" },
-        planApproval: { ...state.planApproval, [workspaceId]: false },
+        planApproval: { ...state.planApproval, [workspaceId]: true },
         permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
         questionRequest: { ...state.questionRequest, [workspaceId]: null },
killedBy: chatStore - clearMessages resets all workspace state resets planApproval to false
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/stores/chatStore.ts:231:28
         messages: { ...state.messages, [workspaceId]: [] },
         streamingText: { ...state.streamingText, [workspaceId]: "" },
         planApproval: { ...state.planApproval, [workspaceId]: false },
-        permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
+        permissionRequest: {},
         questionRequest: { ...state.questionRequest, [workspaceId]: null },
         conductorPhase: { ...state.conductorPhase, [workspaceId]: "idle" },
killedBy: chatStore - clearMessages resets all workspace state resets permissionRequest to null
statusReason: expected undefined to be null

[Killed] ObjectLiteral
src/stores/chatStore.ts:232:26
         streamingText: { ...state.streamingText, [workspaceId]: "" },
         planApproval: { ...state.planApproval, [workspaceId]: false },
         permissionRequest: { ...state.permissionRequest, [workspaceId]: null },
-        questionRequest: { ...state.questionRequest, [workspaceId]: null },
+        questionRequest: {},
         conductorPhase: { ...state.conductorPhase, [workspaceId]: "idle" },
         sessionStats: restStats,
killedBy: chatStore - clearMessages resets all workspace state resets questionRequest to null
statusReason: expected undefined to be null
