--- src/commands/agent.rs
+++ replace == with != in respond_to_permission
@@ -587,17 +587,17 @@
     decision_classification: Option<String>,
 ) -> Result<(), AppError> {
     let id = parse_agent_workspace_id(&workspace_id)?;
 
     let agent_type = {
         let settings = state.settings.read().unwrap();
         settings.agent_type.clone()
     };
-    if agent_type == AgentType::CodexCli {
+    if agent_type != /* ~ changed by cargo-mutants ~ */ AgentType::CodexCli {
         return Err(AppError::AgentError(
             "Permission responses are not supported with Codex CLI".to_string(),
         ));
     }
 
     // Normalize null values to None so they are omitted from the sidecar JSON.
     // Tauri deserializes JS `null` as Some(Value::Null) rather than None.
     let updated_permissions = updated_permissions.filter(|v| !v.is_null());
