[Killed] BlockStatement
src/stores/diffStore.ts:75:44
   patchPreviews: {},
   patchLoading: {},
 
-  loadDiff: async (workspaceId: string) => {
-    if (_inflightDiff.has(workspaceId)) return;
-    _inflightDiff.add(workspaceId);
-    const hasCached = workspaceId in get().diffResults;
-    set((state) => ({
-      loading: { ...state.loading, [workspaceId]: !hasCached },
-      error: { ...state.error, [workspaceId]: null },
-    }));
-    try {
-      const result = await getDiffCmd(workspaceId);
-      set((state) => ({
-        diffResults: { ...state.diffResults, [workspaceId]: result },
-        loading: { ...state.loading, [workspaceId]: false },
-      }));
-    } catch (e) {
-      set((state) => ({
-        loading: { ...state.loading, [workspaceId]: false },
-        error: hasCached
-          ? state.error
-          : { ...state.error, [workspaceId]: String(e) },
-      }));
-    } finally {
-      _inflightDiff.delete(workspaceId);
-    }
-  },
+  loadDiff: async (workspaceId: string) => {},
 
   loadFileDiff: async (workspaceId: string, filePath: string) => {
killedBy: diffStore - loadDiff loads diff result for workspace
statusReason: expected undefined to deeply equal { files: [ 'a.ts', 'b.ts' ] }

[Killed] ConditionalExpression
src/stores/diffStore.ts:76:9
   patchLoading: {},
 
   loadDiff: async (workspaceId: string) => {
-    if (_inflightDiff.has(workspaceId)) return;
+    if (false) return;
     _inflightDiff.add(workspaceId);
     const hasCached = workspaceId in get().diffResults;
killedBy: diffStore - loadDiff inflight dedup deduplicates concurrent calls
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/stores/diffStore.ts:76:9
   patchLoading: {},
 
   loadDiff: async (workspaceId: string) => {
-    if (_inflightDiff.has(workspaceId)) return;
+    if (true) return;
     _inflightDiff.add(workspaceId);
     const hasCached = workspaceId in get().diffResults;
killedBy: diffStore - loadDiff loads diff result for workspace
statusReason: expected undefined to deeply equal { files: [ 'a.ts', 'b.ts' ] }

[Killed] ArrowFunction
src/stores/diffStore.ts:79:9
     if (_inflightDiff.has(workspaceId)) return;
     _inflightDiff.add(workspaceId);
     const hasCached = workspaceId in get().diffResults;
-    set((state) => ({
-      loading: { ...state.loading, [workspaceId]: !hasCached },
-      error: { ...state.error, [workspaceId]: null },
-    }));
+    set(() => undefined);
     try {
       const result = await getDiffCmd(workspaceId);
killedBy: diffStore - loadDiff loads diff result for workspace
statusReason: Cannot read properties of undefined (reading 'loading')

[Killed] BooleanLiteral
src/stores/diffStore.ts:80:51
     _inflightDiff.add(workspaceId);
     const hasCached = workspaceId in get().diffResults;
     set((state) => ({
-      loading: { ...state.loading, [workspaceId]: !hasCached },
+      loading: { ...state.loading, [workspaceId]: hasCached },
       error: { ...state.error, [workspaceId]: null },
     }));
killedBy: diffStore - loading state transitions sets loading true during loadDiff when no cached data
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:83:9
       loading: { ...state.loading, [workspaceId]: !hasCached },
       error: { ...state.error, [workspaceId]: null },
     }));
-    try {
-      const result = await getDiffCmd(workspaceId);
-      set((state) => ({
-        diffResults: { ...state.diffResults, [workspaceId]: result },
-        loading: { ...state.loading, [workspaceId]: false },
-      }));
-    } catch (e) {
+    try {} catch (e) {
       set((state) => ({
         loading: { ...state.loading, [workspaceId]: false },
killedBy: diffStore - loadDiff loads diff result for workspace
statusReason: expected undefined to deeply equal { files: [ 'a.ts', 'b.ts' ] }

[Killed] ArrowFunction
src/stores/diffStore.ts:85:11
     }));
     try {
       const result = await getDiffCmd(workspaceId);
-      set((state) => ({
-        diffResults: { ...state.diffResults, [workspaceId]: result },
-        loading: { ...state.loading, [workspaceId]: false },
-      }));
+      set(() => undefined);
     } catch (e) {
       set((state) => ({
killedBy: diffStore - loadDiff loads diff result for workspace
statusReason: Cannot read properties of undefined (reading 'diffResults')

[Killed] BooleanLiteral
src/stores/diffStore.ts:87:53
       const result = await getDiffCmd(workspaceId);
       set((state) => ({
         diffResults: { ...state.diffResults, [workspaceId]: result },
-        loading: { ...state.loading, [workspaceId]: false },
+        loading: { ...state.loading, [workspaceId]: true },
       }));
     } catch (e) {
killedBy: diffStore - loadDiff loads diff result for workspace
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:89:17
         diffResults: { ...state.diffResults, [workspaceId]: result },
         loading: { ...state.loading, [workspaceId]: false },
       }));
-    } catch (e) {
-      set((state) => ({
-        loading: { ...state.loading, [workspaceId]: false },
-        error: hasCached
-          ? state.error
-          : { ...state.error, [workspaceId]: String(e) },
-      }));
-    } finally {
+    } catch (e) {} finally {
       _inflightDiff.delete(workspaceId);
     }
killedBy: diffStore - loadDiff sets error on failure
statusReason: expected null to be 'Error: fail' // Object.is equality

[Killed] ArrowFunction
src/stores/diffStore.ts:90:11
         loading: { ...state.loading, [workspaceId]: false },
       }));
     } catch (e) {
-      set((state) => ({
-        loading: { ...state.loading, [workspaceId]: false },
-        error: hasCached
-          ? state.error
-          : { ...state.error, [workspaceId]: String(e) },
-      }));
+      set(() => undefined);
     } finally {
       _inflightDiff.delete(workspaceId);
killedBy: diffStore - loadDiff sets error on failure
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] BooleanLiteral
src/stores/diffStore.ts:91:53
       }));
     } catch (e) {
       set((state) => ({
-        loading: { ...state.loading, [workspaceId]: false },
+        loading: { ...state.loading, [workspaceId]: true },
         error: hasCached
           ? state.error
killedBy: diffStore - loadDiff error sets loading false sets loading false on loadDiff failure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:96:15
           ? state.error
           : { ...state.error, [workspaceId]: String(e) },
       }));
-    } finally {
-      _inflightDiff.delete(workspaceId);
-    }
+    } finally {}
   },
 
killedBy: diffStore - loadDiff sets error on failure
statusReason: expected undefined to be 'Error: fail' // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:101:66
     }
   },
 
-  loadFileDiff: async (workspaceId: string, filePath: string) => {
-    const key = `${workspaceId}:${filePath}`;
-    try {
-      const result = await getFileDiffCmd(workspaceId, filePath);
-      set((state) => ({
-        fileDiffs: { ...state.fileDiffs, [key]: result },
-      }));
-    } catch (e) {
-      console.error("Failed to load file diff:", e);
-    }
-  },
+  loadFileDiff: async (workspaceId: string, filePath: string) => {},
 
   loadRepoDiff: async (repoId: string) => {
killedBy: diffStore - loadFileDiff loads file diff content
statusReason: expected undefined to deeply equal { before: 'old', after: 'new' }

[Killed] BlockStatement
src/stores/diffStore.ts:103:9
 
   loadFileDiff: async (workspaceId: string, filePath: string) => {
     const key = `${workspaceId}:${filePath}`;
-    try {
-      const result = await getFileDiffCmd(workspaceId, filePath);
-      set((state) => ({
-        fileDiffs: { ...state.fileDiffs, [key]: result },
-      }));
-    } catch (e) {
+    try {} catch (e) {
       console.error("Failed to load file diff:", e);
     }
killedBy: diffStore - loadFileDiff loads file diff content
statusReason: expected undefined to deeply equal { before: 'old', after: 'new' }

[Killed] ArrowFunction
src/stores/diffStore.ts:105:11
     const key = `${workspaceId}:${filePath}`;
     try {
       const result = await getFileDiffCmd(workspaceId, filePath);
-      set((state) => ({
-        fileDiffs: { ...state.fileDiffs, [key]: result },
-      }));
+      set(() => undefined);
     } catch (e) {
       console.error("Failed to load file diff:", e);
killedBy: diffStore - loadFileDiff loads file diff content
statusReason: Cannot read properties of undefined (reading 'fileDiffs')

[Killed] ObjectLiteral
src/stores/diffStore.ts:105:23
     const key = `${workspaceId}:${filePath}`;
     try {
       const result = await getFileDiffCmd(workspaceId, filePath);
-      set((state) => ({
-        fileDiffs: { ...state.fileDiffs, [key]: result },
-      }));
+      set((state) => ({}));
     } catch (e) {
       console.error("Failed to load file diff:", e);
killedBy: diffStore - loadFileDiff loads file diff content
statusReason: expected undefined to deeply equal { before: 'old', after: 'new' }

[Killed] BlockStatement
src/stores/diffStore.ts:108:17
       set((state) => ({
         fileDiffs: { ...state.fileDiffs, [key]: result },
       }));
-    } catch (e) {
-      console.error("Failed to load file diff:", e);
-    }
+    } catch (e) {}
   },
 
killedBy: diffStore - loadFileDiff logs error on failure
statusReason: expected "error" to be called at least once

[Killed] BlockStatement
src/stores/diffStore.ts:113:43
     }
   },
 
-  loadRepoDiff: async (repoId: string) => {
-    if (_inflightRepoDiff.has(repoId)) return;
-    _inflightRepoDiff.add(repoId);
-    const hasCached = repoId in get().diffResults;
-    set((state) => ({
-      loading: { ...state.loading, [repoId]: !hasCached },
-      error: { ...state.error, [repoId]: null },
-    }));
-    try {
-      const result = await getRepoDiffCmd(repoId);
-      set((state) => ({
-        diffResults: { ...state.diffResults, [repoId]: result },
-        loading: { ...state.loading, [repoId]: false },
-      }));
-    } catch (e) {
-      set((state) => ({
-        loading: { ...state.loading, [repoId]: false },
-        error: hasCached
-          ? state.error
-          : { ...state.error, [repoId]: String(e) },
-      }));
-    } finally {
-      _inflightRepoDiff.delete(repoId);
-    }
-  },
+  loadRepoDiff: async (repoId: string) => {},
 
   loadRepoFileDiff: async (repoId: string, filePath: string) => {
killedBy: diffStore - loadRepoDiff loads repo diff
statusReason: expected undefined to deeply equal { files: [ 'c.rs' ] }

[Killed] ConditionalExpression
src/stores/diffStore.ts:114:9
   },
 
   loadRepoDiff: async (repoId: string) => {
-    if (_inflightRepoDiff.has(repoId)) return;
+    if (true) return;
     _inflightRepoDiff.add(repoId);
     const hasCached = repoId in get().diffResults;
killedBy: diffStore - loadRepoDiff loads repo diff
statusReason: expected undefined to deeply equal { files: [ 'c.rs' ] }

[Killed] ConditionalExpression
src/stores/diffStore.ts:114:9
   },
 
   loadRepoDiff: async (repoId: string) => {
-    if (_inflightRepoDiff.has(repoId)) return;
+    if (false) return;
     _inflightRepoDiff.add(repoId);
     const hasCached = repoId in get().diffResults;
killedBy: diffStore - loadRepoDiff inflight dedup deduplicates concurrent calls
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/stores/diffStore.ts:117:9
     if (_inflightRepoDiff.has(repoId)) return;
     _inflightRepoDiff.add(repoId);
     const hasCached = repoId in get().diffResults;
-    set((state) => ({
-      loading: { ...state.loading, [repoId]: !hasCached },
-      error: { ...state.error, [repoId]: null },
-    }));
+    set(() => undefined);
     try {
       const result = await getRepoDiffCmd(repoId);
killedBy: diffStore - loadRepoDiff loads repo diff
statusReason: Cannot read properties of undefined (reading 'loading')

[Killed] ObjectLiteral
src/stores/diffStore.ts:117:21
     if (_inflightRepoDiff.has(repoId)) return;
     _inflightRepoDiff.add(repoId);
     const hasCached = repoId in get().diffResults;
-    set((state) => ({
-      loading: { ...state.loading, [repoId]: !hasCached },
-      error: { ...state.error, [repoId]: null },
-    }));
+    set((state) => ({}));
     try {
       const result = await getRepoDiffCmd(repoId);
killedBy: diffStore - loadRepoDiff inflight dedup suppresses error when cached data exists
statusReason: expected undefined to be null

[Killed] BooleanLiteral
src/stores/diffStore.ts:118:46
     _inflightRepoDiff.add(repoId);
     const hasCached = repoId in get().diffResults;
     set((state) => ({
-      loading: { ...state.loading, [repoId]: !hasCached },
+      loading: { ...state.loading, [repoId]: hasCached },
       error: { ...state.error, [repoId]: null },
     }));
killedBy: diffStore - loading state transitions sets loading true during loadRepoDiff when no cached data
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/stores/diffStore.ts:118:16
     _inflightRepoDiff.add(repoId);
     const hasCached = repoId in get().diffResults;
     set((state) => ({
-      loading: { ...state.loading, [repoId]: !hasCached },
+      loading: {},
       error: { ...state.error, [repoId]: null },
     }));
killedBy: diffStore - loading state transitions sets loading true during loadRepoDiff when no cached data
statusReason: expected undefined to be true // Object.is equality

[Killed] ObjectLiteral
src/stores/diffStore.ts:119:14
     const hasCached = repoId in get().diffResults;
     set((state) => ({
       loading: { ...state.loading, [repoId]: !hasCached },
-      error: { ...state.error, [repoId]: null },
+      error: {},
     }));
     try {
killedBy: diffStore - loadRepoDiff inflight dedup suppresses error when cached data exists
statusReason: expected undefined to be null

[Killed] BlockStatement
src/stores/diffStore.ts:121:9
       loading: { ...state.loading, [repoId]: !hasCached },
       error: { ...state.error, [repoId]: null },
     }));
-    try {
-      const result = await getRepoDiffCmd(repoId);
-      set((state) => ({
-        diffResults: { ...state.diffResults, [repoId]: result },
-        loading: { ...state.loading, [repoId]: false },
-      }));
-    } catch (e) {
+    try {} catch (e) {
       set((state) => ({
         loading: { ...state.loading, [repoId]: false },
killedBy: diffStore - loadRepoDiff loads repo diff
statusReason: expected undefined to deeply equal { files: [ 'c.rs' ] }

[Killed] ArrowFunction
src/stores/diffStore.ts:123:11
     }));
     try {
       const result = await getRepoDiffCmd(repoId);
-      set((state) => ({
-        diffResults: { ...state.diffResults, [repoId]: result },
-        loading: { ...state.loading, [repoId]: false },
-      }));
+      set(() => undefined);
     } catch (e) {
       set((state) => ({
killedBy: diffStore - loadRepoDiff loads repo diff
statusReason: Cannot read properties of undefined (reading 'diffResults')

[Killed] ObjectLiteral
src/stores/diffStore.ts:123:23
     }));
     try {
       const result = await getRepoDiffCmd(repoId);
-      set((state) => ({
-        diffResults: { ...state.diffResults, [repoId]: result },
-        loading: { ...state.loading, [repoId]: false },
-      }));
+      set((state) => ({}));
     } catch (e) {
       set((state) => ({
killedBy: diffStore - loadRepoDiff loads repo diff
statusReason: expected undefined to deeply equal { files: [ 'c.rs' ] }

[Killed] BooleanLiteral
src/stores/diffStore.ts:125:48
       const result = await getRepoDiffCmd(repoId);
       set((state) => ({
         diffResults: { ...state.diffResults, [repoId]: result },
-        loading: { ...state.loading, [repoId]: false },
+        loading: { ...state.loading, [repoId]: true },
       }));
     } catch (e) {
killedBy: diffStore - loading state transitions sets loading false after loadRepoDiff completes
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/stores/diffStore.ts:125:18
       const result = await getRepoDiffCmd(repoId);
       set((state) => ({
         diffResults: { ...state.diffResults, [repoId]: result },
-        loading: { ...state.loading, [repoId]: false },
+        loading: {},
       }));
     } catch (e) {
killedBy: diffStore - loading state transitions sets loading false after loadRepoDiff completes
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:127:17
         diffResults: { ...state.diffResults, [repoId]: result },
         loading: { ...state.loading, [repoId]: false },
       }));
-    } catch (e) {
-      set((state) => ({
-        loading: { ...state.loading, [repoId]: false },
-        error: hasCached
-          ? state.error
-          : { ...state.error, [repoId]: String(e) },
-      }));
-    } finally {
+    } catch (e) {} finally {
       _inflightRepoDiff.delete(repoId);
     }
killedBy: diffStore - loadRepoDiff sets error on failure
statusReason: expected null to be 'Error: repo diff fail' // Object.is equality

[Killed] ArrowFunction
src/stores/diffStore.ts:128:11
         loading: { ...state.loading, [repoId]: false },
       }));
     } catch (e) {
-      set((state) => ({
-        loading: { ...state.loading, [repoId]: false },
-        error: hasCached
-          ? state.error
-          : { ...state.error, [repoId]: String(e) },
-      }));
+      set(() => undefined);
     } finally {
       _inflightRepoDiff.delete(repoId);
killedBy: diffStore - loadRepoDiff sets error on failure
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] BooleanLiteral
src/stores/diffStore.ts:129:48
       }));
     } catch (e) {
       set((state) => ({
-        loading: { ...state.loading, [repoId]: false },
+        loading: { ...state.loading, [repoId]: true },
         error: hasCached
           ? state.error
killedBy: diffStore - loadRepoDiff sets error on failure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:134:15
           ? state.error
           : { ...state.error, [repoId]: String(e) },
       }));
-    } finally {
-      _inflightRepoDiff.delete(repoId);
-    }
+    } finally {}
   },
 
killedBy: diffStore - loadRepoDiff sets error on failure
statusReason: expected undefined to be 'Error: repo diff fail' // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:139:65
     }
   },
 
-  loadRepoFileDiff: async (repoId: string, filePath: string) => {
-    const key = `${repoId}:${filePath}`;
-    try {
-      const result = await getRepoFileDiffCmd(repoId, filePath);
-      set((state) => ({
-        fileDiffs: { ...state.fileDiffs, [key]: result },
-      }));
-    } catch (e) {
-      console.error("Failed to load repo file diff:", e);
-    }
-  },
+  loadRepoFileDiff: async (repoId: string, filePath: string) => {},
 
   selectFile: (workspaceId: string, filePath: string) => {
killedBy: diffStore - loadRepoFileDiff loads repo file diff content
statusReason: expected undefined to deeply equal { before: 'old', after: 'new' }

[Killed] BlockStatement
src/stores/diffStore.ts:141:9
 
   loadRepoFileDiff: async (repoId: string, filePath: string) => {
     const key = `${repoId}:${filePath}`;
-    try {
-      const result = await getRepoFileDiffCmd(repoId, filePath);
-      set((state) => ({
-        fileDiffs: { ...state.fileDiffs, [key]: result },
-      }));
-    } catch (e) {
+    try {} catch (e) {
       console.error("Failed to load repo file diff:", e);
     }
killedBy: diffStore - loadRepoFileDiff loads repo file diff content
statusReason: expected undefined to deeply equal { before: 'old', after: 'new' }

[Killed] ArrowFunction
src/stores/diffStore.ts:143:11
     const key = `${repoId}:${filePath}`;
     try {
       const result = await getRepoFileDiffCmd(repoId, filePath);
-      set((state) => ({
-        fileDiffs: { ...state.fileDiffs, [key]: result },
-      }));
+      set(() => undefined);
     } catch (e) {
       console.error("Failed to load repo file diff:", e);
killedBy: diffStore - loadRepoFileDiff loads repo file diff content
statusReason: Cannot read properties of undefined (reading 'fileDiffs')

[Killed] ObjectLiteral
src/stores/diffStore.ts:144:20
     try {
       const result = await getRepoFileDiffCmd(repoId, filePath);
       set((state) => ({
-        fileDiffs: { ...state.fileDiffs, [key]: result },
+        fileDiffs: {},
       }));
     } catch (e) {
killedBy: diffStore - loadRepoFileDiff loads repo file diff content
statusReason: expected undefined to deeply equal { before: 'old', after: 'new' }

[Killed] BlockStatement
src/stores/diffStore.ts:146:17
       set((state) => ({
         fileDiffs: { ...state.fileDiffs, [key]: result },
       }));
-    } catch (e) {
-      console.error("Failed to load repo file diff:", e);
-    }
+    } catch (e) {}
   },
 
killedBy: diffStore - loadRepoFileDiff logs error on failure
statusReason: expected "error" to be called at least once

[Killed] BlockStatement
src/stores/diffStore.ts:151:58
     }
   },
 
-  selectFile: (workspaceId: string, filePath: string) => {
-    set((state) => ({
-      selectedFile: { ...state.selectedFile, [workspaceId]: filePath },
-    }));
-    get().loadFileDiff(workspaceId, filePath);
-  },
+  selectFile: (workspaceId: string, filePath: string) => {},
 
   selectRepoFile: (repoId: string, filePath: string) => {
killedBy: diffStore - selectFile sets selected file and triggers loadFileDiff
statusReason: expected undefined to be 'src/a.ts' // Object.is equality

[Killed] ArrowFunction
src/stores/diffStore.ts:152:9
   },
 
   selectFile: (workspaceId: string, filePath: string) => {
-    set((state) => ({
-      selectedFile: { ...state.selectedFile, [workspaceId]: filePath },
-    }));
+    set(() => undefined);
     get().loadFileDiff(workspaceId, filePath);
   },
killedBy: diffStore - selectFile sets selected file and triggers loadFileDiff
statusReason: Cannot read properties of undefined (reading 'loadFileDiff')

[Killed] BlockStatement
src/stores/diffStore.ts:158:57
     get().loadFileDiff(workspaceId, filePath);
   },
 
-  selectRepoFile: (repoId: string, filePath: string) => {
-    set((state) => ({
-      selectedFile: { ...state.selectedFile, [repoId]: filePath },
-    }));
-    get().loadRepoFileDiff(repoId, filePath);
-  },
+  selectRepoFile: (repoId: string, filePath: string) => {},
 
   getDiffResult: (contextId: string) => {
killedBy: diffStore - selectRepoFile sets selected file and triggers loadRepoFileDiff
statusReason: expected undefined to be 'main.rs' // Object.is equality

[Killed] ArrowFunction
src/stores/diffStore.ts:159:9
   },
 
   selectRepoFile: (repoId: string, filePath: string) => {
-    set((state) => ({
-      selectedFile: { ...state.selectedFile, [repoId]: filePath },
-    }));
+    set(() => undefined);
     get().loadRepoFileDiff(repoId, filePath);
   },
killedBy: diffStore - selectRepoFile sets selected file and triggers loadRepoFileDiff
statusReason: Cannot read properties of undefined (reading 'loadRepoFileDiff')

[Killed] BlockStatement
src/stores/diffStore.ts:165:41
     get().loadRepoFileDiff(repoId, filePath);
   },
 
-  getDiffResult: (contextId: string) => {
-    return get().diffResults[contextId] ?? null;
-  },
+  getDiffResult: (contextId: string) => {},
 
   getFileDiffContent: (contextId: string, filePath: string) => {
killedBy: diffStore - getters getDiffResult returns null for unknown context
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/stores/diffStore.ts:166:12
   },
 
   getDiffResult: (contextId: string) => {
-    return get().diffResults[contextId] ?? null;
+    return get().diffResults[contextId] && null;
   },
 
killedBy: diffStore - getters getDiffResult returns null for unknown context
statusReason: expected undefined to be null

[Killed] BlockStatement
src/stores/diffStore.ts:169:64
     return get().diffResults[contextId] ?? null;
   },
 
-  getFileDiffContent: (contextId: string, filePath: string) => {
-    const key = `${contextId}:${filePath}`;
-    return get().fileDiffs[key] ?? null;
-  },
+  getFileDiffContent: (contextId: string, filePath: string) => {},
 
   getSelectedFile: (contextId: string) => {
killedBy: diffStore - getters getFileDiffContent returns null for unknown key
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/stores/diffStore.ts:171:12
 
   getFileDiffContent: (contextId: string, filePath: string) => {
     const key = `${contextId}:${filePath}`;
-    return get().fileDiffs[key] ?? null;
+    return get().fileDiffs[key] && null;
   },
 
killedBy: diffStore - getters getFileDiffContent returns null for unknown key
statusReason: expected undefined to be null

[Killed] BlockStatement
src/stores/diffStore.ts:174:43
     return get().fileDiffs[key] ?? null;
   },
 
-  getSelectedFile: (contextId: string) => {
-    return get().selectedFile[contextId] ?? null;
-  },
+  getSelectedFile: (contextId: string) => {},
 
   refresh: async (workspaceId: string) => {
killedBy: diffStore - getters getSelectedFile returns null for unknown context
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/stores/diffStore.ts:175:12
   },
 
   getSelectedFile: (contextId: string) => {
-    return get().selectedFile[contextId] ?? null;
+    return get().selectedFile[contextId] && null;
   },
 
killedBy: diffStore - getters getSelectedFile returns null for unknown context
statusReason: expected undefined to be null

[Killed] BlockStatement
src/stores/diffStore.ts:178:43
     return get().selectedFile[contextId] ?? null;
   },
 
-  refresh: async (workspaceId: string) => {
-    get().clearPatchPreviews(workspaceId);
-    await get().loadDiff(workspaceId);
-    const selected = get().selectedFile[workspaceId];
-    if (selected) {
-      await get().loadFileDiff(workspaceId, selected);
-    }
-  },
+  refresh: async (workspaceId: string) => {},
 
   refreshRepo: async (repoId: string) => {
killedBy: diffStore - refresh reloads diff and selected file diff
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/diffStore.ts:182:9
     get().clearPatchPreviews(workspaceId);
     await get().loadDiff(workspaceId);
     const selected = get().selectedFile[workspaceId];
-    if (selected) {
+    if (false) {
       await get().loadFileDiff(workspaceId, selected);
     }
killedBy: diffStore - refresh reloads diff and selected file diff
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-1', 'src/a.ts' ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/diffStore.ts:182:9
     get().clearPatchPreviews(workspaceId);
     await get().loadDiff(workspaceId);
     const selected = get().selectedFile[workspaceId];
-    if (selected) {
+    if (true) {
       await get().loadFileDiff(workspaceId, selected);
     }
killedBy: diffStore - refresh skips file diff reload when no file is selected
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "ws-1",

[Killed] BlockStatement
src/stores/diffStore.ts:187:42
     }
   },
 
-  refreshRepo: async (repoId: string) => {
-    get().clearPatchPreviews(repoId);
-    await get().loadRepoDiff(repoId);
-    const selected = get().selectedFile[repoId];
-    if (selected) {
-      await get().loadRepoFileDiff(repoId, selected);
-    }
-  },
+  refreshRepo: async (repoId: string) => {},
 
   loadPatchPreview: async (contextId, filePath, isUntracked, contextType) => {
killedBy: diffStore - refreshRepo reloads repo diff and selected file diff
statusReason: expected "vi.fn()" to be called with arguments: [ 'repo-1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/diffStore.ts:191:9
     get().clearPatchPreviews(repoId);
     await get().loadRepoDiff(repoId);
     const selected = get().selectedFile[repoId];
-    if (selected) {
+    if (true) {
       await get().loadRepoFileDiff(repoId, selected);
     }
killedBy: diffStore - refreshRepo skips file diff reload when no file is selected
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "repo-1",

[Killed] BlockStatement
src/stores/diffStore.ts:191:19
     get().clearPatchPreviews(repoId);
     await get().loadRepoDiff(repoId);
     const selected = get().selectedFile[repoId];
-    if (selected) {
-      await get().loadRepoFileDiff(repoId, selected);
-    }
+    if (selected) {}
   },
 
killedBy: diffStore - refreshRepo reloads repo diff and selected file diff
statusReason: expected "vi.fn()" to be called with arguments: [ 'repo-1', 'main.rs' ]

Number of calls: 0
