[Killed] BlockStatement
src/stores/diffStore.ts:196:78
     }
   },
 
-  loadPatchPreview: async (contextId, filePath, isUntracked, contextType) => {
-    const key = `${contextId}:${filePath}`;
-    if (get().patchPreviews[key] || _inflightPatch.has(key)) return;
-    _inflightPatch.add(key);
-    set((state) => ({
-      patchLoading: { ...state.patchLoading, [key]: true },
-    }));
-    try {
-      const result =
-        contextType === "workspace"
-          ? await getFilePatchCmd(contextId, filePath, isUntracked)
-          : await getRepoFilePatchCmd(contextId, filePath, isUntracked);
-      set((state) => ({
-        patchPreviews: { ...state.patchPreviews, [key]: result },
-        patchLoading: { ...state.patchLoading, [key]: false },
-      }));
-    } catch (e) {
-      console.error("Failed to load patch preview:", e);
-      set((state) => ({
-        patchLoading: { ...state.patchLoading, [key]: false },
-      }));
-    } finally {
-      _inflightPatch.delete(key);
-    }
-  },
+  loadPatchPreview: async (contextId, filePath, isUntracked, contextType) => {},
 
   getPatchPreview: (contextId, filePath) => {
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: expected undefined to deeply equal { path: 'a.ts', …(3) }

[Killed] StringLiteral
src/stores/diffStore.ts:197:17
   },
 
   loadPatchPreview: async (contextId, filePath, isUntracked, contextType) => {
-    const key = `${contextId}:${filePath}`;
+    const key = ``;
     if (get().patchPreviews[key] || _inflightPatch.has(key)) return;
     _inflightPatch.add(key);
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: expected undefined to deeply equal { path: 'a.ts', …(3) }

[Killed] LogicalOperator
src/stores/diffStore.ts:198:9
 
   loadPatchPreview: async (contextId, filePath, isUntracked, contextType) => {
     const key = `${contextId}:${filePath}`;
-    if (get().patchPreviews[key] || _inflightPatch.has(key)) return;
+    if (get().patchPreviews[key] && _inflightPatch.has(key)) return;
     _inflightPatch.add(key);
     set((state) => ({
killedBy: diffStore - loadPatchPreview returns cached value on second call
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/stores/diffStore.ts:198:9
 
   loadPatchPreview: async (contextId, filePath, isUntracked, contextType) => {
     const key = `${contextId}:${filePath}`;
-    if (get().patchPreviews[key] || _inflightPatch.has(key)) return;
+    if (false) return;
     _inflightPatch.add(key);
     set((state) => ({
killedBy: diffStore - loadPatchPreview returns cached value on second call
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ArrowFunction
src/stores/diffStore.ts:200:9
     const key = `${contextId}:${filePath}`;
     if (get().patchPreviews[key] || _inflightPatch.has(key)) return;
     _inflightPatch.add(key);
-    set((state) => ({
-      patchLoading: { ...state.patchLoading, [key]: true },
-    }));
+    set(() => undefined);
     try {
       const result =
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: Cannot read properties of undefined (reading 'patchLoading')

[Killed] BooleanLiteral
src/stores/diffStore.ts:201:53
     if (get().patchPreviews[key] || _inflightPatch.has(key)) return;
     _inflightPatch.add(key);
     set((state) => ({
-      patchLoading: { ...state.patchLoading, [key]: true },
+      patchLoading: { ...state.patchLoading, [key]: false },
     }));
     try {
killedBy: diffStore - patch preview loading state sets patchLoading true during loadPatchPreview
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:203:9
     set((state) => ({
       patchLoading: { ...state.patchLoading, [key]: true },
     }));
-    try {
-      const result =
-        contextType === "workspace"
-          ? await getFilePatchCmd(contextId, filePath, isUntracked)
-          : await getRepoFilePatchCmd(contextId, filePath, isUntracked);
-      set((state) => ({
-        patchPreviews: { ...state.patchPreviews, [key]: result },
-        patchLoading: { ...state.patchLoading, [key]: false },
-      }));
-    } catch (e) {
+    try {} catch (e) {
       console.error("Failed to load patch preview:", e);
       set((state) => ({
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: expected undefined to deeply equal { path: 'a.ts', …(3) }

[Killed] ConditionalExpression
src/stores/diffStore.ts:205:9
     }));
     try {
       const result =
-        contextType === "workspace"
+        false
           ? await getFilePatchCmd(contextId, filePath, isUntracked)
           : await getRepoFilePatchCmd(contextId, filePath, isUntracked);
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: expected undefined to deeply equal { path: 'a.ts', …(3) }

[Killed] ConditionalExpression
src/stores/diffStore.ts:205:9
     }));
     try {
       const result =
-        contextType === "workspace"
+        true
           ? await getFilePatchCmd(contextId, filePath, isUntracked)
           : await getRepoFilePatchCmd(contextId, filePath, isUntracked);
killedBy: diffStore - loadPatchPreview uses getRepoFilePatch for repo context
statusReason: expected "vi.fn()" to be called with arguments: [ 'r1', 'main.rs', false ]

Number of calls: 0

[Killed] ArrowFunction
src/stores/diffStore.ts:208:11
         contextType === "workspace"
           ? await getFilePatchCmd(contextId, filePath, isUntracked)
           : await getRepoFilePatchCmd(contextId, filePath, isUntracked);
-      set((state) => ({
-        patchPreviews: { ...state.patchPreviews, [key]: result },
-        patchLoading: { ...state.patchLoading, [key]: false },
-      }));
+      set(() => undefined);
     } catch (e) {
       console.error("Failed to load patch preview:", e);
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: Cannot read properties of undefined (reading 'patchPreviews')

[Killed] ObjectLiteral
src/stores/diffStore.ts:209:24
           ? await getFilePatchCmd(contextId, filePath, isUntracked)
           : await getRepoFilePatchCmd(contextId, filePath, isUntracked);
       set((state) => ({
-        patchPreviews: { ...state.patchPreviews, [key]: result },
+        patchPreviews: {},
         patchLoading: { ...state.patchLoading, [key]: false },
       }));
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: expected undefined to deeply equal { path: 'a.ts', …(3) }

[Killed] BooleanLiteral
src/stores/diffStore.ts:210:55
           : await getRepoFilePatchCmd(contextId, filePath, isUntracked);
       set((state) => ({
         patchPreviews: { ...state.patchPreviews, [key]: result },
-        patchLoading: { ...state.patchLoading, [key]: false },
+        patchLoading: { ...state.patchLoading, [key]: true },
       }));
     } catch (e) {
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/stores/diffStore.ts:210:23
           : await getRepoFilePatchCmd(contextId, filePath, isUntracked);
       set((state) => ({
         patchPreviews: { ...state.patchPreviews, [key]: result },
-        patchLoading: { ...state.patchLoading, [key]: false },
+        patchLoading: {},
       }));
     } catch (e) {
killedBy: diffStore - loadPatchPreview loads and caches patch preview for workspace
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:212:17
         patchPreviews: { ...state.patchPreviews, [key]: result },
         patchLoading: { ...state.patchLoading, [key]: false },
       }));
-    } catch (e) {
-      console.error("Failed to load patch preview:", e);
-      set((state) => ({
-        patchLoading: { ...state.patchLoading, [key]: false },
-      }));
-    } finally {
+    } catch (e) {} finally {
       _inflightPatch.delete(key);
     }
killedBy: diffStore - loadPatchPreview logs error on failure
statusReason: expected "error" to be called at least once

[Killed] ArrowFunction
src/stores/diffStore.ts:214:11
       }));
     } catch (e) {
       console.error("Failed to load patch preview:", e);
-      set((state) => ({
-        patchLoading: { ...state.patchLoading, [key]: false },
-      }));
+      set(() => undefined);
     } finally {
       _inflightPatch.delete(key);
killedBy: diffStore - loadPatchPreview logs error on failure
statusReason: Cannot read properties of undefined (reading 'patchLoading')

[Killed] BooleanLiteral
src/stores/diffStore.ts:215:55
     } catch (e) {
       console.error("Failed to load patch preview:", e);
       set((state) => ({
-        patchLoading: { ...state.patchLoading, [key]: false },
+        patchLoading: { ...state.patchLoading, [key]: true },
       }));
     } finally {
killedBy: diffStore - loadPatchPreview logs error on failure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:217:15
       set((state) => ({
         patchLoading: { ...state.patchLoading, [key]: false },
       }));
-    } finally {
-      _inflightPatch.delete(key);
-    }
+    } finally {}
   },
 
killedBy: diffStore - loadPatchPreview returns cached value on second call
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/stores/diffStore.ts:222:45
     }
   },
 
-  getPatchPreview: (contextId, filePath) => {
-    const key = `${contextId}:${filePath}`;
-    return get().patchPreviews[key] ?? null;
-  },
+  getPatchPreview: (contextId, filePath) => {},
 
   clearPatchPreviews: (contextId) => {
killedBy: diffStore - getPatchPreview returns null for unknown key
statusReason: expected undefined to be null

[Killed] StringLiteral
src/stores/diffStore.ts:223:17
   },
 
   getPatchPreview: (contextId, filePath) => {
-    const key = `${contextId}:${filePath}`;
+    const key = ``;
     return get().patchPreviews[key] ?? null;
   },
killedBy: diffStore - getPatchPreview returns cached preview
statusReason: expected null to deeply equal { path: 'a.ts', …(3) }

[Killed] LogicalOperator
src/stores/diffStore.ts:224:12
 
   getPatchPreview: (contextId, filePath) => {
     const key = `${contextId}:${filePath}`;
-    return get().patchPreviews[key] ?? null;
+    return get().patchPreviews[key] && null;
   },
 
killedBy: diffStore - getPatchPreview returns null for unknown key
statusReason: expected undefined to be null

[Killed] BlockStatement
src/stores/diffStore.ts:227:38
     return get().patchPreviews[key] ?? null;
   },
 
-  clearPatchPreviews: (contextId) => {
-    const newPreviews = { ...get().patchPreviews };
-    const newLoading = { ...get().patchLoading };
-    for (const key of Object.keys(newPreviews)) {
-      if (key.startsWith(`${contextId}:`)) {
-        delete newPreviews[key];
-        delete newLoading[key];
-      }
-    }
-    set({ patchPreviews: newPreviews, patchLoading: newLoading });
-  },
+  clearPatchPreviews: (contextId) => {},
 }));
 
killedBy: diffStore - clearPatchPreviews removes cached entries for context
statusReason: expected { path: 'a.ts' } to be undefined

[Killed] ObjectLiteral
src/stores/diffStore.ts:229:24
 
   clearPatchPreviews: (contextId) => {
     const newPreviews = { ...get().patchPreviews };
-    const newLoading = { ...get().patchLoading };
+    const newLoading = {};
     for (const key of Object.keys(newPreviews)) {
       if (key.startsWith(`${contextId}:`)) {
killedBy: diffStore - clearPatchPreviews clears both previews and loading for workspace prefix
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/stores/diffStore.ts:230:49
   clearPatchPreviews: (contextId) => {
     const newPreviews = { ...get().patchPreviews };
     const newLoading = { ...get().patchLoading };
-    for (const key of Object.keys(newPreviews)) {
-      if (key.startsWith(`${contextId}:`)) {
-        delete newPreviews[key];
-        delete newLoading[key];
-      }
-    }
+    for (const key of Object.keys(newPreviews)) {}
     set({ patchPreviews: newPreviews, patchLoading: newLoading });
   },
killedBy: diffStore - clearPatchPreviews removes cached entries for context
statusReason: expected { path: 'a.ts' } to be undefined

[Killed] BlockStatement
src/stores/diffStore.ts:231:44
     const newPreviews = { ...get().patchPreviews };
     const newLoading = { ...get().patchLoading };
     for (const key of Object.keys(newPreviews)) {
-      if (key.startsWith(`${contextId}:`)) {
-        delete newPreviews[key];
-        delete newLoading[key];
-      }
+      if (key.startsWith(`${contextId}:`)) {}
     }
     set({ patchPreviews: newPreviews, patchLoading: newLoading });
killedBy: diffStore - clearPatchPreviews removes cached entries for context
statusReason: expected { path: 'a.ts' } to be undefined

[Killed] MethodExpression
src/stores/diffStore.ts:231:11
     const newPreviews = { ...get().patchPreviews };
     const newLoading = { ...get().patchLoading };
     for (const key of Object.keys(newPreviews)) {
-      if (key.startsWith(`${contextId}:`)) {
+      if (key.endsWith(`${contextId}:`)) {
         delete newPreviews[key];
         delete newLoading[key];
killedBy: diffStore - clearPatchPreviews removes cached entries for context
statusReason: expected { path: 'a.ts' } to be undefined
