[Killed] BlockStatement
src/stores/fileViewerStore.ts:62:61
   setActiveTabInPane: (pane: PaneId, tabId: string) => void;
 }
 
-function tabId(contextId: string, filePath: string): string {
-  return `${contextId}:${filePath}`;
-}
+function tabId(contextId: string, filePath: string): string {}
 
 export function detectLanguage(filePath: string): string {
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: expected undefined to be 'ws1:src/app.ts' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:63:10
 }
 
 function tabId(contextId: string, filePath: string): string {
-  return `${contextId}:${filePath}`;
+  return ``;
 }
 
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: expected '' to be 'ws1:src/app.ts' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:69:9
 export function detectLanguage(filePath: string): string {
   const ext = filePath.split(".").pop()!;
   const map: Record<string, string> = {
-    ts: "typescript",
+    ts: "",
     tsx: "typescript",
     js: "javascript",
killedBy: detectLanguage returns app.ts for typescript
statusReason: expected '' to be 'typescript' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:71:9
   const map: Record<string, string> = {
     ts: "typescript",
     tsx: "typescript",
-    js: "javascript",
+    js: "",
     jsx: "javascript",
     rs: "rust",
killedBy: detectLanguage returns app.js for javascript
statusReason: expected '' to be 'javascript' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:72:10
     ts: "typescript",
     tsx: "typescript",
     js: "javascript",
-    jsx: "javascript",
+    jsx: "",
     rs: "rust",
     py: "python",
killedBy: detectLanguage returns app.jsx for javascript
statusReason: expected '' to be 'javascript' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:76:9
     rs: "rust",
     py: "python",
     json: "json",
-    md: "markdown",
+    md: "",
     css: "css",
     html: "html",
killedBy: detectLanguage returns README.md for markdown
statusReason: expected '' to be 'markdown' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:78:11
     json: "json",
     md: "markdown",
     css: "css",
-    html: "html",
+    html: "",
     toml: "toml",
     yaml: "yaml",
killedBy: detectLanguage returns index.html for html
statusReason: expected '' to be 'html' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:83:9
     yaml: "yaml",
     yml: "yaml",
     sh: "shell",
-    go: "go",
+    go: "",
     java: "java",
     swift: "swift",
killedBy: detectLanguage returns main.go for go
statusReason: expected '' to be 'go' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:85:12
     sh: "shell",
     go: "go",
     java: "java",
-    swift: "swift",
+    swift: "",
     c: "c",
     cpp: "cpp",
killedBy: detectLanguage returns App.swift for swift
statusReason: expected '' to be 'swift' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:88:9
     swift: "swift",
     c: "c",
     cpp: "cpp",
-    cs: "csharp",
+    cs: "",
     rb: "ruby",
     php: "php",
killedBy: detectLanguage returns Program.cs for csharp
statusReason: expected '' to be 'csharp' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:93:11
     php: "php",
     sql: "sql",
     xml: "xml",
-    scss: "scss",
+    scss: "",
   };
   return map[ext] ?? "plaintext";
killedBy: detectLanguage returns style.scss for scss
statusReason: expected '' to be 'scss' // Object.is equality

[Killed] LogicalOperator
src/stores/fileViewerStore.ts:95:10
     xml: "xml",
     scss: "scss",
   };
-  return map[ext] ?? "plaintext";
+  return map[ext] && "plaintext";
 }
 
killedBy: detectLanguage returns app.ts for typescript
statusReason: expected 'plaintext' to be 'typescript' // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:99:3
 }
 
 const TS_LANGUAGES = new Set([
-  "typescript",
+  "",
   "javascript",
 ]);
killedBy: fileViewerStore - openFile loads type definitions for TypeScript files
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'workspace' ]

Number of calls: 0

[Killed] StringLiteral
src/stores/fileViewerStore.ts:100:3
 
 const TS_LANGUAGES = new Set([
   "typescript",
-  "javascript",
+  "",
 ]);
 
killedBy: fileViewerStore - openFile loads type definitions for JavaScript files
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'workspace' ]

Number of calls: 0

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:111:7
 ) {
   try {
     const result =
-      contextType === "workspace"
+      contextType !== "workspace"
         ? await readWorkspaceFile(contextId, filePath)
         : await readRepoFile(contextId, filePath);
killedBy: fileViewerStore - openFile calls readRepoFile for repo context type
statusReason: expected "vi.fn()" to be called with arguments: [ 'repo1', 'src/main.rs' ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:117:9
 
     /* v8 ignore start -- v8 miscounts implicit else branch */
     // Load type definitions for TypeScript/JavaScript files (non-blocking)
-    if (TS_LANGUAGES.has(result.language)) {
+    if (false) {
       ensureTypesLoaded(contextId, contextType).catch(() => {});
     }
killedBy: fileViewerStore - openFile loads type definitions for TypeScript files
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'workspace' ]

Number of calls: 0

[Killed] BlockStatement
src/stores/fileViewerStore.ts:117:44
 
     /* v8 ignore start -- v8 miscounts implicit else branch */
     // Load type definitions for TypeScript/JavaScript files (non-blocking)
-    if (TS_LANGUAGES.has(result.language)) {
-      ensureTypesLoaded(contextId, contextType).catch(() => {});
-    }
+    if (TS_LANGUAGES.has(result.language)) {}
     /* v8 ignore stop */
 
killedBy: fileViewerStore - openFile loads type definitions for TypeScript files
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'workspace' ]

Number of calls: 0

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:122:33
     }
     /* v8 ignore stop */
 
-    useFileViewerStore.setState((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === id
-          ? {
-              ...t,
-              content: result.content,
-              editedContent: null,
-              language: result.language,
-              loading: false,
-              dirty: false,
-            }
-          : t,
-      ),
-    }));
+    useFileViewerStore.setState(() => undefined);
   } catch (e) {
     useFileViewerStore.setState((state) => ({
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: Cannot destructure property 'tabs' of '__vi_import_1__.useFileViewerStore.getState(...)' as it is undefined.

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:123:28
     /* v8 ignore stop */
 
     useFileViewerStore.setState((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === id
-          ? {
-              ...t,
-              content: result.content,
-              editedContent: null,
-              language: result.language,
-              loading: false,
-              dirty: false,
-            }
-          : t,
+      tabs: state.tabs.map(() => undefined,
       ),
     }));
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:124:9
 
     useFileViewerStore.setState((state) => ({
       tabs: state.tabs.map((t) =>
-        t.id === id
+        t.id !== id
           ? {
               ...t,
killedBy: fileViewerStore - openFile does not call ensureTypesLoaded for non-TS files
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:124:9
 
     useFileViewerStore.setState((state) => ({
       tabs: state.tabs.map((t) =>
-        t.id === id
+        true
           ? {
               ...t,
killedBy: fileViewerStore - openFile fetchContent success path leaves non-matching tabs unchanged
statusReason: expected 'second' to be 'first' // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:130:24
               content: result.content,
               editedContent: null,
               language: result.language,
-              loading: false,
+              loading: true,
               dirty: false,
             }
killedBy: fileViewerStore - openFile does not call ensureTypesLoaded for non-TS files
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:131:22
               editedContent: null,
               language: result.language,
               loading: false,
-              dirty: false,
+              dirty: true,
             }
           : t,
killedBy: fileViewerStore - tab creation defaults new tab starts with dirty=false after content loads
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:136:15
           : t,
       ),
     }));
-  } catch (e) {
-    useFileViewerStore.setState((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === id ? { ...t, loading: false, error: String(e) } : t,
-      ),
-    }));
-  }
+  } catch (e) {}
 }
 
killedBy: fileViewerStore - openFile sets error on fetchContent failure
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:137:33
       ),
     }));
   } catch (e) {
-    useFileViewerStore.setState((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === id ? { ...t, loading: false, error: String(e) } : t,
-      ),
-    }));
+    useFileViewerStore.setState(() => undefined);
   }
 }
killedBy: fileViewerStore - openFile sets error on fetchContent failure
statusReason: Cannot read properties of undefined (reading 'tabs')

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:137:45
       ),
     }));
   } catch (e) {
-    useFileViewerStore.setState((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === id ? { ...t, loading: false, error: String(e) } : t,
-      ),
-    }));
+    useFileViewerStore.setState((state) => ({}));
   }
 }
killedBy: fileViewerStore - openFile sets error on fetchContent failure
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:138:28
     }));
   } catch (e) {
     useFileViewerStore.setState((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === id ? { ...t, loading: false, error: String(e) } : t,
+      tabs: state.tabs.map(() => undefined,
       ),
     }));
killedBy: fileViewerStore - openFile sets error on fetchContent failure
statusReason: Cannot read properties of undefined (reading 'loading')

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:139:9
   } catch (e) {
     useFileViewerStore.setState((state) => ({
       tabs: state.tabs.map((t) =>
-        t.id === id ? { ...t, loading: false, error: String(e) } : t,
+        true ? { ...t, loading: false, error: String(e) } : t,
       ),
     }));
killedBy: fileViewerStore - openFile fetchContent error path leaves non-matching tabs unchanged
statusReason: expected 'Error: read fail' to be null

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:139:40
   } catch (e) {
     useFileViewerStore.setState((state) => ({
       tabs: state.tabs.map((t) =>
-        t.id === id ? { ...t, loading: false, error: String(e) } : t,
+        t.id === id ? { ...t, loading: true, error: String(e) } : t,
       ),
     }));
killedBy: fileViewerStore - openFile sets error on fetchContent failure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:146:80
 }
 
 /** Pick the next available tab for a pane after a tab is removed, excluding a specific tab. */
-function pickNextTab(tabs: FileTab[], excludeId: string | null): string | null {
-  const available = tabs.find((t) => t.id !== excludeId);
-  return available?.id ?? null;
-}
+function pickNextTab(tabs: FileTab[], excludeId: string | null): string | null {}
 
 // Stryker disable all: initial state values — reset by tests in beforeEach
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:147:38
 
 /** Pick the next available tab for a pane after a tab is removed, excluding a specific tab. */
 function pickNextTab(tabs: FileTab[], excludeId: string | null): string | null {
-  const available = tabs.find((t) => t.id !== excludeId);
+  const available = tabs.find((t) => true);
   return available?.id ?? null;
 }
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:147:38
 
 /** Pick the next available tab for a pane after a tab is removed, excluding a specific tab. */
 function pickNextTab(tabs: FileTab[], excludeId: string | null): string | null {
-  const available = tabs.find((t) => t.id !== excludeId);
+  const available = tabs.find((t) => false);
   return available?.id ?? null;
 }
killedBy: fileViewerStore - split editor closeTab in split mode picks next tab when left pane tab is closed
statusReason: expected null to be 'ctx1:c.ts' // Object.is equality

[Killed] LogicalOperator
src/stores/fileViewerStore.ts:148:10
 /** Pick the next available tab for a pane after a tab is removed, excluding a specific tab. */
 function pickNextTab(tabs: FileTab[], excludeId: string | null): string | null {
   const available = tabs.find((t) => t.id !== excludeId);
-  return available?.id ?? null;
+  return available?.id && null;
 }
 
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
src/stores/fileViewerStore.ts:148:10
 /** Pick the next available tab for a pane after a tab is removed, excluding a specific tab. */
 function pickNextTab(tabs: FileTab[], excludeId: string | null): string | null {
   const available = tabs.find((t) => t.id !== excludeId);
-  return available?.id ?? null;
+  return available.id ?? null;
 }
 
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:164:60
   rightActiveTabId: null,
 // Stryker restore all
 
-  openFile: async (contextId, contextType, filePath, pin = false) => {
+  openFile: async (contextId, contextType, filePath, pin = true) => {
     const id = tabId(contextId, filePath);
     const state = get();
killedBy: fileViewerStore - openFile pins tab when re-opening with pin=true
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:167:38
   openFile: async (contextId, contextType, filePath, pin = false) => {
     const id = tabId(contextId, filePath);
     const state = get();
-    const existing = state.tabs.find((t) => t.id === id);
+    const existing = state.tabs.find(() => undefined);
 
     if (existing) {
killedBy: fileViewerStore - openFile activates existing tab instead of creating duplicate
statusReason: expected [ { id: 'ws1:file.ts', …(11) }, …(2) ] to have a length of 2 but got 3

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:167:45
   openFile: async (contextId, contextType, filePath, pin = false) => {
     const id = tabId(contextId, filePath);
     const state = get();
-    const existing = state.tabs.find((t) => t.id === id);
+    const existing = state.tabs.find((t) => t.id !== id);
 
     if (existing) {
killedBy: fileViewerStore - openFile activates existing tab instead of creating duplicate
statusReason: expected [ { id: 'ws1:file.ts', …(11) } ] to have a length of 2 but got 1

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:173:20
       // Already open — activate it in the focused pane (or single pane), and pin if requested
       const updates: Partial<FileViewerStore> = {
         activeTabId: id,
-        ...(pin && !existing.pinned
+        ...(pin && existing.pinned
           ? {
               tabs: state.tabs.map((t) =>
killedBy: fileViewerStore - openFile pins tab when re-opening with pin=true
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/stores/fileViewerStore.ts:173:13
       // Already open — activate it in the focused pane (or single pane), and pin if requested
       const updates: Partial<FileViewerStore> = {
         activeTabId: id,
-        ...(pin && !existing.pinned
+        ...(pin || !existing.pinned
           ? {
               tabs: state.tabs.map((t) =>
killedBy: fileViewerStore - openFile pin/reuse edge cases re-opening existing tab without pin does NOT pin it
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:175:36
         activeTabId: id,
         ...(pin && !existing.pinned
           ? {
-              tabs: state.tabs.map((t) =>
-                t.id === id ? { ...t, pinned: true } : t,
+              tabs: state.tabs.map(() => undefined,
               ),
             }
killedBy: fileViewerStore - openFile pins tab when re-opening with pin=true
statusReason: Cannot read properties of undefined (reading 'pinned')

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:176:17
         ...(pin && !existing.pinned
           ? {
               tabs: state.tabs.map((t) =>
-                t.id === id ? { ...t, pinned: true } : t,
+                true ? { ...t, pinned: true } : t,
               ),
             }
killedBy: fileViewerStore - openFile pin only targets specific tab re-opening with pin=true only pins the target tab, not others
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:176:17
         ...(pin && !existing.pinned
           ? {
               tabs: state.tabs.map((t) =>
-                t.id === id ? { ...t, pinned: true } : t,
+                t.id !== id ? { ...t, pinned: true } : t,
               ),
             }
killedBy: fileViewerStore - openFile pins tab when re-opening with pin=true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:182:11
           : {}),
       };
 
-      if (state.splitActive) {
+      if (true) {
         if (state.focusedPane === "left") {
           updates.leftActiveTabId = id;
killedBy: fileViewerStore - openFile reuse NON-split does NOT touch pane IDs re-opening existing tab in non-split mode leaves pane IDs null
statusReason: expected 'ctx1:exist.ts' to be null

[Killed] BlockStatement
src/stores/fileViewerStore.ts:182:30
           : {}),
       };
 
-      if (state.splitActive) {
-        if (state.focusedPane === "left") {
-          updates.leftActiveTabId = id;
-        } else {
-          updates.rightActiveTabId = id;
-        }
-      }
+      if (state.splitActive) {}
 
       set(updates);
killedBy: fileViewerStore - split editor openFile re-opens existing tab in split mode with left pane focused
statusReason: expected 'ctx1:a.ts' to be 'ctx1:b.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:183:13
       };
 
       if (state.splitActive) {
-        if (state.focusedPane === "left") {
+        if (true) {
           updates.leftActiveTabId = id;
         } else {
killedBy: fileViewerStore - split editor openFile re-opens existing tab in split mode with right pane focused
statusReason: expected 'ctx1:b.ts' to be 'ctx1:a.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:183:43
       };
 
       if (state.splitActive) {
-        if (state.focusedPane === "left") {
-          updates.leftActiveTabId = id;
-        } else {
+        if (state.focusedPane === "left") {} else {
           updates.rightActiveTabId = id;
         }
killedBy: fileViewerStore - split editor openFile re-opens existing tab in split mode with left pane focused
statusReason: expected 'ctx1:a.ts' to be 'ctx1:b.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:185:16
       if (state.splitActive) {
         if (state.focusedPane === "left") {
           updates.leftActiveTabId = id;
-        } else {
-          updates.rightActiveTabId = id;
-        }
+        } else {}
       }
 
killedBy: fileViewerStore - split editor openFile re-opens existing tab in split mode with right pane focused
statusReason: expected 'ctx1:b.ts' to be 'ctx1:a.ts' // Object.is equality

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:194:29
       return;
     }
 
-    const newTab: FileTab = {
-      id,
-      filePath,
-      contextId,
-      contextType,
-      content: null,
-      editedContent: null,
-      language: detectLanguage(filePath),
-      loading: true,
-      saving: false,
-      error: null,
-      // Stryker disable next-line BooleanLiteral: pinned=pin tested — pin=false verified as false, pin=true as true
-      pinned: pin,
-      dirty: false,
-    };
+    const newTab: FileTab = {};
 
     if (pin) {
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: expected undefined to be 'ws1:src/app.ts' // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:202:16
       content: null,
       editedContent: null,
       language: detectLanguage(filePath),
-      loading: true,
+      loading: false,
       saving: false,
       error: null,
killedBy: fileViewerStore - tab creation defaults new tab starts with loading=true then loading=false
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:203:15
       editedContent: null,
       language: detectLanguage(filePath),
       loading: true,
-      saving: false,
+      saving: true,
       error: null,
       // Stryker disable next-line BooleanLiteral: pinned=pin tested — pin=false verified as false, pin=true as true
killedBy: fileViewerStore - tab creation defaults new tab starts with saving=false
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/stores/fileViewerStore.ts:207:14
       error: null,
       // Stryker disable next-line BooleanLiteral: pinned=pin tested — pin=false verified as false, pin=true as true
       pinned: pin,
-      dirty: false,
+      dirty: true,
     };
 

[Killed] BlockStatement
src/stores/fileViewerStore.ts:210:14
       dirty: false,
     };
 
-    if (pin) {
-      // Pinned: always add a new tab
-      const paneUpdate: Partial<FileViewerStore> = {};
-      if (state.splitActive) {
-        if (state.focusedPane === "left") {
-          paneUpdate.leftActiveTabId = id;
-        } else {
-          paneUpdate.rightActiveTabId = id;
-        }
-      }
-      set((s) => ({
-        tabs: [...s.tabs, newTab],
-        activeTabId: id,
-        ...paneUpdate,
-      }));
-    } else {
+    if (pin) {} else {
       // Preview: replace any existing unpinned preview tab
       const previewIdx = state.tabs.findIndex((t) => !t.pinned);
killedBy: fileViewerStore - openFile activates existing tab instead of creating duplicate
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:210:9
       dirty: false,
     };
 
-    if (pin) {
+    if (false) {
       // Pinned: always add a new tab
       const paneUpdate: Partial<FileViewerStore> = {};
killedBy: fileViewerStore - openFile new tab pin vs preview in non-split new file with pin=true enters pin branch (adds tab, not replaces)
statusReason: expected [ { id: 'ctx1:new-pin.ts', …(11) } ] to have a length of 2 but got 1

[Killed] BlockStatement
src/stores/fileViewerStore.ts:213:30
     if (pin) {
       // Pinned: always add a new tab
       const paneUpdate: Partial<FileViewerStore> = {};
-      if (state.splitActive) {
-        if (state.focusedPane === "left") {
-          paneUpdate.leftActiveTabId = id;
-        } else {
-          paneUpdate.rightActiveTabId = id;
-        }
-      }
+      if (state.splitActive) {}
       set((s) => ({
         tabs: [...s.tabs, newTab],
killedBy: fileViewerStore - split editor openFile in split mode opens in focused pane
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:213:11
     if (pin) {
       // Pinned: always add a new tab
       const paneUpdate: Partial<FileViewerStore> = {};
-      if (state.splitActive) {
+      if (true) {
         if (state.focusedPane === "left") {
           paneUpdate.leftActiveTabId = id;
killedBy: fileViewerStore - openFile non-split does NOT set pane IDs openFile without split active does not set leftActiveTabId
statusReason: expected 'ctx1:nosplit.ts' to be null

[Killed] BlockStatement
src/stores/fileViewerStore.ts:214:43
       // Pinned: always add a new tab
       const paneUpdate: Partial<FileViewerStore> = {};
       if (state.splitActive) {
-        if (state.focusedPane === "left") {
-          paneUpdate.leftActiveTabId = id;
-        } else {
+        if (state.focusedPane === "left") {} else {
           paneUpdate.rightActiveTabId = id;
         }
killedBy: fileViewerStore - split editor openFile in split mode opens pinned tab in left pane when focused
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:216:16
       if (state.splitActive) {
         if (state.focusedPane === "left") {
           paneUpdate.leftActiveTabId = id;
-        } else {
-          paneUpdate.rightActiveTabId = id;
-        }
+        } else {}
       }
       set((s) => ({
killedBy: fileViewerStore - split editor openFile in split mode opens in focused pane
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:220:11
           paneUpdate.rightActiveTabId = id;
         }
       }
-      set((s) => ({
-        tabs: [...s.tabs, newTab],
-        activeTabId: id,
-        ...paneUpdate,
-      }));
+      set(() => undefined);
     } else {
       // Preview: replace any existing unpinned preview tab
killedBy: fileViewerStore - openFile activates existing tab instead of creating duplicate
statusReason: Cannot read properties of undefined (reading 'openFile')

[Killed] ArrayDeclaration
src/stores/fileViewerStore.ts:221:15
         }
       }
       set((s) => ({
-        tabs: [...s.tabs, newTab],
+        tabs: [],
         activeTabId: id,
         ...paneUpdate,
killedBy: fileViewerStore - openFile activates existing tab instead of creating duplicate
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/stores/fileViewerStore.ts:225:12
         activeTabId: id,
         ...paneUpdate,
       }));
-    } else {
-      // Preview: replace any existing unpinned preview tab
-      const previewIdx = state.tabs.findIndex((t) => !t.pinned);
-      const paneUpdate: Partial<FileViewerStore> = {};
-      if (state.splitActive) {
-        if (state.focusedPane === "left") {
-          paneUpdate.leftActiveTabId = id;
-        } else {
-          paneUpdate.rightActiveTabId = id;
-        }
-      }
-      if (previewIdx >= 0) {
-        // Stryker disable next-line ArrayDeclaration: spread copies existing tabs; [] would lose all tabs
-        const newTabs = [...state.tabs];
-        newTabs[previewIdx] = newTab;
-        set({ tabs: newTabs, activeTabId: id, ...paneUpdate });
-      } else {
-        set((s) => ({
-          tabs: [...s.tabs, newTab],
-          activeTabId: id,
-          ...paneUpdate,
-        }));
-      }
-    }
+    } else {}
 
     fetchContent(id, contextId, contextType, filePath);
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:227:47
       }));
     } else {
       // Preview: replace any existing unpinned preview tab
-      const previewIdx = state.tabs.findIndex((t) => !t.pinned);
+      const previewIdx = state.tabs.findIndex(() => undefined);
       const paneUpdate: Partial<FileViewerStore> = {};
       if (state.splitActive) {
killedBy: fileViewerStore - openFile replaces unpinned preview tab when opening new unpinned file
statusReason: expected [ { id: 'ws1:first.ts', …(11) }, …(1) ] to have a length of 1 but got 2

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:227:54
       }));
     } else {
       // Preview: replace any existing unpinned preview tab
-      const previewIdx = state.tabs.findIndex((t) => !t.pinned);
+      const previewIdx = state.tabs.findIndex((t) => t.pinned);
       const paneUpdate: Partial<FileViewerStore> = {};
       if (state.splitActive) {
killedBy: fileViewerStore - openFile replaces unpinned preview tab when opening new unpinned file
statusReason: expected [ { id: 'ws1:first.ts', …(11) }, …(1) ] to have a length of 1 but got 2
