[Killed] EqualityOperator
src/stores/fileViewerStore.ts:230:13
       const previewIdx = state.tabs.findIndex((t) => !t.pinned);
       const paneUpdate: Partial<FileViewerStore> = {};
       if (state.splitActive) {
-        if (state.focusedPane === "left") {
+        if (state.focusedPane !== "left") {
           paneUpdate.leftActiveTabId = id;
         } else {
killedBy: fileViewerStore - split editor openFile preview tab in split mode with left pane focused
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:236:11
           paneUpdate.rightActiveTabId = id;
         }
       }
-      if (previewIdx >= 0) {
+      if (previewIdx > 0) {
         // Stryker disable next-line ArrayDeclaration: spread copies existing tabs; [] would lose all tabs
         const newTabs = [...state.tabs];
killedBy: fileViewerStore - openFile replaces unpinned preview tab when opening new unpinned file
statusReason: expected [ { id: 'ws1:first.ts', …(11) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:236:11
           paneUpdate.rightActiveTabId = id;
         }
       }
-      if (previewIdx >= 0) {
+      if (false) {
         // Stryker disable next-line ArrayDeclaration: spread copies existing tabs; [] would lose all tabs
         const newTabs = [...state.tabs];
killedBy: fileViewerStore - openFile replaces unpinned preview tab when opening new unpinned file
statusReason: expected [ { id: 'ws1:first.ts', …(11) }, …(1) ] to have a length of 1 but got 2

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:240:13
         // Stryker disable next-line ArrayDeclaration: spread copies existing tabs; [] would lose all tabs
         const newTabs = [...state.tabs];
         newTabs[previewIdx] = newTab;
-        set({ tabs: newTabs, activeTabId: id, ...paneUpdate });
+        set({});
       } else {
         set((s) => ({
killedBy: fileViewerStore - openFile replaces unpinned preview tab when opening new unpinned file
statusReason: expected 'ws1:first.ts' to be 'ws1:second.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:241:14
         const newTabs = [...state.tabs];
         newTabs[previewIdx] = newTab;
         set({ tabs: newTabs, activeTabId: id, ...paneUpdate });
-      } else {
-        set((s) => ({
-          tabs: [...s.tabs, newTab],
-          activeTabId: id,
-          ...paneUpdate,
-        }));
-      }
+      } else {}
     }
 
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:242:13
         newTabs[previewIdx] = newTab;
         set({ tabs: newTabs, activeTabId: id, ...paneUpdate });
       } else {
-        set((s) => ({
-          tabs: [...s.tabs, newTab],
-          activeTabId: id,
-          ...paneUpdate,
-        }));
+        set(() => undefined);
       }
     }
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: Cannot destructure property 'tabs' of '__vi_import_1__.useFileViewerStore.getState(...)' as it is undefined.

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:242:21
         newTabs[previewIdx] = newTab;
         set({ tabs: newTabs, activeTabId: id, ...paneUpdate });
       } else {
-        set((s) => ({
-          tabs: [...s.tabs, newTab],
-          activeTabId: id,
-          ...paneUpdate,
-        }));
+        set((s) => ({}));
       }
     }
killedBy: fileViewerStore - openFile creates a new tab and activates it
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/stores/fileViewerStore.ts:253:22
     fetchContent(id, contextId, contextType, filePath);
   },
 
-  pinTab: (tabId) => {
-    set((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === tabId ? { ...t, pinned: true } : t,
-      ),
-    }));
-  },
+  pinTab: (tabId) => {},
 
   closeTab: (closingId) => {
killedBy: fileViewerStore - pinTab marks a tab as pinned
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:254:9
   },
 
   pinTab: (tabId) => {
-    set((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === tabId ? { ...t, pinned: true } : t,
-      ),
-    }));
+    set(() => undefined);
   },
 
killedBy: fileViewerStore - pinTab marks a tab as pinned
statusReason: Cannot read properties of undefined (reading 'tabs')

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:255:28
 
   pinTab: (tabId) => {
     set((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === tabId ? { ...t, pinned: true } : t,
+      tabs: state.tabs.map(() => undefined,
       ),
     }));
killedBy: fileViewerStore - pinTab marks a tab as pinned
statusReason: Cannot read properties of undefined (reading 'pinned')

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:256:9
   pinTab: (tabId) => {
     set((state) => ({
       tabs: state.tabs.map((t) =>
-        t.id === tabId ? { ...t, pinned: true } : t,
+        true ? { ...t, pinned: true } : t,
       ),
     }));
killedBy: fileViewerStore - pinTab leaves non-matching tabs unchanged when pinning
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:256:42
   pinTab: (tabId) => {
     set((state) => ({
       tabs: state.tabs.map((t) =>
-        t.id === tabId ? { ...t, pinned: true } : t,
+        t.id === tabId ? { ...t, pinned: false } : t,
       ),
     }));
killedBy: fileViewerStore - pinTab marks a tab as pinned
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:262:47
   },
 
   closeTab: (closingId) => {
-    const closingTab = get().tabs.find((t) => t.id === closingId);
+    const closingTab = get().tabs.find((t) => false);
     if (closingTab) {
       notifyDocumentClosed(closingTab.filePath);
killedBy: fileViewerStore - closeTab calls notifyDocumentClosed
statusReason: expected "vi.fn()" to be called with arguments: [ 'src/index.ts' ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:262:47
   },
 
   closeTab: (closingId) => {
-    const closingTab = get().tabs.find((t) => t.id === closingId);
+    const closingTab = get().tabs.find((t) => true);
     if (closingTab) {
       notifyDocumentClosed(closingTab.filePath);
killedBy: fileViewerStore - closeTab handles closing non-existent tab gracefully
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "src/main.ts",

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:263:9
 
   closeTab: (closingId) => {
     const closingTab = get().tabs.find((t) => t.id === closingId);
-    if (closingTab) {
+    if (true) {
       notifyDocumentClosed(closingTab.filePath);
     }
killedBy: fileViewerStore - closeTab handles closing non-existent tab gracefully
statusReason: Cannot read properties of undefined (reading 'filePath')

[Killed] BlockStatement
src/stores/fileViewerStore.ts:263:21
 
   closeTab: (closingId) => {
     const closingTab = get().tabs.find((t) => t.id === closingId);
-    if (closingTab) {
-      notifyDocumentClosed(closingTab.filePath);
-    }
+    if (closingTab) {}
 
     set((state) => {
killedBy: fileViewerStore - closeTab calls notifyDocumentClosed
statusReason: expected "vi.fn()" to be called with arguments: [ 'src/index.ts' ]

Number of calls: 0

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:268:47
     }
 
     set((state) => {
-      const idx = state.tabs.findIndex((t) => t.id === closingId);
+      const idx = state.tabs.findIndex((t) => t.id !== closingId);
       const newTabs = state.tabs.filter((t) => t.id !== closingId);
       let newActiveId = state.activeTabId;
killedBy: fileViewerStore - closeTab activates next tab when closing active tab
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:268:47
     }
 
     set((state) => {
-      const idx = state.tabs.findIndex((t) => t.id === closingId);
+      const idx = state.tabs.findIndex((t) => false);
       const newTabs = state.tabs.filter((t) => t.id !== closingId);
       let newActiveId = state.activeTabId;
killedBy: fileViewerStore - closeTab activates next tab when closing active tab
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] MethodExpression
src/stores/fileViewerStore.ts:269:23
 
     set((state) => {
       const idx = state.tabs.findIndex((t) => t.id === closingId);
-      const newTabs = state.tabs.filter((t) => t.id !== closingId);
+      const newTabs = state.tabs;
       let newActiveId = state.activeTabId;
 
killedBy: fileViewerStore - closeTab removes the tab
statusReason: expected [ { id: 'ctx1:src/main.ts', …(11) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:269:48
 
     set((state) => {
       const idx = state.tabs.findIndex((t) => t.id === closingId);
-      const newTabs = state.tabs.filter((t) => t.id !== closingId);
+      const newTabs = state.tabs.filter((t) => false);
       let newActiveId = state.activeTabId;
 
killedBy: fileViewerStore - closeTab activates next tab when closing active tab
statusReason: expected null to be 'ctx1:c.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:277:30
       let newRightId = state.rightActiveTabId;
       let newSplitActive = state.splitActive;
 
-      if (state.splitActive) {
-        // Stryker disable next-line ConditionalExpression: pane-specific check tested via split close tests
-        if (state.leftActiveTabId === closingId) {
-          newLeftId = pickNextTab(newTabs, state.rightActiveTabId);
-        }
-        // Stryker disable next-line ConditionalExpression: pane-specific check tested via split close tests
-        if (state.rightActiveTabId === closingId) {
-          newRightId = pickNextTab(newTabs, state.leftActiveTabId);
-        }
-        // Close split if the right pane has no tab
-        if (newRightId === null) {
-          newSplitActive = false;
-          newActiveId = newLeftId;
-          newLeftId = null;
-          newRightId = null;
-        } else {
-          // Update activeTabId to match focused pane
-          newActiveId = state.focusedPane === "left" ? newLeftId : newRightId;
-        }
-      } else {
+      if (state.splitActive) {} else {
         if (state.activeTabId === closingId) {
           if (newTabs.length === 0) {
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:279:50
 
       if (state.splitActive) {
         // Stryker disable next-line ConditionalExpression: pane-specific check tested via split close tests
-        if (state.leftActiveTabId === closingId) {
-          newLeftId = pickNextTab(newTabs, state.rightActiveTabId);
-        }
+        if (state.leftActiveTabId === closingId) {}
         // Stryker disable next-line ConditionalExpression: pane-specific check tested via split close tests
         if (state.rightActiveTabId === closingId) {
killedBy: fileViewerStore - split editor closeTab in split mode picks next tab when left pane tab is closed
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:279:13
 
       if (state.splitActive) {
         // Stryker disable next-line ConditionalExpression: pane-specific check tested via split close tests
-        if (state.leftActiveTabId === closingId) {
+        if (state.leftActiveTabId !== closingId) {
           newLeftId = pickNextTab(newTabs, state.rightActiveTabId);
         }
killedBy: fileViewerStore - split editor closeTab in split mode picks next tab when left pane tab is closed
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:283:13
           newLeftId = pickNextTab(newTabs, state.rightActiveTabId);
         }
         // Stryker disable next-line ConditionalExpression: pane-specific check tested via split close tests
-        if (state.rightActiveTabId === closingId) {
+        if (state.rightActiveTabId !== closingId) {
           newRightId = pickNextTab(newTabs, state.leftActiveTabId);
         }
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:283:51
           newLeftId = pickNextTab(newTabs, state.rightActiveTabId);
         }
         // Stryker disable next-line ConditionalExpression: pane-specific check tested via split close tests
-        if (state.rightActiveTabId === closingId) {
-          newRightId = pickNextTab(newTabs, state.leftActiveTabId);
-        }
+        if (state.rightActiveTabId === closingId) {}
         // Close split if the right pane has no tab
         if (newRightId === null) {
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:287:13
           newRightId = pickNextTab(newTabs, state.leftActiveTabId);
         }
         // Close split if the right pane has no tab
-        if (newRightId === null) {
+        if (newRightId !== null) {
           newSplitActive = false;
           newActiveId = newLeftId;
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:287:13
           newRightId = pickNextTab(newTabs, state.leftActiveTabId);
         }
         // Close split if the right pane has no tab
-        if (newRightId === null) {
+        if (false) {
           newSplitActive = false;
           newActiveId = newLeftId;
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:288:28
         }
         // Close split if the right pane has no tab
         if (newRightId === null) {
-          newSplitActive = false;
+          newSplitActive = true;
           newActiveId = newLeftId;
           newLeftId = null;
killedBy: fileViewerStore - split editor closeTab in split mode closes split when right pane empties
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:292:16
           newActiveId = newLeftId;
           newLeftId = null;
           newRightId = null;
-        } else {
-          // Update activeTabId to match focused pane
-          newActiveId = state.focusedPane === "left" ? newLeftId : newRightId;
-        }
+        } else {}
       } else {
         if (state.activeTabId === closingId) {
killedBy: fileViewerStore - split editor closeTab in split mode picks next for right pane and stays split
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:294:25
           newRightId = null;
         } else {
           // Update activeTabId to match focused pane
-          newActiveId = state.focusedPane === "left" ? newLeftId : newRightId;
+          newActiveId = state.focusedPane !== "left" ? newLeftId : newRightId;
         }
       } else {
killedBy: fileViewerStore - split editor closeTab in split mode picks next for right pane and stays split
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:294:25
           newRightId = null;
         } else {
           // Update activeTabId to match focused pane
-          newActiveId = state.focusedPane === "left" ? newLeftId : newRightId;
+          newActiveId = false ? newLeftId : newRightId;
         }
       } else {
killedBy: fileViewerStore - closeTab split pane updates activeTabId follows focused pane after close
statusReason: expected 'ctx1:c.ts' to be 'ctx1:b.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:296:14
           // Update activeTabId to match focused pane
           newActiveId = state.focusedPane === "left" ? newLeftId : newRightId;
         }
-      } else {
-        if (state.activeTabId === closingId) {
-          if (newTabs.length === 0) {
-            newActiveId = null;
-          } else {
-            const nextIdx = Math.min(idx, newTabs.length - 1);
-            newActiveId = newTabs[nextIdx].id;
-          }
-        }
-      }
+      } else {}
 
       return {
killedBy: fileViewerStore - closeTab sets activeTabId to null when closing the last tab
statusReason: expected 'ctx1:src/main.ts' to be null

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:297:13
           newActiveId = state.focusedPane === "left" ? newLeftId : newRightId;
         }
       } else {
-        if (state.activeTabId === closingId) {
+        if (state.activeTabId !== closingId) {
           if (newTabs.length === 0) {
             newActiveId = null;
killedBy: fileViewerStore - closeTab sets activeTabId to null when closing the last tab
statusReason: expected 'ctx1:src/main.ts' to be null

[Killed] BlockStatement
src/stores/fileViewerStore.ts:297:46
           newActiveId = state.focusedPane === "left" ? newLeftId : newRightId;
         }
       } else {
-        if (state.activeTabId === closingId) {
-          if (newTabs.length === 0) {
-            newActiveId = null;
-          } else {
-            const nextIdx = Math.min(idx, newTabs.length - 1);
-            newActiveId = newTabs[nextIdx].id;
-          }
-        }
+        if (state.activeTabId === closingId) {}
       }
 
killedBy: fileViewerStore - closeTab sets activeTabId to null when closing the last tab
statusReason: expected 'ctx1:src/main.ts' to be null

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:298:15
         }
       } else {
         if (state.activeTabId === closingId) {
-          if (newTabs.length === 0) {
+          if (true) {
             newActiveId = null;
           } else {
killedBy: fileViewerStore - closeTab activates next tab when closing active tab
statusReason: expected null to be 'ctx1:c.ts' // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:298:15
         }
       } else {
         if (state.activeTabId === closingId) {
-          if (newTabs.length === 0) {
+          if (newTabs.length !== 0) {
             newActiveId = null;
           } else {
killedBy: fileViewerStore - closeTab removes the tab
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/stores/fileViewerStore.ts:300:18
         if (state.activeTabId === closingId) {
           if (newTabs.length === 0) {
             newActiveId = null;
-          } else {
-            const nextIdx = Math.min(idx, newTabs.length - 1);
-            newActiveId = newTabs[nextIdx].id;
-          }
+          } else {}
         }
       }
killedBy: fileViewerStore - closeTab activates next tab when closing active tab
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] ArithmeticOperator
src/stores/fileViewerStore.ts:301:43
           if (newTabs.length === 0) {
             newActiveId = null;
           } else {
-            const nextIdx = Math.min(idx, newTabs.length - 1);
+            const nextIdx = Math.min(idx, newTabs.length + 1);
             newActiveId = newTabs[nextIdx].id;
           }
killedBy: fileViewerStore - closeTab split pane updates closing last tab in single-pane selects by Math.min(idx, length-1)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] MethodExpression
src/stores/fileViewerStore.ts:301:29
           if (newTabs.length === 0) {
             newActiveId = null;
           } else {
-            const nextIdx = Math.min(idx, newTabs.length - 1);
+            const nextIdx = Math.max(idx, newTabs.length - 1);
             newActiveId = newTabs[nextIdx].id;
           }
killedBy: fileViewerStore - closeTab split pane updates closing last tab in single-pane selects by Math.min(idx, length-1)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/stores/fileViewerStore.ts:317:28
     });
   },
 
-  setActiveTab: (tabId) => {
-    const state = get();
-    if (state.splitActive) {
-      const updates: Partial<FileViewerStore> = { activeTabId: tabId };
-      if (state.focusedPane === "left") {
-        updates.leftActiveTabId = tabId;
-      } else {
-        updates.rightActiveTabId = tabId;
-      }
-      set(updates);
-    } else {
-      set({ activeTabId: tabId });
-    }
-  },
+  setActiveTab: (tabId) => {},
 
   showChat: () => {
killedBy: fileViewerStore - closeAllTabs / showChat / setActiveTab setActiveTab changes active tab
statusReason: expected 'ctx1:a.ts' to be 'ctx1:b.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:319:9
 
   setActiveTab: (tabId) => {
     const state = get();
-    if (state.splitActive) {
+    if (false) {
       const updates: Partial<FileViewerStore> = { activeTabId: tabId };
       if (state.focusedPane === "left") {
killedBy: fileViewerStore - split editor setActiveTab in split mode routes to focused pane
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:319:28
 
   setActiveTab: (tabId) => {
     const state = get();
-    if (state.splitActive) {
-      const updates: Partial<FileViewerStore> = { activeTabId: tabId };
-      if (state.focusedPane === "left") {
-        updates.leftActiveTabId = tabId;
-      } else {
-        updates.rightActiveTabId = tabId;
-      }
-      set(updates);
-    } else {
+    if (state.splitActive) {} else {
       set({ activeTabId: tabId });
     }
killedBy: fileViewerStore - split editor setActiveTab in split mode routes to focused pane
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:320:49
   setActiveTab: (tabId) => {
     const state = get();
     if (state.splitActive) {
-      const updates: Partial<FileViewerStore> = { activeTabId: tabId };
+      const updates: Partial<FileViewerStore> = {};
       if (state.focusedPane === "left") {
         updates.leftActiveTabId = tabId;
killedBy: fileViewerStore - split editor setActiveTab in split mode routes to focused pane
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:321:41
     const state = get();
     if (state.splitActive) {
       const updates: Partial<FileViewerStore> = { activeTabId: tabId };
-      if (state.focusedPane === "left") {
-        updates.leftActiveTabId = tabId;
-      } else {
+      if (state.focusedPane === "left") {} else {
         updates.rightActiveTabId = tabId;
       }
killedBy: fileViewerStore - split editor setActiveTab in split mode routes to left pane when focused
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:321:11
     const state = get();
     if (state.splitActive) {
       const updates: Partial<FileViewerStore> = { activeTabId: tabId };
-      if (state.focusedPane === "left") {
+      if (state.focusedPane !== "left") {
         updates.leftActiveTabId = tabId;
       } else {
killedBy: fileViewerStore - split editor setActiveTab in split mode routes to focused pane
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:323:14
       const updates: Partial<FileViewerStore> = { activeTabId: tabId };
       if (state.focusedPane === "left") {
         updates.leftActiveTabId = tabId;
-      } else {
-        updates.rightActiveTabId = tabId;
-      }
+      } else {}
       set(updates);
     } else {
killedBy: fileViewerStore - split editor setActiveTab in split mode routes to focused pane
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:327:12
         updates.rightActiveTabId = tabId;
       }
       set(updates);
-    } else {
-      set({ activeTabId: tabId });
-    }
+    } else {}
   },
 
killedBy: fileViewerStore - closeAllTabs / showChat / setActiveTab setActiveTab changes active tab
statusReason: expected 'ctx1:a.ts' to be 'ctx1:b.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:335:28
   showChat: () => {
     const state = get();
     // Stryker disable next-line ConditionalExpression: non-split path produces same result as split path with null panes
-    if (state.splitActive) {
-      if (state.focusedPane === "left") {
-        const newLeftId = null;
-        // If both panes would be null, close split
-        if (state.rightActiveTabId === null) {
-          set({ activeTabId: null, splitActive: false, leftActiveTabId: null, rightActiveTabId: null });
-        } else {
-          set({ activeTabId: null, leftActiveTabId: newLeftId });
-        }
-      } else {
-        // Close the right pane → exit split, keep left
-        set({
-          splitActive: false,
-          activeTabId: state.leftActiveTabId,
-          leftActiveTabId: null,
-          rightActiveTabId: null,
-          // Stryker disable next-line StringLiteral: "left" reset verified in showChat tests
-          focusedPane: "left",
-        });
-      }
-    } else {
+    if (state.splitActive) {} else {
       set({ activeTabId: null });
     }
killedBy: fileViewerStore - split editor showChat in split mode with focused right pane closes split
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:339:13
       if (state.focusedPane === "left") {
         const newLeftId = null;
         // If both panes would be null, close split
-        if (state.rightActiveTabId === null) {
+        if (false) {
           set({ activeTabId: null, splitActive: false, leftActiveTabId: null, rightActiveTabId: null });
         } else {
killedBy: fileViewerStore - split editor showChat in split mode with left focused and right null closes split
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:339:13
       if (state.focusedPane === "left") {
         const newLeftId = null;
         // If both panes would be null, close split
-        if (state.rightActiveTabId === null) {
+        if (state.rightActiveTabId !== null) {
           set({ activeTabId: null, splitActive: false, leftActiveTabId: null, rightActiveTabId: null });
         } else {
killedBy: fileViewerStore - split editor showChat in split mode with focused left pane clears left tab
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:340:49
         const newLeftId = null;
         // If both panes would be null, close split
         if (state.rightActiveTabId === null) {
-          set({ activeTabId: null, splitActive: false, leftActiveTabId: null, rightActiveTabId: null });
+          set({ activeTabId: null, splitActive: true, leftActiveTabId: null, rightActiveTabId: null });
         } else {
           set({ activeTabId: null, leftActiveTabId: newLeftId });
killedBy: fileViewerStore - split editor showChat in split mode with left focused and right null closes split
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:341:16
         // If both panes would be null, close split
         if (state.rightActiveTabId === null) {
           set({ activeTabId: null, splitActive: false, leftActiveTabId: null, rightActiveTabId: null });
-        } else {
-          set({ activeTabId: null, leftActiveTabId: newLeftId });
-        }
+        } else {}
       } else {
         // Close the right pane → exit split, keep left
killedBy: fileViewerStore - split editor showChat in split mode with focused left pane clears left tab
statusReason: expected 'ctx1:a.ts' to be null

[Killed] BlockStatement
src/stores/fileViewerStore.ts:344:14
         } else {
           set({ activeTabId: null, leftActiveTabId: newLeftId });
         }
-      } else {
-        // Close the right pane → exit split, keep left
-        set({
-          splitActive: false,
-          activeTabId: state.leftActiveTabId,
-          leftActiveTabId: null,
-          rightActiveTabId: null,
-          // Stryker disable next-line StringLiteral: "left" reset verified in showChat tests
-          focusedPane: "left",
-        });
-      }
+      } else {}
     } else {
       set({ activeTabId: null });
killedBy: fileViewerStore - split editor showChat in split mode with focused right pane closes split
statusReason: expected true to be false // Object.is equality
