[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:347:24
       } else {
         // Close the right pane → exit split, keep left
         set({
-          splitActive: false,
+          splitActive: true,
           activeTabId: state.leftActiveTabId,
           leftActiveTabId: null,
killedBy: fileViewerStore - split editor showChat in split mode with focused right pane closes split
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:355:12
           focusedPane: "left",
         });
       }
-    } else {
-      set({ activeTabId: null });
-    }
+    } else {}
   },
 
killedBy: fileViewerStore - closeAllTabs / showChat / setActiveTab showChat sets activeTabId to null
statusReason: expected 'ctx1:src/main.ts' to be null

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:360:17
     }
   },
 
-  closeAllTabs: () => set({
-    tabs: [],
-    activeTabId: null,
-    splitActive: false,
-    leftActiveTabId: null,
-    rightActiveTabId: null,
-    focusedPane: "left",
-  }),
+  closeAllTabs: () => undefined,
 
   updateContent: (tabId, newContent) => {
killedBy: fileViewerStore - closeAllTabs / showChat / setActiveTab closeAllTabs removes all tabs
statusReason: expected [ { id: 'ctx1:src/main.ts', …(11) } ] to deeply equal []

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:363:18
   closeAllTabs: () => set({
     tabs: [],
     activeTabId: null,
-    splitActive: false,
+    splitActive: true,
     leftActiveTabId: null,
     rightActiveTabId: null,
killedBy: fileViewerStore - split editor closeAllTabs also closes split
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:366:18
     splitActive: false,
     leftActiveTabId: null,
     rightActiveTabId: null,
-    focusedPane: "left",
+    focusedPane: "",
   }),
 
killedBy: fileViewerStore - showChat and closeAllTabs reset focusedPane closeAllTabs resets focusedPane to 'left'
statusReason: expected '' to be 'left' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:369:41
     focusedPane: "left",
   }),
 
-  updateContent: (tabId, newContent) => {
-    set((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === tabId
-          ? {
-              ...t,
-              editedContent: newContent,
-              dirty: newContent !== t.content,
-              pinned: true,
-            }
-          : t,
-      ),
-    }));
-  },
+  updateContent: (tabId, newContent) => {},
 
   saveActiveFile: async (formatOnSave = true) => {
killedBy: fileViewerStore - updateContent sets editedContent and dirty=true
statusReason: expected null to be 'modified' // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:370:9
   }),
 
   updateContent: (tabId, newContent) => {
-    set((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === tabId
-          ? {
-              ...t,
-              editedContent: newContent,
-              dirty: newContent !== t.content,
-              pinned: true,
-            }
-          : t,
-      ),
-    }));
+    set(() => undefined);
   },
 
killedBy: fileViewerStore - updateContent sets editedContent and dirty=true
statusReason: Cannot read properties of undefined (reading 'tabs')

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:371:28
 
   updateContent: (tabId, newContent) => {
     set((state) => ({
-      tabs: state.tabs.map((t) =>
-        t.id === tabId
-          ? {
-              ...t,
-              editedContent: newContent,
-              dirty: newContent !== t.content,
-              pinned: true,
-            }
-          : t,
+      tabs: state.tabs.map(() => undefined,
       ),
     }));
killedBy: fileViewerStore - updateContent sets editedContent and dirty=true
statusReason: Cannot read properties of undefined (reading 'editedContent')

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:372:9
   updateContent: (tabId, newContent) => {
     set((state) => ({
       tabs: state.tabs.map((t) =>
-        t.id === tabId
+        true
           ? {
               ...t,
killedBy: fileViewerStore - updateContent leaves non-matching tabs unchanged during update
statusReason: expected 'modified' to be null

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:372:9
   updateContent: (tabId, newContent) => {
     set((state) => ({
       tabs: state.tabs.map((t) =>
-        t.id === tabId
+        t.id !== tabId
           ? {
               ...t,
killedBy: fileViewerStore - updateContent sets editedContent and dirty=true
statusReason: expected null to be 'modified' // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:376:22
           ? {
               ...t,
               editedContent: newContent,
-              dirty: newContent !== t.content,
+              dirty: newContent === t.content,
               pinned: true,
             }
killedBy: fileViewerStore - updateContent sets editedContent and dirty=true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:376:22
           ? {
               ...t,
               editedContent: newContent,
-              dirty: newContent !== t.content,
+              dirty: true,
               pinned: true,
             }
killedBy: fileViewerStore - updateContent sets dirty=false when content matches original
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:377:23
               ...t,
               editedContent: newContent,
               dirty: newContent !== t.content,
-              pinned: true,
+              pinned: false,
             }
           : t,
killedBy: fileViewerStore - updateContent auto-pins the tab on edit
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:384:41
     }));
   },
 
-  saveActiveFile: async (formatOnSave = true) => {
+  saveActiveFile: async (formatOnSave = false) => {
     const state = get();
     // Stryker disable next-line ConditionalExpression: find by activeTabId tested — saves only active tab
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'app.ts', 'edited', true ]

Received: 

  1st vi.fn() call:

  [
    "ws1",

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:387:40
   saveActiveFile: async (formatOnSave = true) => {
     const state = get();
     // Stryker disable next-line ConditionalExpression: find by activeTabId tested — saves only active tab
-    const tab = state.tabs.find((t) => t.id === state.activeTabId);
+    const tab = state.tabs.find((t) => t.id !== state.activeTabId);
     if (!tab || !tab.dirty || tab.saving) return;
 
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'app.ts', 'edited', true ]

Number of calls: 0

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:387:33
   saveActiveFile: async (formatOnSave = true) => {
     const state = get();
     // Stryker disable next-line ConditionalExpression: find by activeTabId tested — saves only active tab
-    const tab = state.tabs.find((t) => t.id === state.activeTabId);
+    const tab = state.tabs.find(() => undefined);
     if (!tab || !tab.dirty || tab.saving) return;
 
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'app.ts', 'edited', true ]

Number of calls: 0

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:388:17
     const state = get();
     // Stryker disable next-line ConditionalExpression: find by activeTabId tested — saves only active tab
     const tab = state.tabs.find((t) => t.id === state.activeTabId);
-    if (!tab || !tab.dirty || tab.saving) return;
+    if (!tab || tab.dirty || tab.saving) return;
 
     const contentToSave = tab.editedContent ?? tab.content;
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'app.ts', 'edited', true ]

Number of calls: 0

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:388:9
     const state = get();
     // Stryker disable next-line ConditionalExpression: find by activeTabId tested — saves only active tab
     const tab = state.tabs.find((t) => t.id === state.activeTabId);
-    if (!tab || !tab.dirty || tab.saving) return;
+    if (tab || !tab.dirty || tab.saving) return;
 
     const contentToSave = tab.editedContent ?? tab.content;
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'app.ts', 'edited', true ]

Number of calls: 0

[Killed] LogicalOperator
src/stores/fileViewerStore.ts:390:27
     const tab = state.tabs.find((t) => t.id === state.activeTabId);
     if (!tab || !tab.dirty || tab.saving) return;
 
-    const contentToSave = tab.editedContent ?? tab.content;
+    const contentToSave = tab.editedContent && tab.content;
     if (contentToSave === null) return;
 
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'app.ts', 'edited', true ]

Received: 

  1st vi.fn() call:

  [
    "ws1",

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:391:9
     if (!tab || !tab.dirty || tab.saving) return;
 
     const contentToSave = tab.editedContent ?? tab.content;
-    if (contentToSave === null) return;
+    if (true) return;
 
     // Mark as saving
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'app.ts', 'edited', true ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:391:9
     if (!tab || !tab.dirty || tab.saving) return;
 
     const contentToSave = tab.editedContent ?? tab.content;
-    if (contentToSave === null) return;
+    if (false) return;
 
     // Mark as saving
killedBy: fileViewerStore - saveActiveFile is a no-op when content is null and editedContent is null
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "ctx1",

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:394:9
     if (contentToSave === null) return;
 
     // Mark as saving
-    set((s) => ({
-      tabs: s.tabs.map((t) =>
-        t.id === tab.id ? { ...t, saving: true } : t,
-      ),
-    }));
+    set(() => undefined);
 
     try {
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: Cannot read properties of undefined (reading 'tabs')

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:395:24
 
     // Mark as saving
     set((s) => ({
-      tabs: s.tabs.map((t) =>
-        t.id === tab.id ? { ...t, saving: true } : t,
+      tabs: s.tabs.map(() => undefined,
       ),
     }));
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:396:9
     // Mark as saving
     set((s) => ({
       tabs: s.tabs.map((t) =>
-        t.id === tab.id ? { ...t, saving: true } : t,
+        true ? { ...t, saving: true } : t,
       ),
     }));
killedBy: fileViewerStore - saveActiveFile conditional branches save matches tab by id (non-matching tabs untouched during save state)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:396:43
     // Mark as saving
     set((s) => ({
       tabs: s.tabs.map((t) =>
-        t.id === tab.id ? { ...t, saving: true } : t,
+        t.id === tab.id ? { ...t, saving: false } : t,
       ),
     }));
killedBy: fileViewerStore - saveActiveFile conditional branches save updates saving state during write
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:402:9
 
     try {
       const result =
-        tab.contextType === "workspace"
+        true
           ? await writeWorkspaceFile(
               tab.contextId,
killedBy: fileViewerStore - saveActiveFile calls writeRepoFile for repo context type
statusReason: expected "vi.fn()" to be called with arguments: [ 'repo1', 'main.rs', 'edited', true ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:402:9
 
     try {
       const result =
-        tab.contextType === "workspace"
+        false
           ? await writeWorkspaceFile(
               tab.contextId,
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws1', 'app.ts', 'edited', true ]

Number of calls: 0

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:416:11
               formatOnSave,
             );
 
-      set((s) => ({
-        tabs: s.tabs.map((t) =>
-          t.id === tab.id
-            ? {
-                ...t,
-                content: result.content,
-                editedContent: result.content,
-                dirty: false,
-                saving: false,
-                error: null,
-              }
-            : t,
-        ),
-      }));
+      set(() => undefined);
     } catch (e) {
       set((s) => ({
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: Cannot read properties of undefined (reading 'tabs')

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:417:26
             );
 
       set((s) => ({
-        tabs: s.tabs.map((t) =>
-          t.id === tab.id
-            ? {
-                ...t,
-                content: result.content,
-                editedContent: result.content,
-                dirty: false,
-                saving: false,
-                error: null,
-              }
-            : t,
+        tabs: s.tabs.map(() => undefined,
         ),
       }));
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: Cannot read properties of undefined (reading 'dirty')

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:418:11
 
       set((s) => ({
         tabs: s.tabs.map((t) =>
-          t.id === tab.id
+          t.id !== tab.id
             ? {
                 ...t,
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:418:11
 
       set((s) => ({
         tabs: s.tabs.map((t) =>
-          t.id === tab.id
+          true
             ? {
                 ...t,
killedBy: fileViewerStore - saveActiveFile saves active file with multiple tabs (non-matching tabs untouched)
statusReason: expected 'saved' to be 'other' // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:423:24
                 ...t,
                 content: result.content,
                 editedContent: result.content,
-                dirty: false,
+                dirty: true,
                 saving: false,
                 error: null,
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:424:25
                 content: result.content,
                 editedContent: result.content,
                 dirty: false,
-                saving: false,
+                saving: true,
                 error: null,
               }
killedBy: fileViewerStore - saveActiveFile calls writeWorkspaceFile and clears dirty
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:430:17
             : t,
         ),
       }));
-    } catch (e) {
-      set((s) => ({
-        tabs: s.tabs.map((t) =>
-          t.id === tab.id
-            ? { ...t, saving: false, error: `Save failed: ${String(e)}` }
-            : t,
-        ),
-      }));
-    }
+    } catch (e) {}
   },
 
killedBy: fileViewerStore - saveActiveFile sets error on save failure
statusReason: expected null to be 'Save failed: Error: Permission denied' // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:431:11
         ),
       }));
     } catch (e) {
-      set((s) => ({
-        tabs: s.tabs.map((t) =>
-          t.id === tab.id
-            ? { ...t, saving: false, error: `Save failed: ${String(e)}` }
-            : t,
-        ),
-      }));
+      set(() => undefined);
     }
   },
killedBy: fileViewerStore - saveActiveFile sets error on save failure
statusReason: Cannot read properties of undefined (reading 'tabs')

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:431:19
         ),
       }));
     } catch (e) {
-      set((s) => ({
-        tabs: s.tabs.map((t) =>
-          t.id === tab.id
-            ? { ...t, saving: false, error: `Save failed: ${String(e)}` }
-            : t,
-        ),
-      }));
+      set((s) => ({}));
     }
   },
killedBy: fileViewerStore - saveActiveFile sets error on save failure
statusReason: expected null to be 'Save failed: Error: Permission denied' // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:432:26
       }));
     } catch (e) {
       set((s) => ({
-        tabs: s.tabs.map((t) =>
-          t.id === tab.id
-            ? { ...t, saving: false, error: `Save failed: ${String(e)}` }
-            : t,
+        tabs: s.tabs.map(() => undefined,
         ),
       }));
killedBy: fileViewerStore - saveActiveFile sets error on save failure
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:433:11
     } catch (e) {
       set((s) => ({
         tabs: s.tabs.map((t) =>
-          t.id === tab.id
+          false
             ? { ...t, saving: false, error: `Save failed: ${String(e)}` }
             : t,
killedBy: fileViewerStore - saveActiveFile sets error on save failure
statusReason: expected null to be 'Save failed: Error: Permission denied' // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:434:31
       set((s) => ({
         tabs: s.tabs.map((t) =>
           t.id === tab.id
-            ? { ...t, saving: false, error: `Save failed: ${String(e)}` }
+            ? { ...t, saving: true, error: `Save failed: ${String(e)}` }
             : t,
         ),
killedBy: fileViewerStore - saveActiveFile sets error on save failure
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:441:18
     }
   },
 
-  setRevealLine: (tabId, line) => set({ revealLine: { tabId, line } }),
+  setRevealLine: () => undefined,
   clearRevealLine: () => set({ revealLine: null }),
 
killedBy: fileViewerStore - split editor setRevealLine and clearRevealLine
statusReason: expected null to deeply equal { tabId: 'tab-1', line: 42 }

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:441:53
     }
   },
 
-  setRevealLine: (tabId, line) => set({ revealLine: { tabId, line } }),
+  setRevealLine: (tabId, line) => set({ revealLine: {} }),
   clearRevealLine: () => set({ revealLine: null }),
 
killedBy: fileViewerStore - split editor setRevealLine and clearRevealLine
statusReason: expected {} to deeply equal { tabId: 'tab-1', line: 42 }

[Killed] ArrowFunction
src/stores/fileViewerStore.ts:442:20
   },
 
   setRevealLine: (tabId, line) => set({ revealLine: { tabId, line } }),
-  clearRevealLine: () => set({ revealLine: null }),
+  clearRevealLine: () => undefined,
 
   // --- Split editor actions ---
killedBy: fileViewerStore - split editor setRevealLine and clearRevealLine
statusReason: expected { tabId: 'tab-1', line: 42 } to be null

[Killed] BlockStatement
src/stores/fileViewerStore.ts:446:36
 
   // --- Split editor actions ---
 
-  splitEditor: (tabId?: string) => {
-    const state = get();
-    if (state.splitActive) return;
-
-    const leftTab = state.activeTabId;
-    const rightTab = tabId ?? null;
-
-    set({
-      splitActive: true,
-      leftActiveTabId: leftTab,
-      rightActiveTabId: rightTab,
-      focusedPane: rightTab ? "right" : "right",
-      activeTabId: rightTab ?? leftTab,
-    });
-  },
+  splitEditor: (tabId?: string) => {},
 
   closeSplit: () => {
killedBy: fileViewerStore - split editor splitEditor activates split mode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:448:9
 
   splitEditor: (tabId?: string) => {
     const state = get();
-    if (state.splitActive) return;
+    if (true) return;
 
     const leftTab = state.activeTabId;
killedBy: fileViewerStore - split editor splitEditor activates split mode
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:448:9
 
   splitEditor: (tabId?: string) => {
     const state = get();
-    if (state.splitActive) return;
+    if (false) return;
 
     const leftTab = state.activeTabId;
killedBy: fileViewerStore - split editor splitEditor is a no-op when already split
statusReason: expected 'right' to be 'left' // Object.is equality

[Killed] LogicalOperator
src/stores/fileViewerStore.ts:451:22
     if (state.splitActive) return;
 
     const leftTab = state.activeTabId;
-    const rightTab = tabId ?? null;
+    const rightTab = tabId && null;
 
     set({
killedBy: fileViewerStore - split editor splitEditor activates split mode
statusReason: expected null to be 'ctx1:b.ts' // Object.is equality

[Killed] BooleanLiteral
src/stores/fileViewerStore.ts:454:20
     const rightTab = tabId ?? null;
 
     set({
-      splitActive: true,
+      splitActive: false,
       leftActiveTabId: leftTab,
       rightActiveTabId: rightTab,
killedBy: fileViewerStore - split editor splitEditor activates split mode
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/stores/fileViewerStore.ts:457:31
       splitActive: true,
       leftActiveTabId: leftTab,
       rightActiveTabId: rightTab,
-      focusedPane: rightTab ? "right" : "right",
+      focusedPane: rightTab ? "" : "right",
       activeTabId: rightTab ?? leftTab,
     });
killedBy: fileViewerStore - split editor splitEditor activates split mode
statusReason: expected '' to be 'right' // Object.is equality

[Killed] LogicalOperator
src/stores/fileViewerStore.ts:458:20
       leftActiveTabId: leftTab,
       rightActiveTabId: rightTab,
       focusedPane: rightTab ? "right" : "right",
-      activeTabId: rightTab ?? leftTab,
+      activeTabId: rightTab && leftTab,
     });
   },
killedBy: fileViewerStore - splitEditor without tabId splitEditor with no tabId sets rightActiveTabId to null and activeTabId to leftTab
statusReason: expected null to be 'ctx1:only.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:462:21
     });
   },
 
-  closeSplit: () => {
-    const state = get();
-    const keepTabId =
-      state.focusedPane === "left"
-        ? state.leftActiveTabId
-        : state.rightActiveTabId;
-
-    set({
-      splitActive: false,
-      activeTabId: keepTabId ?? state.leftActiveTabId,
-      leftActiveTabId: null,
-      rightActiveTabId: null,
-      focusedPane: "left",
-    });
-  },
+  closeSplit: () => {},
 
   setFocusedPane: (pane) => {
killedBy: fileViewerStore - split editor closeSplit exits split mode and keeps focused pane tab
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:465:7
   closeSplit: () => {
     const state = get();
     const keepTabId =
-      state.focusedPane === "left"
+      true
         ? state.leftActiveTabId
         : state.rightActiveTabId;
killedBy: fileViewerStore - split editor closeSplit exits split mode and keeps focused pane tab
statusReason: expected 'ctx1:a.ts' to be 'ctx1:b.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:465:7
   closeSplit: () => {
     const state = get();
     const keepTabId =
-      state.focusedPane === "left"
+      false
         ? state.leftActiveTabId
         : state.rightActiveTabId;
killedBy: fileViewerStore - split editor closeSplit keeps left pane tab when focused left
statusReason: expected 'ctx1:b.ts' to be 'ctx1:a.ts' // Object.is equality

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:469:9
         ? state.leftActiveTabId
         : state.rightActiveTabId;
 
-    set({
-      splitActive: false,
-      activeTabId: keepTabId ?? state.leftActiveTabId,
-      leftActiveTabId: null,
-      rightActiveTabId: null,
-      focusedPane: "left",
-    });
+    set({});
   },
 
killedBy: fileViewerStore - split editor closeSplit exits split mode and keeps focused pane tab
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/stores/fileViewerStore.ts:471:20
 
     set({
       splitActive: false,
-      activeTabId: keepTabId ?? state.leftActiveTabId,
+      activeTabId: keepTabId && state.leftActiveTabId,
       leftActiveTabId: null,
       rightActiveTabId: null,
killedBy: fileViewerStore - split editor closeSplit exits split mode and keeps focused pane tab
statusReason: expected 'ctx1:a.ts' to be 'ctx1:b.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:478:29
     });
   },
 
-  setFocusedPane: (pane) => {
-    const state = get();
-    const tabId = pane === "left" ? state.leftActiveTabId : state.rightActiveTabId;
-    set({ focusedPane: pane, activeTabId: tabId });
-  },
+  setFocusedPane: (pane) => {},
 
   setActiveTabInPane: (pane, tabId) => {
killedBy: fileViewerStore - split editor setFocusedPane updates focusedPane and activeTabId
statusReason: expected 'right' to be 'left' // Object.is equality

[Killed] EqualityOperator
src/stores/fileViewerStore.ts:480:19
 
   setFocusedPane: (pane) => {
     const state = get();
-    const tabId = pane === "left" ? state.leftActiveTabId : state.rightActiveTabId;
+    const tabId = pane !== "left" ? state.leftActiveTabId : state.rightActiveTabId;
     set({ focusedPane: pane, activeTabId: tabId });
   },
killedBy: fileViewerStore - split editor setFocusedPane updates focusedPane and activeTabId
statusReason: expected 'ctx1:b.ts' to be 'ctx1:a.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:480:19
 
   setFocusedPane: (pane) => {
     const state = get();
-    const tabId = pane === "left" ? state.leftActiveTabId : state.rightActiveTabId;
+    const tabId = true ? state.leftActiveTabId : state.rightActiveTabId;
     set({ focusedPane: pane, activeTabId: tabId });
   },
killedBy: fileViewerStore - split editor setFocusedPane to right updates activeTabId to right pane tab
statusReason: expected 'ctx1:a.ts' to be 'ctx1:b.ts' // Object.is equality

[Killed] ObjectLiteral
src/stores/fileViewerStore.ts:481:9
   setFocusedPane: (pane) => {
     const state = get();
     const tabId = pane === "left" ? state.leftActiveTabId : state.rightActiveTabId;
-    set({ focusedPane: pane, activeTabId: tabId });
+    set({});
   },
 
killedBy: fileViewerStore - split editor setFocusedPane updates focusedPane and activeTabId
statusReason: expected 'right' to be 'left' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:484:40
     set({ focusedPane: pane, activeTabId: tabId });
   },
 
-  setActiveTabInPane: (pane, tabId) => {
-    const state = get();
-    const updates: Partial<FileViewerStore> = {};
-    if (pane === "left") {
-      updates.leftActiveTabId = tabId;
-    } else {
-      updates.rightActiveTabId = tabId;
-    }
-    if (state.focusedPane === pane) {
-      updates.activeTabId = tabId;
-    }
-    set(updates);
-  },
+  setActiveTabInPane: (pane, tabId) => {},
 }));
 
killedBy: fileViewerStore - split editor setActiveTabInPane updates the correct pane
statusReason: expected 'ctx1:b.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:487:9
   setActiveTabInPane: (pane, tabId) => {
     const state = get();
     const updates: Partial<FileViewerStore> = {};
-    if (pane === "left") {
+    if (false) {
       updates.leftActiveTabId = tabId;
     } else {
killedBy: fileViewerStore - split editor setActiveTabInPane updates activeTabId when pane is focused
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] BlockStatement
src/stores/fileViewerStore.ts:487:26
   setActiveTabInPane: (pane, tabId) => {
     const state = get();
     const updates: Partial<FileViewerStore> = {};
-    if (pane === "left") {
-      updates.leftActiveTabId = tabId;
-    } else {
+    if (pane === "left") {} else {
       updates.rightActiveTabId = tabId;
     }
killedBy: fileViewerStore - split editor setActiveTabInPane updates activeTabId when pane is focused
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality

[Killed] ConditionalExpression
src/stores/fileViewerStore.ts:492:9
     } else {
       updates.rightActiveTabId = tabId;
     }
-    if (state.focusedPane === pane) {
+    if (true) {
       updates.activeTabId = tabId;
     }
killedBy: fileViewerStore - split editor setActiveTabInPane updates the correct pane
statusReason: expected 'ctx1:c.ts' to be 'ctx1:a.ts' // Object.is equality
