[Killed] BlockStatement
src/stores/fileViewerStore.ts:492:37
     } else {
       updates.rightActiveTabId = tabId;
     }
-    if (state.focusedPane === pane) {
-      updates.activeTabId = tabId;
-    }
+    if (state.focusedPane === pane) {}
     set(updates);
   },
killedBy: fileViewerStore - split editor setActiveTabInPane updates activeTabId when pane is focused
statusReason: expected 'ctx1:a.ts' to be 'ctx1:c.ts' // Object.is equality
