[Killed] BlockStatement
src/stores/notificationStore.ts:53:27
   panelOpen: false,
 // Stryker restore all
 
-  addNotification: (n) => {
-    const notification: Notification = {
-      ...n,
-      id: String(++nextId),
-      timestamp: Date.now(),
-      read: false,
-    };
-    set((state) => {
-      const updated = [notification, ...state.notifications].slice(0, MAX_NOTIFICATIONS);
-      return {
-        notifications: updated,
-        unreadCount: updated.filter((item) => !item.read).length,
-      };
-    });
-  },
+  addNotification: (n) => {},
 
   markRead: (id) => {
killedBy: notificationStore addNotification adds a notification with generated id, timestamp, and read=false
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/stores/notificationStore.ts:54:40
 // Stryker restore all
 
   addNotification: (n) => {
-    const notification: Notification = {
-      ...n,
-      id: String(++nextId),
-      timestamp: Date.now(),
-      read: false,
-    };
+    const notification: Notification = {};
     set((state) => {
       const updated = [notification, ...state.notifications].slice(0, MAX_NOTIFICATIONS);
killedBy: notificationStore addNotification adds a notification with generated id, timestamp, and read=false
statusReason: expected undefined to be 'Agent completed' // Object.is equality

[Killed] UpdateOperator
src/stores/notificationStore.ts:56:18
   addNotification: (n) => {
     const notification: Notification = {
       ...n,
-      id: String(++nextId),
+      id: String(--nextId),
       timestamp: Date.now(),
       read: false,
killedBy: notificationStore notification IDs are unique and incrementing generates incrementing IDs (second > first numerically)
statusReason: expected -231 to be greater than -230

[Killed] BooleanLiteral
src/stores/notificationStore.ts:58:13
       ...n,
       id: String(++nextId),
       timestamp: Date.now(),
-      read: false,
+      read: true,
     };
     set((state) => {
killedBy: notificationStore addNotification adds a notification with generated id, timestamp, and read=false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/notificationStore.ts:60:20
       timestamp: Date.now(),
       read: false,
     };
-    set((state) => {
-      const updated = [notification, ...state.notifications].slice(0, MAX_NOTIFICATIONS);
-      return {
-        notifications: updated,
-        unreadCount: updated.filter((item) => !item.read).length,
-      };
-    });
+    set((state) => {});
   },
 
killedBy: notificationStore addNotification adds a notification with generated id, timestamp, and read=false
statusReason: Cannot read properties of undefined (reading 'notifications')

[Killed] MethodExpression
src/stores/notificationStore.ts:61:23
       read: false,
     };
     set((state) => {
-      const updated = [notification, ...state.notifications].slice(0, MAX_NOTIFICATIONS);
+      const updated = [notification, ...state.notifications];
       return {
         notifications: updated,
killedBy: notificationStore addNotification caps at 200 notifications
statusReason: expected [ …(210) ] to have a length of 200 but got 210

[Killed] ObjectLiteral
src/stores/notificationStore.ts:62:14
     };
     set((state) => {
       const updated = [notification, ...state.notifications].slice(0, MAX_NOTIFICATIONS);
-      return {
-        notifications: updated,
-        unreadCount: updated.filter((item) => !item.read).length,
-      };
+      return {};
     });
   },
killedBy: notificationStore addNotification adds a notification with generated id, timestamp, and read=false
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/stores/notificationStore.ts:64:37
       const updated = [notification, ...state.notifications].slice(0, MAX_NOTIFICATIONS);
       return {
         notifications: updated,
-        unreadCount: updated.filter((item) => !item.read).length,
+        unreadCount: updated.filter(() => undefined).length,
       };
     });
killedBy: notificationStore addNotification updates unreadCount on add
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/stores/notificationStore.ts:64:22
       const updated = [notification, ...state.notifications].slice(0, MAX_NOTIFICATIONS);
       return {
         notifications: updated,
-        unreadCount: updated.filter((item) => !item.read).length,
+        unreadCount: updated.length,
       };
     });
killedBy: notificationStore unreadCount calculated from unread notifications addNotification after markRead calculates unreadCount from unread only
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/stores/notificationStore.ts:69:21
     });
   },
 
-  markRead: (id) => {
-    set((state) => {
-      const notifications = state.notifications.map((n) =>
-        n.id === id ? { ...n, read: true } : n,
-      );
-      return {
-        notifications,
-        unreadCount: notifications.filter((n) => !n.read).length,
-      };
-    });
-  },
+  markRead: (id) => {},
 
   markAllRead: () => {
killedBy: notificationStore markRead marks a specific notification as read
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/notificationStore.ts:70:20
   },
 
   markRead: (id) => {
-    set((state) => {
-      const notifications = state.notifications.map((n) =>
-        n.id === id ? { ...n, read: true } : n,
-      );
-      return {
-        notifications,
-        unreadCount: notifications.filter((n) => !n.read).length,
-      };
-    });
+    set((state) => {});
   },
 
killedBy: notificationStore markRead marks a specific notification as read
statusReason: Cannot read properties of undefined (reading 'notifications')

[Killed] ArrowFunction
src/stores/notificationStore.ts:71:53
 
   markRead: (id) => {
     set((state) => {
-      const notifications = state.notifications.map((n) =>
-        n.id === id ? { ...n, read: true } : n,
+      const notifications = state.notifications.map(() => undefined,
       );
       return {
killedBy: notificationStore markRead marks a specific notification as read
statusReason: Cannot read properties of undefined (reading 'read')

[Killed] EqualityOperator
src/stores/notificationStore.ts:72:9
   markRead: (id) => {
     set((state) => {
       const notifications = state.notifications.map((n) =>
-        n.id === id ? { ...n, read: true } : n,
+        n.id !== id ? { ...n, read: true } : n,
       );
       return {
killedBy: notificationStore markRead marks a specific notification as read
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/stores/notificationStore.ts:72:37
   markRead: (id) => {
     set((state) => {
       const notifications = state.notifications.map((n) =>
-        n.id === id ? { ...n, read: true } : n,
+        n.id === id ? { ...n, read: false } : n,
       );
       return {
killedBy: notificationStore markRead marks a specific notification as read
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/stores/notificationStore.ts:76:22
       );
       return {
         notifications,
-        unreadCount: notifications.filter((n) => !n.read).length,
+        unreadCount: notifications.length,
       };
     });
killedBy: notificationStore markRead marks a specific notification as read
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/stores/notificationStore.ts:76:43
       );
       return {
         notifications,
-        unreadCount: notifications.filter((n) => !n.read).length,
+        unreadCount: notifications.filter(() => undefined).length,
       };
     });
killedBy: notificationStore markRead is a no-op for unknown id
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/stores/notificationStore.ts:81:22
     });
   },
 
-  markAllRead: () => {
-    set((state) => ({
-      notifications: state.notifications.map((n) => ({ ...n, read: true })),
-      unreadCount: 0,
-    }));
-  },
+  markAllRead: () => {},
 
   dismiss: (id) => {
killedBy: notificationStore markAllRead marks all notifications as read
statusReason: expected 3 to be +0 // Object.is equality

[Killed] ArrowFunction
src/stores/notificationStore.ts:82:9
   },
 
   markAllRead: () => {
-    set((state) => ({
-      notifications: state.notifications.map((n) => ({ ...n, read: true })),
-      unreadCount: 0,
-    }));
+    set(() => undefined);
   },
 
killedBy: notificationStore markAllRead marks all notifications as read
statusReason: Cannot read properties of undefined (reading 'unreadCount')

[Killed] ArrowFunction
src/stores/notificationStore.ts:83:46
 
   markAllRead: () => {
     set((state) => ({
-      notifications: state.notifications.map((n) => ({ ...n, read: true })),
+      notifications: state.notifications.map(() => undefined),
       unreadCount: 0,
     }));
killedBy: notificationStore markAllRead marks all notifications as read
statusReason: Cannot read properties of undefined (reading 'read')

[Killed] BooleanLiteral
src/stores/notificationStore.ts:83:68
 
   markAllRead: () => {
     set((state) => ({
-      notifications: state.notifications.map((n) => ({ ...n, read: true })),
+      notifications: state.notifications.map((n) => ({ ...n, read: false })),
       unreadCount: 0,
     }));
killedBy: notificationStore markAllRead marks all notifications as read
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/notificationStore.ts:88:20
     }));
   },
 
-  dismiss: (id) => {
-    set((state) => {
-      const notifications = state.notifications.filter((n) => n.id !== id);
-      return {
-        notifications,
-        unreadCount: notifications.filter((n) => !n.read).length,
-      };
-    });
-  },
+  dismiss: (id) => {},
 
   clearAll: () => set({ notifications: [], unreadCount: 0 }),
killedBy: notificationStore dismiss removes a specific notification
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/stores/notificationStore.ts:89:20
   },
 
   dismiss: (id) => {
-    set((state) => {
-      const notifications = state.notifications.filter((n) => n.id !== id);
-      return {
-        notifications,
-        unreadCount: notifications.filter((n) => !n.read).length,
-      };
-    });
+    set((state) => {});
   },
 
killedBy: notificationStore dismiss removes a specific notification
statusReason: Cannot read properties of undefined (reading 'notifications')

[Killed] ConditionalExpression
src/stores/notificationStore.ts:90:63
 
   dismiss: (id) => {
     set((state) => {
-      const notifications = state.notifications.filter((n) => n.id !== id);
+      const notifications = state.notifications.filter((n) => true);
       return {
         notifications,
killedBy: notificationStore dismiss removes a specific notification
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/stores/notificationStore.ts:90:63
 
   dismiss: (id) => {
     set((state) => {
-      const notifications = state.notifications.filter((n) => n.id !== id);
+      const notifications = state.notifications.filter((n) => false);
       return {
         notifications,
killedBy: notificationStore dismiss removes a specific notification
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/stores/notificationStore.ts:91:14
   dismiss: (id) => {
     set((state) => {
       const notifications = state.notifications.filter((n) => n.id !== id);
-      return {
-        notifications,
-        unreadCount: notifications.filter((n) => !n.read).length,
-      };
+      return {};
     });
   },
killedBy: notificationStore dismiss removes a specific notification
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ArrowFunction
src/stores/notificationStore.ts:98:13
     });
   },
 
-  clearAll: () => set({ notifications: [], unreadCount: 0 }),
+  clearAll: () => undefined,
 
   togglePanel: () => set((state) => ({ panelOpen: !state.panelOpen })),
killedBy: notificationStore clearAll removes all notifications
statusReason: expected [ …(2) ] to have a length of +0 but got 2

[Killed] ObjectLiteral
src/stores/notificationStore.ts:98:23
     });
   },
 
-  clearAll: () => set({ notifications: [], unreadCount: 0 }),
+  clearAll: () => set({}),
 
   togglePanel: () => set((state) => ({ panelOpen: !state.panelOpen })),
killedBy: notificationStore clearAll removes all notifications
statusReason: expected [ …(2) ] to have a length of +0 but got 2

[Killed] ArrowFunction
src/stores/notificationStore.ts:100:16
 
   clearAll: () => set({ notifications: [], unreadCount: 0 }),
 
-  togglePanel: () => set((state) => ({ panelOpen: !state.panelOpen })),
+  togglePanel: () => undefined,
 
   closePanel: () => set({ panelOpen: false }),
killedBy: notificationStore togglePanel / closePanel toggles panel open state
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/stores/notificationStore.ts:100:51
 
   clearAll: () => set({ notifications: [], unreadCount: 0 }),
 
-  togglePanel: () => set((state) => ({ panelOpen: !state.panelOpen })),
+  togglePanel: () => set((state) => ({ panelOpen: state.panelOpen })),
 
   closePanel: () => set({ panelOpen: false }),
killedBy: notificationStore togglePanel / closePanel toggles panel open state
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/stores/notificationStore.ts:102:15
 
   togglePanel: () => set((state) => ({ panelOpen: !state.panelOpen })),
 
-  closePanel: () => set({ panelOpen: false }),
+  closePanel: () => undefined,
 }));
 
killedBy: notificationStore togglePanel / closePanel closePanel sets panelOpen to false
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/notificationStore.ts:102:38
 
   togglePanel: () => set((state) => ({ panelOpen: !state.panelOpen })),
 
-  closePanel: () => set({ panelOpen: false }),
+  closePanel: () => set({ panelOpen: true }),
 }));
 
killedBy: notificationStore togglePanel / closePanel closePanel sets panelOpen to false
statusReason: expected true to be false // Object.is equality
