[Killed] BlockStatement
src/stores/workspaceStore.ts:25:49
  * Cross-store cleanup when a workspace is archived or deleted.
  * Unsubscribes event listeners from other stores to prevent memory leaks.
  */
-function _cleanupWorkspace(workspaceId: string) {
-  try { useChatStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] chat cleanup failed for ${workspaceId}:`, e); }
-  try { useAgentStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] agent cleanup failed for ${workspaceId}:`, e); }
-  try { usePrStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] pr cleanup failed for ${workspaceId}:`, e); }
-  cleanupActivityTracking(workspaceId);
-  cleanupNotificationTracking(workspaceId);
-}
+function _cleanupWorkspace(workspaceId: string) {}
 
 interface WorkspaceStore {
killedBy: workspaceStore - _cleanupWorkspace handles store errors archiveWs succeeds even when chatStore.unsubscribe throws
statusReason: expected "warn" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/workspaceStore.ts:26:71
  * Unsubscribes event listeners from other stores to prevent memory leaks.
  */
 function _cleanupWorkspace(workspaceId: string) {
-  try { useChatStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] chat cleanup failed for ${workspaceId}:`, e); }
+  try { useChatStore.getState().unsubscribe(workspaceId); } catch (e) {}
   try { useAgentStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] agent cleanup failed for ${workspaceId}:`, e); }
   try { usePrStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] pr cleanup failed for ${workspaceId}:`, e); }
killedBy: workspaceStore - _cleanupWorkspace handles store errors archiveWs succeeds even when chatStore.unsubscribe throws
statusReason: expected "warn" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/workspaceStore.ts:26:7
  * Unsubscribes event listeners from other stores to prevent memory leaks.
  */
 function _cleanupWorkspace(workspaceId: string) {
-  try { useChatStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] chat cleanup failed for ${workspaceId}:`, e); }
+  try {} catch (e) { console.warn(`[workspaceStore] chat cleanup failed for ${workspaceId}:`, e); }
   try { useAgentStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] agent cleanup failed for ${workspaceId}:`, e); }
   try { usePrStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] pr cleanup failed for ${workspaceId}:`, e); }
killedBy: workspaceStore - _cleanupWorkspace handles store errors archiveWs succeeds even when chatStore.unsubscribe throws
statusReason: expected "warn" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/workspaceStore.ts:27:7
  */
 function _cleanupWorkspace(workspaceId: string) {
   try { useChatStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] chat cleanup failed for ${workspaceId}:`, e); }
-  try { useAgentStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] agent cleanup failed for ${workspaceId}:`, e); }
+  try {} catch (e) { console.warn(`[workspaceStore] agent cleanup failed for ${workspaceId}:`, e); }
   try { usePrStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] pr cleanup failed for ${workspaceId}:`, e); }
   cleanupActivityTracking(workspaceId);
killedBy: workspaceStore - _cleanupWorkspace handles store errors archiveWs succeeds even when agentStore.unsubscribe throws
statusReason: expected "warn" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/workspaceStore.ts:27:72
  */
 function _cleanupWorkspace(workspaceId: string) {
   try { useChatStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] chat cleanup failed for ${workspaceId}:`, e); }
-  try { useAgentStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] agent cleanup failed for ${workspaceId}:`, e); }
+  try { useAgentStore.getState().unsubscribe(workspaceId); } catch (e) {}
   try { usePrStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] pr cleanup failed for ${workspaceId}:`, e); }
   cleanupActivityTracking(workspaceId);
killedBy: workspaceStore - _cleanupWorkspace handles store errors archiveWs succeeds even when agentStore.unsubscribe throws
statusReason: expected "warn" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/workspaceStore.ts:28:69
 function _cleanupWorkspace(workspaceId: string) {
   try { useChatStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] chat cleanup failed for ${workspaceId}:`, e); }
   try { useAgentStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] agent cleanup failed for ${workspaceId}:`, e); }
-  try { usePrStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] pr cleanup failed for ${workspaceId}:`, e); }
+  try { usePrStore.getState().unsubscribe(workspaceId); } catch (e) {}
   cleanupActivityTracking(workspaceId);
   cleanupNotificationTracking(workspaceId);
killedBy: workspaceStore - _cleanupWorkspace handles store errors archiveWs succeeds even when prStore.unsubscribe throws
statusReason: expected "warn" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/workspaceStore.ts:28:7
 function _cleanupWorkspace(workspaceId: string) {
   try { useChatStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] chat cleanup failed for ${workspaceId}:`, e); }
   try { useAgentStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] agent cleanup failed for ${workspaceId}:`, e); }
-  try { usePrStore.getState().unsubscribe(workspaceId); } catch (e) { console.warn(`[workspaceStore] pr cleanup failed for ${workspaceId}:`, e); }
+  try {} catch (e) { console.warn(`[workspaceStore] pr cleanup failed for ${workspaceId}:`, e); }
   cleanupActivityTracking(workspaceId);
   cleanupNotificationTracking(workspaceId);
killedBy: workspaceStore - _cleanupWorkspace handles store errors archiveWs succeeds even when prStore.unsubscribe throws
statusReason: expected "warn" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/stores/workspaceStore.ts:63:31
   error: null,
 // Stryker restore all
 
-  loadWorkspaces: async () => {
-    set({ loading: true, error: null });
-    try {
-      const workspaces = await listWorkspaces();
-      set({ workspaces, loading: false });
-    } catch (e) {
-      set({ error: String(e), loading: false });
-    }
-  },
+  loadWorkspaces: async () => {},
 
   createWs: async (request: CreateWorkspaceRequest) => {
killedBy: workspaceStore - loadWorkspaces loads workspaces and sets loading state
statusReason: expected [] to deeply equal [ { id: 'ws-1', …(4) } ]

[Killed] BooleanLiteral
src/stores/workspaceStore.ts:64:20
 // Stryker restore all
 
   loadWorkspaces: async () => {
-    set({ loading: true, error: null });
+    set({ loading: false, error: null });
     try {
       const workspaces = await listWorkspaces();
killedBy: workspaceStore - loadWorkspaces sets loading state sets loading to true then false
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:65:9
 
   loadWorkspaces: async () => {
     set({ loading: true, error: null });
-    try {
-      const workspaces = await listWorkspaces();
-      set({ workspaces, loading: false });
-    } catch (e) {
+    try {} catch (e) {
       set({ error: String(e), loading: false });
     }
killedBy: workspaceStore - loadWorkspaces loads workspaces and sets loading state
statusReason: expected [] to deeply equal [ { id: 'ws-1', …(4) } ]

[Killed] BooleanLiteral
src/stores/workspaceStore.ts:67:34
     set({ loading: true, error: null });
     try {
       const workspaces = await listWorkspaces();
-      set({ workspaces, loading: false });
+      set({ workspaces, loading: true });
     } catch (e) {
       set({ error: String(e), loading: false });
killedBy: workspaceStore - loadWorkspaces loads workspaces and sets loading state
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:68:17
     try {
       const workspaces = await listWorkspaces();
       set({ workspaces, loading: false });
-    } catch (e) {
-      set({ error: String(e), loading: false });
-    }
+    } catch (e) {}
   },
 
killedBy: workspaceStore - loadWorkspaces sets error on failure
statusReason: expected null to be 'Error: fail' // Object.is equality

[Killed] BooleanLiteral
src/stores/workspaceStore.ts:69:40
       const workspaces = await listWorkspaces();
       set({ workspaces, loading: false });
     } catch (e) {
-      set({ error: String(e), loading: false });
+      set({ error: String(e), loading: true });
     }
   },
killedBy: workspaceStore - loadWorkspaces sets error on failure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:73:56
     }
   },
 
-  createWs: async (request: CreateWorkspaceRequest) => {
-    set({ error: null });
-    try {
-      const ws = await createWorkspace(request);
-      set({
-        workspaces: [...get().workspaces, ws],
-        activeWorkspaceId: ws.id,
-      });
-      return ws;
-    } catch (e) {
-      set({ error: String(e) });
-      throw e;
-    }
-  },
+  createWs: async (request: CreateWorkspaceRequest) => {},
 
   archiveWs: async (id: string) => {
killedBy: workspaceStore - createWs creates a workspace and adds it to the list
statusReason: expected undefined to deeply equal { id: 'ws-new', name: 'test-ws', …(3) }

[Killed] BlockStatement
src/stores/workspaceStore.ts:75:9
 
   createWs: async (request: CreateWorkspaceRequest) => {
     set({ error: null });
-    try {
-      const ws = await createWorkspace(request);
-      set({
-        workspaces: [...get().workspaces, ws],
-        activeWorkspaceId: ws.id,
-      });
-      return ws;
-    } catch (e) {
+    try {} catch (e) {
       set({ error: String(e) });
       throw e;
killedBy: workspaceStore - createWs creates a workspace and adds it to the list
statusReason: expected undefined to deeply equal { id: 'ws-new', name: 'test-ws', …(3) }

[Killed] ArrayDeclaration
src/stores/workspaceStore.ts:78:21
     try {
       const ws = await createWorkspace(request);
       set({
-        workspaces: [...get().workspaces, ws],
+        workspaces: [],
         activeWorkspaceId: ws.id,
       });
killedBy: workspaceStore - createWs creates a workspace and adds it to the list
statusReason: expected [] to deep equally contain { id: 'ws-new', name: 'test-ws', …(3) }

[Killed] BlockStatement
src/stores/workspaceStore.ts:82:17
         activeWorkspaceId: ws.id,
       });
       return ws;
-    } catch (e) {
-      set({ error: String(e) });
-      throw e;
-    }
+    } catch (e) {}
   },
 
killedBy: workspaceStore - createWs sets error and throws on failure
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ObjectLiteral
src/stores/workspaceStore.ts:83:11
       });
       return ws;
     } catch (e) {
-      set({ error: String(e) });
+      set({});
       throw e;
     }
killedBy: workspaceStore - createWs sets error and throws on failure
statusReason: expected null to be 'Error: create fail' // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:89:9
   },
 
   archiveWs: async (id: string) => {
-    try {
-      await archiveWorkspace(id);
-      const archived = get().workspaces.find((w) => w.id === id);
-      const wasActive = get().activeWorkspaceId === id;
-      useUIStore.getState().closeChatTabsForContext(id);
-      const remaining = get().workspaces.filter((w) => w.id !== id);
-      const nextActive = wasActive
-        ? (remaining[0]?.id ?? null)
-        : get().activeWorkspaceId;
-      set({
-        workspaces: remaining,
-        archivedWorkspaces: archived
-          ? [...get().archivedWorkspaces, archived]
-          : get().archivedWorkspaces,
-        activeWorkspaceId: nextActive,
-        activeRepoId: wasActive ? null : get().activeRepoId,
-      });
-
-      // Cross-store cleanup for the archived workspace
-      _cleanupWorkspace(id);
-    } catch (e) {
+    try {} catch (e) {
       set({ error: String(e) });
       throw e;
killedBy: workspaceStore - archiveWs moves workspace from active to archived list
statusReason: expected [ { id: 'ws-1', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:91:53
   archiveWs: async (id: string) => {
     try {
       await archiveWorkspace(id);
-      const archived = get().workspaces.find((w) => w.id === id);
+      const archived = get().workspaces.find((w) => false);
       const wasActive = get().activeWorkspaceId === id;
       useUIStore.getState().closeChatTabsForContext(id);
killedBy: workspaceStore - archiveWs moves workspace from active to archived list
statusReason: expected [] to deep equally contain { id: 'ws-1', name: 'test-ws', …(3) }

[Killed] EqualityOperator
src/stores/workspaceStore.ts:91:53
   archiveWs: async (id: string) => {
     try {
       await archiveWorkspace(id);
-      const archived = get().workspaces.find((w) => w.id === id);
+      const archived = get().workspaces.find((w) => w.id !== id);
       const wasActive = get().activeWorkspaceId === id;
       useUIStore.getState().closeChatTabsForContext(id);
killedBy: workspaceStore - archiveWs moves workspace from active to archived list
statusReason: expected [] to deep equally contain { id: 'ws-1', name: 'test-ws', …(3) }

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:92:25
     try {
       await archiveWorkspace(id);
       const archived = get().workspaces.find((w) => w.id === id);
-      const wasActive = get().activeWorkspaceId === id;
+      const wasActive = true;
       useUIStore.getState().closeChatTabsForContext(id);
       const remaining = get().workspaces.filter((w) => w.id !== id);
killedBy: workspaceStore - archiveWs find and wasActive edge cases archiveWs non-active workspace preserves activeRepoId
statusReason: expected null to be 'repo-keep' // Object.is equality

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:92:25
     try {
       await archiveWorkspace(id);
       const archived = get().workspaces.find((w) => w.id === id);
-      const wasActive = get().activeWorkspaceId === id;
+      const wasActive = false;
       useUIStore.getState().closeChatTabsForContext(id);
       const remaining = get().workspaces.filter((w) => w.id !== id);
killedBy: workspaceStore - archiveWs clears activeWorkspaceId and activeRepoId when archiving the active workspace
statusReason: expected 'ws-1' to be null

[Killed] EqualityOperator
src/stores/workspaceStore.ts:94:56
       const archived = get().workspaces.find((w) => w.id === id);
       const wasActive = get().activeWorkspaceId === id;
       useUIStore.getState().closeChatTabsForContext(id);
-      const remaining = get().workspaces.filter((w) => w.id !== id);
+      const remaining = get().workspaces.filter((w) => w.id === id);
       const nextActive = wasActive
         ? (remaining[0]?.id ?? null)
killedBy: workspaceStore - archiveWs moves workspace from active to archived list
statusReason: expected [ { id: 'ws-1', …(4) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/stores/workspaceStore.ts:94:49
       const archived = get().workspaces.find((w) => w.id === id);
       const wasActive = get().activeWorkspaceId === id;
       useUIStore.getState().closeChatTabsForContext(id);
-      const remaining = get().workspaces.filter((w) => w.id !== id);
+      const remaining = get().workspaces.filter(() => undefined);
       const nextActive = wasActive
         ? (remaining[0]?.id ?? null)
killedBy: workspaceStore - archiveWs removes from active list removes archived workspace from workspaces array
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/stores/workspaceStore.ts:96:12
       useUIStore.getState().closeChatTabsForContext(id);
       const remaining = get().workspaces.filter((w) => w.id !== id);
       const nextActive = wasActive
-        ? (remaining[0]?.id ?? null)
+        ? (remaining[0]?.id && null)
         : get().activeWorkspaceId;
       set({
killedBy: workspaceStore - archiveWs clears activeWorkspaceId and activeRepoId when archiving the active workspace
statusReason: expected undefined to be null

[Killed] OptionalChaining
src/stores/workspaceStore.ts:96:12
       useUIStore.getState().closeChatTabsForContext(id);
       const remaining = get().workspaces.filter((w) => w.id !== id);
       const nextActive = wasActive
-        ? (remaining[0]?.id ?? null)
+        ? (remaining[0].id ?? null)
         : get().activeWorkspaceId;
       set({
killedBy: workspaceStore - archiveWs clears activeWorkspaceId and activeRepoId when archiving the active workspace
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/stores/workspaceStore.ts:109:17
 
       // Cross-store cleanup for the archived workspace
       _cleanupWorkspace(id);
-    } catch (e) {
-      set({ error: String(e) });
-      throw e;
-    }
+    } catch (e) {}
   },
 
killedBy: workspaceStore - archiveWs sets error and throws on failure
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/stores/workspaceStore.ts:115:35
     }
   },
 
-  deleteWs: async (id: string) => {
-    try {
-      const wasActive = get().activeWorkspaceId === id;
-      await deleteWorkspace(id);
-      useUIStore.getState().closeChatTabsForContext(id);
-      const remaining = get().workspaces.filter((w) => w.id !== id);
-      const nextActive = wasActive
-        ? (remaining[0]?.id ?? null)
-        : get().activeWorkspaceId;
-      set({
-        workspaces: remaining,
-        activeWorkspaceId: nextActive,
-        activeRepoId: wasActive ? null : get().activeRepoId,
-      });
-
-      // Cross-store cleanup for the deleted workspace
-      _cleanupWorkspace(id);
-    } catch (e) {
-      set({ error: String(e) });
-    }
-  },
+  deleteWs: async (id: string) => {},
 
   setActive: (id: string | null) => {
killedBy: workspaceStore - deleteWs removes workspace from the list
statusReason: expected [ { id: 'ws-1', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/stores/workspaceStore.ts:116:9
   },
 
   deleteWs: async (id: string) => {
-    try {
-      const wasActive = get().activeWorkspaceId === id;
-      await deleteWorkspace(id);
-      useUIStore.getState().closeChatTabsForContext(id);
-      const remaining = get().workspaces.filter((w) => w.id !== id);
-      const nextActive = wasActive
-        ? (remaining[0]?.id ?? null)
-        : get().activeWorkspaceId;
-      set({
-        workspaces: remaining,
-        activeWorkspaceId: nextActive,
-        activeRepoId: wasActive ? null : get().activeRepoId,
-      });
-
-      // Cross-store cleanup for the deleted workspace
-      _cleanupWorkspace(id);
-    } catch (e) {
+    try {} catch (e) {
       set({ error: String(e) });
     }
killedBy: workspaceStore - deleteWs removes workspace from the list
statusReason: expected [ { id: 'ws-1', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:117:25
 
   deleteWs: async (id: string) => {
     try {
-      const wasActive = get().activeWorkspaceId === id;
+      const wasActive = false;
       await deleteWorkspace(id);
       useUIStore.getState().closeChatTabsForContext(id);
killedBy: workspaceStore - deleteWs clears activeWorkspaceId and activeRepoId when deleting the active workspace
statusReason: expected 'ws-1' to be null

[Killed] EqualityOperator
src/stores/workspaceStore.ts:117:25
 
   deleteWs: async (id: string) => {
     try {
-      const wasActive = get().activeWorkspaceId === id;
+      const wasActive = get().activeWorkspaceId !== id;
       await deleteWorkspace(id);
       useUIStore.getState().closeChatTabsForContext(id);
killedBy: workspaceStore - deleteWs clears activeWorkspaceId and activeRepoId when deleting the active workspace
statusReason: expected 'ws-1' to be null

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:120:56
       const wasActive = get().activeWorkspaceId === id;
       await deleteWorkspace(id);
       useUIStore.getState().closeChatTabsForContext(id);
-      const remaining = get().workspaces.filter((w) => w.id !== id);
+      const remaining = get().workspaces.filter((w) => false);
       const nextActive = wasActive
         ? (remaining[0]?.id ?? null)
killedBy: workspaceStore - deleteWs removes from active list removes deleted workspace from workspaces array
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:120:56
       const wasActive = get().activeWorkspaceId === id;
       await deleteWorkspace(id);
       useUIStore.getState().closeChatTabsForContext(id);
-      const remaining = get().workspaces.filter((w) => w.id !== id);
+      const remaining = get().workspaces.filter((w) => true);
       const nextActive = wasActive
         ? (remaining[0]?.id ?? null)
killedBy: workspaceStore - deleteWs removes workspace from the list
statusReason: expected [ { id: 'ws-1', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/stores/workspaceStore.ts:132:17
 
       // Cross-store cleanup for the deleted workspace
       _cleanupWorkspace(id);
-    } catch (e) {
-      set({ error: String(e) });
-    }
+    } catch (e) {}
   },
 
killedBy: workspaceStore - deleteWs sets error on failure without throwing
statusReason: expected null to be 'Error: delete fail' // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:137:37
     }
   },
 
-  setActive: (id: string | null) => {
-    if (id) sessionStorage.setItem("fury:activeWorkspaceId", id);
-    else sessionStorage.removeItem("fury:activeWorkspaceId");
-    sessionStorage.removeItem("fury:activeRepoId");
-    set({ activeWorkspaceId: id, activeRepoId: null });
-  },
+  setActive: (id: string | null) => {},
 
   setActiveRepo: (id: string | null) => {
killedBy: workspaceStore - setActive / setActiveRepo setActive sets activeWorkspaceId and clears activeRepoId
statusReason: expected null to be 'ws-1' // Object.is equality

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:138:9
   },
 
   setActive: (id: string | null) => {
-    if (id) sessionStorage.setItem("fury:activeWorkspaceId", id);
+    if (true) sessionStorage.setItem("fury:activeWorkspaceId", id);
     else sessionStorage.removeItem("fury:activeWorkspaceId");
     sessionStorage.removeItem("fury:activeRepoId");
killedBy: workspaceStore - setActive sessionStorage removes workspace ID from sessionStorage when clearing active
statusReason: expected 'null' to be null

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:138:9
   },
 
   setActive: (id: string | null) => {
-    if (id) sessionStorage.setItem("fury:activeWorkspaceId", id);
+    if (false) sessionStorage.setItem("fury:activeWorkspaceId", id);
     else sessionStorage.removeItem("fury:activeWorkspaceId");
     sessionStorage.removeItem("fury:activeRepoId");
killedBy: workspaceStore - setActive sessionStorage stores workspace ID in sessionStorage when setting active
statusReason: expected null to be 'ws-99' // Object.is equality

[Killed] StringLiteral
src/stores/workspaceStore.ts:139:36
 
   setActive: (id: string | null) => {
     if (id) sessionStorage.setItem("fury:activeWorkspaceId", id);
-    else sessionStorage.removeItem("fury:activeWorkspaceId");
+    else sessionStorage.removeItem("");
     sessionStorage.removeItem("fury:activeRepoId");
     set({ activeWorkspaceId: id, activeRepoId: null });
killedBy: workspaceStore - setActive sessionStorage removes workspace ID from sessionStorage when clearing active
statusReason: expected 'ws-old' to be null

[Killed] StringLiteral
src/stores/workspaceStore.ts:140:31
   setActive: (id: string | null) => {
     if (id) sessionStorage.setItem("fury:activeWorkspaceId", id);
     else sessionStorage.removeItem("fury:activeWorkspaceId");
-    sessionStorage.removeItem("fury:activeRepoId");
+    sessionStorage.removeItem("");
     set({ activeWorkspaceId: id, activeRepoId: null });
   },
killedBy: workspaceStore - setActive sessionStorage removes repo ID from sessionStorage when setting workspace active
statusReason: expected 'repo-old' to be null

[Killed] BlockStatement
src/stores/workspaceStore.ts:144:41
     set({ activeWorkspaceId: id, activeRepoId: null });
   },
 
-  setActiveRepo: (id: string | null) => {
-    if (id) sessionStorage.setItem("fury:activeRepoId", id);
-    else sessionStorage.removeItem("fury:activeRepoId");
-    sessionStorage.removeItem("fury:activeWorkspaceId");
-    set({ activeRepoId: id, activeWorkspaceId: null });
-  },
+  setActiveRepo: (id: string | null) => {},
 
   loadArchivedWorkspaces: async () => {
killedBy: workspaceStore - setActive / setActiveRepo setActiveRepo sets activeRepoId and clears activeWorkspaceId
statusReason: expected null to be 'repo-1' // Object.is equality

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:145:9
   },
 
   setActiveRepo: (id: string | null) => {
-    if (id) sessionStorage.setItem("fury:activeRepoId", id);
+    if (true) sessionStorage.setItem("fury:activeRepoId", id);
     else sessionStorage.removeItem("fury:activeRepoId");
     sessionStorage.removeItem("fury:activeWorkspaceId");
killedBy: workspaceStore - setActiveRepo sessionStorage removes repo ID from sessionStorage when clearing active repo
statusReason: expected 'null' to be null

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:145:9
   },
 
   setActiveRepo: (id: string | null) => {
-    if (id) sessionStorage.setItem("fury:activeRepoId", id);
+    if (false) sessionStorage.setItem("fury:activeRepoId", id);
     else sessionStorage.removeItem("fury:activeRepoId");
     sessionStorage.removeItem("fury:activeWorkspaceId");
killedBy: workspaceStore - setActiveRepo sessionStorage stores repo ID in sessionStorage when setting active repo
statusReason: expected null to be 'repo-42' // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:151:39
     set({ activeRepoId: id, activeWorkspaceId: null });
   },
 
-  loadArchivedWorkspaces: async () => {
-    try {
-      const archived = await listArchivedWorkspaces();
-      set({ archivedWorkspaces: archived });
-    } catch (e) {
-      set({ error: String(e) });
-    }
-  },
+  loadArchivedWorkspaces: async () => {},
 
   restoreWs: async (id: string) => {
killedBy: workspaceStore - loadArchivedWorkspaces loads archived workspaces
statusReason: expected [] to deeply equal [ { id: 'ws-archived', …(4) } ]

[Killed] BlockStatement
src/stores/workspaceStore.ts:152:9
   },
 
   loadArchivedWorkspaces: async () => {
-    try {
-      const archived = await listArchivedWorkspaces();
-      set({ archivedWorkspaces: archived });
-    } catch (e) {
+    try {} catch (e) {
       set({ error: String(e) });
     }
killedBy: workspaceStore - loadArchivedWorkspaces loads archived workspaces
statusReason: expected [] to deeply equal [ { id: 'ws-archived', …(4) } ]

[Killed] BlockStatement
src/stores/workspaceStore.ts:155:17
     try {
       const archived = await listArchivedWorkspaces();
       set({ archivedWorkspaces: archived });
-    } catch (e) {
-      set({ error: String(e) });
-    }
+    } catch (e) {}
   },
 
killedBy: workspaceStore - loadArchivedWorkspaces sets error on failure
statusReason: expected null to be 'Error: load fail' // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:160:36
     }
   },
 
-  restoreWs: async (id: string) => {
-    try {
-      const ws = await restoreWorkspace(id);
-      set({
-        workspaces: [...get().workspaces, ws],
-        archivedWorkspaces: get().archivedWorkspaces.filter(
-          (w) => w.id !== id,
-        ),
-      });
-    } catch (e) {
-      set({ error: String(e) });
-      throw e;
-    }
-  },
+  restoreWs: async (id: string) => {},
 
   renameWs: async (id: string, name: string) => {
killedBy: workspaceStore - restoreWs moves workspace from archived to active list
statusReason: expected [] to deep equally contain { id: 'ws-1', name: 'test-ws', …(3) }

[Killed] BlockStatement
src/stores/workspaceStore.ts:161:9
   },
 
   restoreWs: async (id: string) => {
-    try {
-      const ws = await restoreWorkspace(id);
-      set({
-        workspaces: [...get().workspaces, ws],
-        archivedWorkspaces: get().archivedWorkspaces.filter(
-          (w) => w.id !== id,
-        ),
-      });
-    } catch (e) {
+    try {} catch (e) {
       set({ error: String(e) });
       throw e;
killedBy: workspaceStore - restoreWs moves workspace from archived to active list
statusReason: expected [] to deep equally contain { id: 'ws-1', name: 'test-ws', …(3) }
