[Killed] MethodExpression
src/stores/workspaceStore.ts:165:29
       const ws = await restoreWorkspace(id);
       set({
         workspaces: [...get().workspaces, ws],
-        archivedWorkspaces: get().archivedWorkspaces.filter(
-          (w) => w.id !== id,
-        ),
+        archivedWorkspaces: get().archivedWorkspaces,
       });
     } catch (e) {
killedBy: workspaceStore - restoreWs moves workspace from archived to active list
statusReason: expected [ { id: 'ws-1', …(4) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/stores/workspaceStore.ts:166:18
       set({
         workspaces: [...get().workspaces, ws],
         archivedWorkspaces: get().archivedWorkspaces.filter(
-          (w) => w.id !== id,
+          (w) => w.id === id,
         ),
       });
killedBy: workspaceStore - restoreWs moves workspace from archived to active list
statusReason: expected [ { id: 'ws-1', …(4) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/stores/workspaceStore.ts:166:11
       set({
         workspaces: [...get().workspaces, ws],
         archivedWorkspaces: get().archivedWorkspaces.filter(
-          (w) => w.id !== id,
+          () => undefined,
         ),
       });
killedBy: workspaceStore - restoreWs removes from archived list filters restored workspace from archivedWorkspaces
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/stores/workspaceStore.ts:169:17
           (w) => w.id !== id,
         ),
       });
-    } catch (e) {
-      set({ error: String(e) });
-      throw e;
-    }
+    } catch (e) {}
   },
 
killedBy: workspaceStore - restoreWs sets error and throws on failure
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/stores/workspaceStore.ts:175:49
     }
   },
 
-  renameWs: async (id: string, name: string) => {
-    try {
-      await renameWorkspace(id, name);
-      set({
-        workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, name } : w,
-        ),
-      });
-    } catch (e) {
-      set({ error: String(e) });
-      throw e;
-    }
-  },
+  renameWs: async (id: string, name: string) => {},
 
   pinWs: async (id: string, pinned: boolean) => {
killedBy: workspaceStore - renameWs renames a workspace in the list
statusReason: expected 'old-name' to be 'new-name' // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:176:9
   },
 
   renameWs: async (id: string, name: string) => {
-    try {
-      await renameWorkspace(id, name);
-      set({
-        workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, name } : w,
-        ),
-      });
-    } catch (e) {
+    try {} catch (e) {
       set({ error: String(e) });
       throw e;
killedBy: workspaceStore - renameWs renames a workspace in the list
statusReason: expected 'old-name' to be 'new-name' // Object.is equality

[Killed] ArrowFunction
src/stores/workspaceStore.ts:179:42
     try {
       await renameWorkspace(id, name);
       set({
-        workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, name } : w,
+        workspaces: get().workspaces.map(() => undefined,
         ),
       });
killedBy: workspaceStore - renameWs renames a workspace in the list
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:180:11
       await renameWorkspace(id, name);
       set({
         workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, name } : w,
+          true ? { ...w, name } : w,
         ),
       });
killedBy: workspaceStore - renameWs leaves non-matching workspaces unchanged
statusReason: expected 'renamed' to be 'two' // Object.is equality

[Killed] EqualityOperator
src/stores/workspaceStore.ts:180:11
       await renameWorkspace(id, name);
       set({
         workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, name } : w,
+          w.id !== id ? { ...w, name } : w,
         ),
       });
killedBy: workspaceStore - renameWs renames a workspace in the list
statusReason: expected 'old-name' to be 'new-name' // Object.is equality

[Killed] BlockStatement
src/stores/workspaceStore.ts:189:49
     }
   },
 
-  pinWs: async (id: string, pinned: boolean) => {
-    try {
-      await setWorkspacePinned(id, pinned);
-      set({
-        workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, pinned } : w,
-        ),
-      });
-    } catch (e) {
-      set({ error: String(e) });
-      throw e;
-    }
-  },
+  pinWs: async (id: string, pinned: boolean) => {},
 }));
 
killedBy: workspaceStore - pinWs pins a workspace and updates the list
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-1', true ]

Number of calls: 0

[Killed] BlockStatement
src/stores/workspaceStore.ts:190:9
   },
 
   pinWs: async (id: string, pinned: boolean) => {
-    try {
-      await setWorkspacePinned(id, pinned);
-      set({
-        workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, pinned } : w,
-        ),
-      });
-    } catch (e) {
+    try {} catch (e) {
       set({ error: String(e) });
       throw e;
killedBy: workspaceStore - pinWs pins a workspace and updates the list
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-1', true ]

Number of calls: 0

[Killed] ArrowFunction
src/stores/workspaceStore.ts:193:42
     try {
       await setWorkspacePinned(id, pinned);
       set({
-        workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, pinned } : w,
+        workspaces: get().workspaces.map(() => undefined,
         ),
       });
killedBy: workspaceStore - pinWs pins a workspace and updates the list
statusReason: Cannot read properties of undefined (reading 'pinned')

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:194:11
       await setWorkspacePinned(id, pinned);
       set({
         workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, pinned } : w,
+          true ? { ...w, pinned } : w,
         ),
       });
killedBy: workspaceStore - pinWs leaves other workspaces unchanged
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/stores/workspaceStore.ts:194:11
       await setWorkspacePinned(id, pinned);
       set({
         workspaces: get().workspaces.map((w) =>
-          w.id === id ? { ...w, pinned } : w,
+          false ? { ...w, pinned } : w,
         ),
       });
killedBy: workspaceStore - pinWs pins a workspace and updates the list
statusReason: expected false to be true // Object.is equality
