[Killed] BlockStatement
src/stores/agentStore.ts:48:52
   needsAttention: {},
   runStartedAt: {},
 
-  getStatus: (workspaceId: string): AgentStatus => {
-    return get().agents[workspaceId]?.status ?? "Idle";
-  },
+  getStatus: (workspaceId: string): AgentStatus => {},
 
   subscribe: async (workspaceId: string) => {
killedBy: agentStore - getStatus returns Idle when no agent info exists
statusReason: expected undefined to be 'Idle' // Object.is equality

[Killed] LogicalOperator
src/stores/agentStore.ts:49:12
   runStartedAt: {},
 
   getStatus: (workspaceId: string): AgentStatus => {
-    return get().agents[workspaceId]?.status ?? "Idle";
+    return get().agents[workspaceId]?.status && "Idle";
   },
 
killedBy: agentStore - getStatus returns Idle when no agent info exists
statusReason: expected undefined to be 'Idle' // Object.is equality

[Killed] OptionalChaining
src/stores/agentStore.ts:49:12
   runStartedAt: {},
 
   getStatus: (workspaceId: string): AgentStatus => {
-    return get().agents[workspaceId]?.status ?? "Idle";
+    return get().agents[workspaceId].status ?? "Idle";
   },
 
killedBy: agentStore - getStatus returns Idle when no agent info exists
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/stores/agentStore.ts:54:9
 
   subscribe: async (workspaceId: string) => {
     // Don't double-subscribe
-    if (get().subscriptions[workspaceId]) return;
+    if (false) return;
 
     const unlisten = await listen<AgentStatusEvent>(
killedBy: agentStore - subscribe does not double-subscribe
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/stores/agentStore.ts:54:9
 
   subscribe: async (workspaceId: string) => {
     // Don't double-subscribe
-    if (get().subscriptions[workspaceId]) return;
+    if (true) return;
 
     const unlisten = await listen<AgentStatusEvent>(
killedBy: agentStore - subscribe registers a listener for agent-status events
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent-status:ws-1', Any<Function> ]

Number of calls: 0

[Killed] OptionalChaining
src/stores/agentStore.ts:60:28
       `agent-status:${workspaceId}`,
       (event) => {
         const newStatus = event.payload.status;
-        const prevStatus = get().agents[workspaceId]?.status ?? "Idle";
+        const prevStatus = get().agents[workspaceId].status ?? "Idle";
         pushStreamEvent(workspaceId, "status_changed", `${JSON.stringify(prevStatus)} -> ${JSON.stringify(newStatus)}`);
         const becameIdle = prevStatus === "Running" && newStatus === "Idle";
killedBy: agentStore - subscribe updates agent status from event callback
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] LogicalOperator
src/stores/agentStore.ts:60:28
       `agent-status:${workspaceId}`,
       (event) => {
         const newStatus = event.payload.status;
-        const prevStatus = get().agents[workspaceId]?.status ?? "Idle";
+        const prevStatus = get().agents[workspaceId]?.status && "Idle";
         pushStreamEvent(workspaceId, "status_changed", `${JSON.stringify(prevStatus)} -> ${JSON.stringify(newStatus)}`);
         const becameIdle = prevStatus === "Running" && newStatus === "Idle";
killedBy: agentStore - needsAttention sets needsAttention when agent transitions from Running to Idle
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/stores/agentStore.ts:62:28
         const newStatus = event.payload.status;
         const prevStatus = get().agents[workspaceId]?.status ?? "Idle";
         pushStreamEvent(workspaceId, "status_changed", `${JSON.stringify(prevStatus)} -> ${JSON.stringify(newStatus)}`);
-        const becameIdle = prevStatus === "Running" && newStatus === "Idle";
+        const becameIdle = true;
         const becameRunning = prevStatus !== "Running" && newStatus === "Running";
         set((state) => {
killedBy: agentStore - needsAttention does not set needsAttention for Idle to Idle transition
statusReason: expected true to be undefined

[Killed] ConditionalExpression
src/stores/agentStore.ts:62:28
         const newStatus = event.payload.status;
         const prevStatus = get().agents[workspaceId]?.status ?? "Idle";
         pushStreamEvent(workspaceId, "status_changed", `${JSON.stringify(prevStatus)} -> ${JSON.stringify(newStatus)}`);
-        const becameIdle = prevStatus === "Running" && newStatus === "Idle";
+        const becameIdle = true && newStatus === "Idle";
         const becameRunning = prevStatus !== "Running" && newStatus === "Running";
         set((state) => {
killedBy: agentStore - needsAttention does not set needsAttention for Idle to Idle transition
statusReason: expected true to be undefined

[Killed] ConditionalExpression
src/stores/agentStore.ts:63:31
         const prevStatus = get().agents[workspaceId]?.status ?? "Idle";
         pushStreamEvent(workspaceId, "status_changed", `${JSON.stringify(prevStatus)} -> ${JSON.stringify(newStatus)}`);
         const becameIdle = prevStatus === "Running" && newStatus === "Idle";
-        const becameRunning = prevStatus !== "Running" && newStatus === "Running";
+        const becameRunning = false;
         set((state) => {
           const runStartedAt = { ...state.runStartedAt };
killedBy: agentStore - status change tracking via listener sets runStartedAt when agent becomes Running
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/stores/agentStore.ts:63:59
         const prevStatus = get().agents[workspaceId]?.status ?? "Idle";
         pushStreamEvent(workspaceId, "status_changed", `${JSON.stringify(prevStatus)} -> ${JSON.stringify(newStatus)}`);
         const becameIdle = prevStatus === "Running" && newStatus === "Idle";
-        const becameRunning = prevStatus !== "Running" && newStatus === "Running";
+        const becameRunning = prevStatus !== "Running" && true;
         set((state) => {
           const runStartedAt = { ...state.runStartedAt };
killedBy: agentStore - status change tracking via listener does NOT set runStartedAt on Idle→Idle
statusReason: expected 1774761509909 to be undefined

[Killed] BlockStatement
src/stores/agentStore.ts:64:24
         pushStreamEvent(workspaceId, "status_changed", `${JSON.stringify(prevStatus)} -> ${JSON.stringify(newStatus)}`);
         const becameIdle = prevStatus === "Running" && newStatus === "Idle";
         const becameRunning = prevStatus !== "Running" && newStatus === "Running";
-        set((state) => {
-          const runStartedAt = { ...state.runStartedAt };
-          if (becameRunning) {
-            runStartedAt[workspaceId] = Date.now();
-          } else if (becameIdle) {
-            delete runStartedAt[workspaceId];
-          }
-          return {
-            agents: {
-              ...state.agents,
-              [workspaceId]: {
-                ...state.agents[workspaceId],
-                workspaceId,
-                status: newStatus,
-              } as AgentInfo,
-            },
-            runStartedAt,
-            ...(becameIdle
-              ? { needsAttention: { ...state.needsAttention, [workspaceId]: true } }
-              : {}),
-          };
-        });
+        set((state) => {});
       },
     );
killedBy: agentStore - subscribe updates agent status from event callback
statusReason: Cannot read properties of undefined (reading 'agents')

[Killed] BlockStatement
src/stores/agentStore.ts:66:30
         const becameRunning = prevStatus !== "Running" && newStatus === "Running";
         set((state) => {
           const runStartedAt = { ...state.runStartedAt };
-          if (becameRunning) {
-            runStartedAt[workspaceId] = Date.now();
-          } else if (becameIdle) {
+          if (becameRunning) {} else if (becameIdle) {
             delete runStartedAt[workspaceId];
           }
killedBy: agentStore - status change tracking via listener sets runStartedAt when agent becomes Running
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/stores/agentStore.ts:66:15
         const becameRunning = prevStatus !== "Running" && newStatus === "Running";
         set((state) => {
           const runStartedAt = { ...state.runStartedAt };
-          if (becameRunning) {
+          if (true) {
             runStartedAt[workspaceId] = Date.now();
           } else if (becameIdle) {
killedBy: agentStore - status change tracking via listener clears runStartedAt when agent becomes Idle from Running
statusReason: expected 1774761510314 to be undefined

[Killed] ConditionalExpression
src/stores/agentStore.ts:68:22
           const runStartedAt = { ...state.runStartedAt };
           if (becameRunning) {
             runStartedAt[workspaceId] = Date.now();
-          } else if (becameIdle) {
+          } else if (false) {
             delete runStartedAt[workspaceId];
           }
killedBy: agentStore - status change tracking via listener clears runStartedAt when agent becomes Idle from Running
statusReason: expected 1774761510702 to be undefined

[Killed] BlockStatement
src/stores/agentStore.ts:68:34
           const runStartedAt = { ...state.runStartedAt };
           if (becameRunning) {
             runStartedAt[workspaceId] = Date.now();
-          } else if (becameIdle) {
-            delete runStartedAt[workspaceId];
-          }
+          } else if (becameIdle) {}
           return {
             agents: {
killedBy: agentStore - status change tracking via listener clears runStartedAt when agent becomes Idle from Running
statusReason: expected 1774761510729 to be undefined

[Killed] BooleanLiteral
src/stores/agentStore.ts:82:77
             },
             runStartedAt,
             ...(becameIdle
-              ? { needsAttention: { ...state.needsAttention, [workspaceId]: true } }
+              ? { needsAttention: { ...state.needsAttention, [workspaceId]: false } }
               : {}),
           };
killedBy: agentStore - needsAttention sets needsAttention when agent transitions from Running to Idle
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/stores/agentStore.ts:82:17
             },
             runStartedAt,
             ...(becameIdle
-              ? { needsAttention: { ...state.needsAttention, [workspaceId]: true } }
+              ? {}
               : {}),
           };
killedBy: agentStore - needsAttention sets needsAttention when agent transitions from Running to Idle
statusReason: expected undefined to be true // Object.is equality

[Killed] ObjectLiteral
src/stores/agentStore.ts:89:21
       },
     );
 
-    set((state) => ({
-      subscriptions: { ...state.subscriptions, [workspaceId]: unlisten },
-    }));
+    set((state) => ({}));
   },
 
killedBy: agentStore - subscribe registers a listener for agent-status events
statusReason: expected undefined to be [Function Mock] // Object.is equality

[Killed] BlockStatement
src/stores/agentStore.ts:94:41
     }));
   },
 
-  unsubscribe: (workspaceId: string) => {
-    const unsub = get().subscriptions[workspaceId];
-    if (unsub) {
-      unsub();
-      set((state) => {
-        const { [workspaceId]: _, ...rest } = state.subscriptions;
-        return { subscriptions: rest };
-      });
-    }
-  },
+  unsubscribe: (workspaceId: string) => {},
 
   clearNeedsAttention: (workspaceId: string) => {
killedBy: agentStore - unsubscribe calls unlisten and removes subscription
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/stores/agentStore.ts:96:16
 
   unsubscribe: (workspaceId: string) => {
     const unsub = get().subscriptions[workspaceId];
-    if (unsub) {
-      unsub();
-      set((state) => {
-        const { [workspaceId]: _, ...rest } = state.subscriptions;
-        return { subscriptions: rest };
-      });
-    }
+    if (unsub) {}
   },
 
killedBy: agentStore - unsubscribe calls unlisten and removes subscription
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/stores/agentStore.ts:105:49
     }
   },
 
-  clearNeedsAttention: (workspaceId: string) => {
-    set((state) => ({
-      needsAttention: { ...state.needsAttention, [workspaceId]: false },
-    }));
-  },
+  clearNeedsAttention: (workspaceId: string) => {},
 
   sendMessage: async (
killedBy: agentStore - needsAttention clears needsAttention via clearNeedsAttention
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/stores/agentStore.ts:106:9
   },
 
   clearNeedsAttention: (workspaceId: string) => {
-    set((state) => ({
-      needsAttention: { ...state.needsAttention, [workspaceId]: false },
-    }));
+    set(() => undefined);
   },
 
killedBy: agentStore - needsAttention clears needsAttention via clearNeedsAttention
statusReason: Cannot read properties of undefined (reading 'needsAttention')

[Killed] BooleanLiteral
src/stores/agentStore.ts:107:65
 
   clearNeedsAttention: (workspaceId: string) => {
     set((state) => ({
-      needsAttention: { ...state.needsAttention, [workspaceId]: false },
+      needsAttention: { ...state.needsAttention, [workspaceId]: true },
     }));
   },
killedBy: agentStore - needsAttention clears needsAttention via clearNeedsAttention
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/agentStore.ts:118:8
     model?: string,
     disableThinking?: boolean,
     disablePlanMode?: boolean,
-  ) => {
-    try {
-      // If agent is already running, send as a follow-up via stdin
-      const status = get().agents[contextId]?.status;
-      if (status === "Running") {
-        await sendFollowupCmd(contextId, message);
-        return;
-      }
-
-      const request =
-        contextType === "workspace"
-          ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
-          : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
-      await sendMessageCmd(request);
-    } catch (e) {
-      console.error(`[agentStore] Failed to send message:`, e);
-      throw e;
-    }
-  },
+  ) => {},
 
   broadcastMessage: async (
killedBy: agentStore - sendMessage sends workspace message
statusReason: expected "vi.fn()" to be called with arguments: [ { workspaceId: 'ws-1', …(3) } ]

Number of calls: 0

[Killed] BlockStatement
src/stores/agentStore.ts:119:9
     disableThinking?: boolean,
     disablePlanMode?: boolean,
   ) => {
-    try {
-      // If agent is already running, send as a follow-up via stdin
-      const status = get().agents[contextId]?.status;
-      if (status === "Running") {
-        await sendFollowupCmd(contextId, message);
-        return;
-      }
-
-      const request =
-        contextType === "workspace"
-          ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
-          : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
-      await sendMessageCmd(request);
-    } catch (e) {
+    try {} catch (e) {
       console.error(`[agentStore] Failed to send message:`, e);
       throw e;
killedBy: agentStore - sendMessage sends workspace message
statusReason: expected "vi.fn()" to be called with arguments: [ { workspaceId: 'ws-1', …(3) } ]

Number of calls: 0

[Killed] OptionalChaining
src/stores/agentStore.ts:121:22
   ) => {
     try {
       // If agent is already running, send as a follow-up via stdin
-      const status = get().agents[contextId]?.status;
+      const status = get().agents[contextId].status;
       if (status === "Running") {
         await sendFollowupCmd(contextId, message);
killedBy: agentStore - sendMessage sends workspace message
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/stores/agentStore.ts:122:11
     try {
       // If agent is already running, send as a follow-up via stdin
       const status = get().agents[contextId]?.status;
-      if (status === "Running") {
+      if (status !== "Running") {
         await sendFollowupCmd(contextId, message);
         return;
killedBy: agentStore - sendMessage sends workspace message
statusReason: expected "vi.fn()" to be called with arguments: [ { workspaceId: 'ws-1', …(3) } ]

Number of calls: 0

[Killed] BlockStatement
src/stores/agentStore.ts:122:33
     try {
       // If agent is already running, send as a follow-up via stdin
       const status = get().agents[contextId]?.status;
-      if (status === "Running") {
-        await sendFollowupCmd(contextId, message);
-        return;
-      }
+      if (status === "Running") {}
 
       const request =
killedBy: agentStore - sendMessage sends followup when agent is already Running
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-1', 'followup' ]

Number of calls: 0

[Killed] ConditionalExpression
src/stores/agentStore.ts:128:9
       }
 
       const request =
-        contextType === "workspace"
+        false
           ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
           : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
killedBy: agentStore - sendMessage sends workspace message
statusReason: expected "vi.fn()" to be called with arguments: [ { workspaceId: 'ws-1', …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/stores/agentStore.ts:128:9
       }
 
       const request =
-        contextType === "workspace"
+        true
           ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
           : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
killedBy: agentStore - sendMessage sends repo message when contextType is repo
statusReason: expected "vi.fn()" to be called with arguments: [ { repoId: 'repo-1', …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/stores/agentStore.ts:129:55
 
       const request =
         contextType === "workspace"
-          ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
+          ? { workspaceId: contextId, message, model: true, disableThinking, disablePlanMode }
           : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
       await sendMessageCmd(request);
killedBy: agentStore - sendMessage sends workspace message
statusReason: expected "vi.fn()" to be called with arguments: [ { workspaceId: 'ws-1', …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/stores/agentStore.ts:129:55
 
       const request =
         contextType === "workspace"
-          ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
+          ? { workspaceId: contextId, message, model: false, disableThinking, disablePlanMode }
           : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
       await sendMessageCmd(request);
killedBy: agentStore - sendMessage sends workspace message
statusReason: expected "vi.fn()" to be called with arguments: [ { workspaceId: 'ws-1', …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/stores/agentStore.ts:130:50
       const request =
         contextType === "workspace"
           ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
-          : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
+          : { repoId: contextId, message, model: false, disableThinking, disablePlanMode };
       await sendMessageCmd(request);
     } catch (e) {
killedBy: agentStore - sendMessage sends repo message when contextType is repo
statusReason: expected "vi.fn()" to be called with arguments: [ { repoId: 'repo-1', …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
src/stores/agentStore.ts:130:50
       const request =
         contextType === "workspace"
           ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
-          : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
+          : { repoId: contextId, message, model: model && undefined, disableThinking, disablePlanMode };
       await sendMessageCmd(request);
     } catch (e) {
killedBy: agentStore - error message content model passed correctly in repo context
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/stores/agentStore.ts:132:17
           ? { workspaceId: contextId, message, model: model || undefined, disableThinking, disablePlanMode }
           : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
       await sendMessageCmd(request);
-    } catch (e) {
-      console.error(`[agentStore] Failed to send message:`, e);
-      throw e;
-    }
+    } catch (e) {}
   },
 
killedBy: agentStore - sendMessage re-throws errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/stores/agentStore.ts:133:21
           : { repoId: contextId, message, model: model || undefined, disableThinking, disablePlanMode };
       await sendMessageCmd(request);
     } catch (e) {
-      console.error(`[agentStore] Failed to send message:`, e);
+      console.error(``, e);
       throw e;
     }
killedBy: agentStore - error message content sendMessage error log includes function context
statusReason: expected "error" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Received: 

  1st error call:

  [
-   StringContaining "Failed to send message",

[Killed] BlockStatement
src/stores/agentStore.ts:142:8
     workspaceIds: string[],
     message: string,
     model?: string,
-  ) => {
-    const succeeded: string[] = [];
-    const failed: { workspaceId: string; error: string }[] = [];
-    const results = await Promise.allSettled(
-      workspaceIds.map((id) =>
-        sendMessageCmd({ workspaceId: id, message, model: model || undefined }),
-      ),
-    );
-    results.forEach((result, i) => {
-      if (result.status === "fulfilled") {
-        succeeded.push(workspaceIds[i]);
-      } else {
-        failed.push({ workspaceId: workspaceIds[i], error: String(result.reason) });
-      }
-    });
-    return { succeeded, failed };
-  },
+  ) => {},
 
   stopAgent: async (workspaceId: string) => {
killedBy: agentStore - broadcastMessage sends messages to all workspace IDs
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ArrayDeclaration
src/stores/agentStore.ts:143:33
     message: string,
     model?: string,
   ) => {
-    const succeeded: string[] = [];
+    const succeeded: string[] = ["Stryker was here"];
     const failed: { workspaceId: string; error: string }[] = [];
     const results = await Promise.allSettled(
killedBy: agentStore - broadcastMessage sends messages to all workspace IDs
statusReason: expected [ 'Stryker was here', 'ws-1', 'ws-2' ] to deeply equal [ 'ws-1', 'ws-2' ]

[Killed] ArrowFunction
src/stores/agentStore.ts:146:24
     const succeeded: string[] = [];
     const failed: { workspaceId: string; error: string }[] = [];
     const results = await Promise.allSettled(
-      workspaceIds.map((id) =>
-        sendMessageCmd({ workspaceId: id, message, model: model || undefined }),
+      workspaceIds.map(() => undefined,
       ),
     );
killedBy: agentStore - broadcastMessage sends messages to all workspace IDs
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
src/stores/agentStore.ts:147:59
     const failed: { workspaceId: string; error: string }[] = [];
     const results = await Promise.allSettled(
       workspaceIds.map((id) =>
-        sendMessageCmd({ workspaceId: id, message, model: model || undefined }),
+        sendMessageCmd({ workspaceId: id, message, model: false }),
       ),
     );
killedBy: agentStore - broadcastMessage sends messages to all workspace IDs
statusReason: expected "vi.fn()" to be called with arguments: [ { workspaceId: 'ws-1', …(1) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
src/stores/agentStore.ts:147:59
     const failed: { workspaceId: string; error: string }[] = [];
     const results = await Promise.allSettled(
       workspaceIds.map((id) =>
-        sendMessageCmd({ workspaceId: id, message, model: model || undefined }),
+        sendMessageCmd({ workspaceId: id, message, model: model && undefined }),
       ),
     );
killedBy: agentStore - broadcastMessage passes model when provided
statusReason: expected "vi.fn()" to be called with arguments: [ { workspaceId: 'ws-1', …(2) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/stores/agentStore.ts:150:36
         sendMessageCmd({ workspaceId: id, message, model: model || undefined }),
       ),
     );
-    results.forEach((result, i) => {
-      if (result.status === "fulfilled") {
-        succeeded.push(workspaceIds[i]);
-      } else {
-        failed.push({ workspaceId: workspaceIds[i], error: String(result.reason) });
-      }
-    });
+    results.forEach((result, i) => {});
     return { succeeded, failed };
   },
killedBy: agentStore - broadcastMessage sends messages to all workspace IDs
statusReason: expected [] to deeply equal [ 'ws-1', 'ws-2' ]

[Killed] BlockStatement
src/stores/agentStore.ts:151:42
       ),
     );
     results.forEach((result, i) => {
-      if (result.status === "fulfilled") {
-        succeeded.push(workspaceIds[i]);
-      } else {
+      if (result.status === "fulfilled") {} else {
         failed.push({ workspaceId: workspaceIds[i], error: String(result.reason) });
       }
killedBy: agentStore - broadcastMessage sends messages to all workspace IDs
statusReason: expected [] to deeply equal [ 'ws-1', 'ws-2' ]

[Killed] EqualityOperator
src/stores/agentStore.ts:151:11
       ),
     );
     results.forEach((result, i) => {
-      if (result.status === "fulfilled") {
+      if (result.status !== "fulfilled") {
         succeeded.push(workspaceIds[i]);
       } else {
killedBy: agentStore - broadcastMessage sends messages to all workspace IDs
statusReason: expected [] to deeply equal [ 'ws-1', 'ws-2' ]

[Killed] BlockStatement
src/stores/agentStore.ts:153:14
     results.forEach((result, i) => {
       if (result.status === "fulfilled") {
         succeeded.push(workspaceIds[i]);
-      } else {
-        failed.push({ workspaceId: workspaceIds[i], error: String(result.reason) });
-      }
+      } else {}
     });
     return { succeeded, failed };
killedBy: agentStore - broadcastMessage collects failures for rejected sends
statusReason: expected [] to deeply equal [ { workspaceId: 'ws-2', …(1) } ]

[Killed] BlockStatement
src/stores/agentStore.ts:160:45
     return { succeeded, failed };
   },
 
-  stopAgent: async (workspaceId: string) => {
-    try {
-      await stopAgentCmd(workspaceId);
-    } catch (e) {
-      console.error(`[agentStore] Failed to stop agent:`, e);
-      throw e;
-    }
-  },
+  stopAgent: async (workspaceId: string) => {},
 
   stopAllAgents: async (workspaceIds: string[]) => {
killedBy: agentStore - stopAgent calls Tauri stop command
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-1' ]

Number of calls: 0

[Killed] BlockStatement
src/stores/agentStore.ts:161:9
   },
 
   stopAgent: async (workspaceId: string) => {
-    try {
-      await stopAgentCmd(workspaceId);
-    } catch (e) {
+    try {} catch (e) {
       console.error(`[agentStore] Failed to stop agent:`, e);
       throw e;
killedBy: agentStore - stopAgent calls Tauri stop command
statusReason: expected "vi.fn()" to be called with arguments: [ 'ws-1' ]

Number of calls: 0

[Killed] BlockStatement
src/stores/agentStore.ts:163:17
   stopAgent: async (workspaceId: string) => {
     try {
       await stopAgentCmd(workspaceId);
-    } catch (e) {
-      console.error(`[agentStore] Failed to stop agent:`, e);
-      throw e;
-    }
+    } catch (e) {}
   },
 
killedBy: agentStore - stopAgent re-throws errors from stopAgent
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/stores/agentStore.ts:169:52
     }
   },
 
-  stopAllAgents: async (workspaceIds: string[]) => {
-    await Promise.allSettled(workspaceIds.map((id) => stopAgentCmd(id)));
-  },
+  stopAllAgents: async (workspaceIds: string[]) => {},
 
   fetchStatus: async (workspaceId: string) => {
killedBy: agentStore - stopAllAgents calls stopAgent for all workspace IDs
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ArrowFunction
src/stores/agentStore.ts:170:47
   },
 
   stopAllAgents: async (workspaceIds: string[]) => {
-    await Promise.allSettled(workspaceIds.map((id) => stopAgentCmd(id)));
+    await Promise.allSettled(workspaceIds.map(() => undefined));
   },
 
killedBy: agentStore - stopAllAgents calls stopAgent for all workspace IDs
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times
