[Killed] BlockStatement
src/stores/agentStore.ts:173:47
     await Promise.allSettled(workspaceIds.map((id) => stopAgentCmd(id)));
   },
 
-  fetchStatus: async (workspaceId: string) => {
-    try {
-      const info = await getAgentStatus(workspaceId);
-      set((state) => ({
-        agents: { ...state.agents, [workspaceId]: info },
-      }));
-    } catch (e) {
-      console.error(`[agentStore] Failed to fetch status:`, e);
-    }
-  },
+  fetchStatus: async (workspaceId: string) => {},
 }));
 
killedBy: agentStore - fetchStatus fetches and stores agent info
statusReason: expected undefined to deeply equal { workspaceId: 'ws-1', …(3) }

[Killed] BlockStatement
src/stores/agentStore.ts:174:9
   },
 
   fetchStatus: async (workspaceId: string) => {
-    try {
-      const info = await getAgentStatus(workspaceId);
-      set((state) => ({
-        agents: { ...state.agents, [workspaceId]: info },
-      }));
-    } catch (e) {
+    try {} catch (e) {
       console.error(`[agentStore] Failed to fetch status:`, e);
     }
killedBy: agentStore - fetchStatus fetches and stores agent info
statusReason: expected undefined to deeply equal { workspaceId: 'ws-1', …(3) }

[Killed] ArrowFunction
src/stores/agentStore.ts:176:11
   fetchStatus: async (workspaceId: string) => {
     try {
       const info = await getAgentStatus(workspaceId);
-      set((state) => ({
-        agents: { ...state.agents, [workspaceId]: info },
-      }));
+      set(() => undefined);
     } catch (e) {
       console.error(`[agentStore] Failed to fetch status:`, e);
killedBy: agentStore - fetchStatus fetches and stores agent info
statusReason: Cannot read properties of undefined (reading 'agents')

[Killed] BlockStatement
src/stores/agentStore.ts:179:17
       set((state) => ({
         agents: { ...state.agents, [workspaceId]: info },
       }));
-    } catch (e) {
-      console.error(`[agentStore] Failed to fetch status:`, e);
-    }
+    } catch (e) {}
   },
 }));
killedBy: agentStore - fetchStatus logs error on fetchStatus failure without throwing
statusReason: expected "error" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0
