--- src/commands/agent.rs
+++ delete ! in resolve_container_exec_context
@@ -134,17 +134,17 @@
 /// Returns Some(ContainerExecContext) if the workspace has container mode enabled
 /// with AgentExecMode::Container and a running container.
 pub(crate) fn resolve_container_exec_context(
     workspace: &crate::models::workspace::Workspace,
     repo_name: &str,
     container_id: Option<String>,
 ) -> Option<crate::models::devcontainer::ContainerExecContext> {
     let config = workspace.devcontainer_config.as_ref()?;
-    if !config.enabled
+    if  /* ~ changed by cargo-mutants ~ */config.enabled
         || config.agent_exec_mode != crate::models::devcontainer::AgentExecMode::Container
     {
         return None;
     }
     let container_working_dir =
         crate::services::devcontainer::resolve_container_workspace_path(config, repo_name);
     let cid = container_id?;
     Some(crate::models::devcontainer::ContainerExecContext {
