--- src/commands/agent.rs
+++ delete ! in send_message
@@ -363,17 +363,17 @@
             let db = state.db.lock().unwrap();
             if let Some(db) = db.as_ref() {
                 db.get_workspace_links(&context_id).unwrap_or_default()
             } else {
                 vec![]
             }
         };
         // Now get workspace data (db lock is dropped)
-        if !link_ids.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */link_ids.is_empty() {
             let workspaces = state.workspaces.read().unwrap();
             link_ids
                 .iter()
                 .filter_map(|id| workspaces.get(id))
                 .map(|ws| ws.worktree_path.clone())
                 .collect()
         } else {
             vec![]
