--- src/commands/agent.rs
+++ replace should_emit_status -> bool with false
@@ -49,19 +49,17 @@
 /// Determine whether to emit a status update based on current vs new status.
 /// Suppresses Error status if agent is already Idle (stop_agent already reset it).
 /// Returns (should_emit, new_status_to_set).
 pub(crate) fn should_emit_status(
     current_status: &AgentStatus,
     new_status: &AgentStatus,
 ) -> bool {
     // If stop_agent already set Idle, don't overwrite with an Error
-    let suppressed = *current_status == AgentStatus::Idle
-        && matches!(new_status, AgentStatus::Error(_));
-    !suppressed
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check if an agent is alive and running. Returns true if agent
 /// status is Running and the PID is still alive. For sidecar-based agents
 /// (no PID), Running status alone is sufficient since the sidecar manages
 /// process lifecycle.
 pub(crate) fn is_agent_alive(agent: &AgentInfo) -> bool {
     if agent.status != AgentStatus::Running {
