--- src/commands/agent.rs
+++ delete ! in should_emit_status
@@ -51,17 +51,17 @@
 /// Returns (should_emit, new_status_to_set).
 pub(crate) fn should_emit_status(
     current_status: &AgentStatus,
     new_status: &AgentStatus,
 ) -> bool {
     // If stop_agent already set Idle, don't overwrite with an Error
     let suppressed = *current_status == AgentStatus::Idle
         && matches!(new_status, AgentStatus::Error(_));
-    !suppressed
+     /* ~ changed by cargo-mutants ~ */suppressed
 }
 
 /// Check if an agent is alive and running. Returns true if agent
 /// status is Running and the PID is still alive. For sidecar-based agents
 /// (no PID), Running status alone is sufficient since the sidecar manages
 /// process lifecycle.
 pub(crate) fn is_agent_alive(agent: &AgentInfo) -> bool {
     if agent.status != AgentStatus::Running {
