--- src/commands/agent.rs
+++ replace send_followup_message -> Result<(), AppError> with Ok(())
@@ -646,76 +646,17 @@
 }
 
 #[tauri::command]
 pub async fn send_followup_message(
     state: State<'_, AppState>,
     workspace_id: String,
     message: String,
 ) -> Result<(), AppError> {
-    let id = parse_agent_workspace_id(&workspace_id)?;
-
-    let agent_type = {
-        let settings = state.settings.read().unwrap();
-        settings.agent_type.clone()
-    };
-
-    // For Codex CLI, keep the existing stdin-based approach
-    if agent_type == AgentType::CodexCli {
-        let stdin_handle = state.agent_stdins.lock().unwrap().remove(&id);
-        if let Some(mut stdin) = stdin_handle {
-            let write_result = claude_process::write_message(&mut stdin, &message).await;
-            state.agent_stdins.lock().unwrap().insert(id, stdin);
-            write_result?;
-            return Ok(());
-        }
-        return Err(AppError::AgentError(
-            "No stdin handle found for this agent".to_string(),
-        ));
-    }
-
-    // For Claude Code (SDK), a followup message goes through the sidecar.
-    // Retrieve the session_id to resume the conversation.
-    let session_id = {
-        let agents = state.agents.lock().unwrap();
-        agents.get(&id).and_then(|a| a.session_id.clone())
-    };
-
-    // Look up the workspace's working directory for the query
-    let cwd = {
-        let workspaces = state.workspaces.read().unwrap();
-        workspaces
-            .get(&id)
-            .map(|ws| ws.worktree_path.to_string_lossy().to_string())
-            .unwrap_or_default()
-    };
-
-    let cmd = claude_process::SidecarCommand::Query {
-        id: id.to_string(),
-        prompt: message,
-        cwd,
-        session_id,
-        model: None,
-        system_prompt: None,
-        permission_mode: "default".to_string(),
-        env_vars: None,
-        additional_dirs: None,
-        disable_thinking: None,
-    };
-
-    let mut handle = {
-        let mut guard = state.agent_sidecar.lock().unwrap();
-        guard.take().ok_or_else(|| {
-            AppError::AgentError("Sidecar not running".to_string())
-        })?
-    };
-
-    let result = claude_process::send_command(&mut handle, &cmd).await;
-    state.agent_sidecar.lock().unwrap().replace(handle);
-    result
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_resolve_context_id_workspace() {
