--- src/db/bookmarks.rs
+++ replace Database::update_bookmark -> Result<(), AppError> with Ok(())
@@ -118,27 +118,17 @@
         match result {
             Ok(bookmark) => Ok(Some(bookmark)),
             Err(rusqlite::Error::QueryReturnedNoRows) => Ok(None),
             Err(e) => Err(AppError::DbError(e.to_string())),
         }
     }
 
     pub fn update_bookmark(&self, bookmark: &FileBookmark) -> Result<(), AppError> {
-        self.conn.execute(
-            "UPDATE file_bookmarks SET note = ?1, color = ?2, line_number = ?3, updated_at = ?4 WHERE id = ?5",
-            rusqlite::params![
-                bookmark.note,
-                bookmark.color,
-                bookmark.line_number,
-                bookmark.updated_at.to_rfc3339(),
-                bookmark.id.to_string(),
-            ],
-        )?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn delete_bookmark(&self, id: &Uuid) -> Result<(), AppError> {
         self.conn.execute(
             "DELETE FROM file_bookmarks WHERE id = ?1",
             rusqlite::params![id.to_string()],
         )?;
         Ok(())
