--- src/db/bookmarks.rs
+++ replace Database::delete_bookmark_at_line -> Result<bool, AppError> with Ok(true)
@@ -145,21 +145,17 @@
     }
 
     pub fn delete_bookmark_at_line(
         &self,
         repo_id: &Uuid,
         file_path: &str,
         line_number: u32,
     ) -> Result<bool, AppError> {
-        let count = self.conn.execute(
-            "DELETE FROM file_bookmarks WHERE repo_id = ?1 AND file_path = ?2 AND line_number = ?3",
-            rusqlite::params![repo_id.to_string(), file_path, line_number],
-        )?;
-        Ok(count > 0)
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use crate::test_helpers::*;
     use chrono::Utc;
     use uuid::Uuid;
