--- src/db/bookmarks.rs
+++ replace Database::list_bookmarks_for_file -> Result<Vec<FileBookmark>, AppError> with Ok(vec![])
@@ -55,44 +55,17 @@
     }
 
     #[allow(dead_code)]
     pub fn list_bookmarks_for_file(
         &self,
         repo_id: &Uuid,
         file_path: &str,
     ) -> Result<Vec<FileBookmark>, AppError> {
-        let mut stmt = self.conn.prepare(
-            "SELECT id, repo_id, file_path, line_number, note, color, created_at, updated_at
-             FROM file_bookmarks WHERE repo_id = ?1 AND file_path = ?2 ORDER BY line_number ASC",
-        )?;
-        let bookmarks = stmt
-            .query_map(rusqlite::params![repo_id.to_string(), file_path], |row| {
-                let id_str: String = row.get(0)?;
-                let repo_id_str: String = row.get(1)?;
-                let created_str: String = row.get(6)?;
-                let updated_str: String = row.get(7)?;
-                Ok(FileBookmark {
-                    id: Uuid::parse_str(&id_str).unwrap_or_default(),
-                    repo_id: Uuid::parse_str(&repo_id_str).unwrap_or_default(),
-                    file_path: row.get(2)?,
-                    line_number: row.get(3)?,
-                    note: row.get(4)?,
-                    color: row.get(5)?,
-                    created_at: DateTime::parse_from_rfc3339(&created_str)
-                        .map(|dt| dt.with_timezone(&Utc))
-                        .unwrap_or_else(|_| Utc::now()),
-                    updated_at: DateTime::parse_from_rfc3339(&updated_str)
-                        .map(|dt| dt.with_timezone(&Utc))
-                        .unwrap_or_else(|_| Utc::now()),
-                })
-            })?
-            .filter_map(|r| r.ok())
-            .collect();
-        Ok(bookmarks)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_bookmark(&self, id: &Uuid) -> Result<Option<FileBookmark>, AppError> {
         let mut stmt = self.conn.prepare(
             "SELECT id, repo_id, file_path, line_number, note, color, created_at, updated_at
              FROM file_bookmarks WHERE id = ?1",
         )?;
         let result = stmt.query_row(rusqlite::params![id.to_string()], |row| {
