--- src/db/chat.rs
+++ replace += with -= in Database::get_usage_data
@@ -170,17 +170,17 @@
         );
 
         let mut params: Vec<Box<dyn rusqlite::types::ToSql>> = Vec::new();
         let mut param_idx = 1;
 
         if let Some(ws_id) = workspace_id {
             sql.push_str(&format!(" AND cm.workspace_id = ?{param_idx}"));
             params.push(Box::new(ws_id.to_string()));
-            param_idx += 1;
+            param_idx -= /* ~ changed by cargo-mutants ~ */ 1;
         }
 
         if let Some(since_ts) = since {
             sql.push_str(&format!(" AND cm.timestamp >= ?{param_idx}"));
             params.push(Box::new(since_ts.to_string()));
             let _ = param_idx; // suppress unused warning
         }
 
