--- src/db/chat.rs
+++ delete match arm "user" in Database::list_chat_messages
@@ -55,17 +55,17 @@
                         }
                     },
                     None => None,
                 };
                 Ok(ChatMessage {
                     id: row.get::<_, String>(0)?.parse::<Uuid>().unwrap_or_default(),
                     workspace_id: row.get::<_, String>(1)?.parse::<Uuid>().unwrap_or_default(),
                     role: match role_str.as_str() {
-                        "user" => MessageRole::User,
+                         /* ~ changed by cargo-mutants ~ */
                         "assistant" => MessageRole::Assistant,
                         _ => MessageRole::System,
                     },
                     content: serde_json::from_str::<Vec<ContentBlock>>(&content_json)
                         .unwrap_or_default(),
                     timestamp: timestamp_str
                         .parse::<DateTime<Utc>>()
                         .unwrap_or_else(|_| Utc::now()),
