--- src/db/workspaces.rs
+++ replace Database::update_workspace_sparse_dirs -> Result<(), AppError> with Ok(())
@@ -149,22 +149,17 @@
         Ok(())
     }
 
     pub fn update_workspace_sparse_dirs(
         &self,
         id: &Uuid,
         dirs: &Option<Vec<String>>,
     ) -> Result<(), AppError> {
-        let json = dirs.as_ref().map(|d| serde_json::to_string(d).unwrap());
-        self.conn.execute(
-            "UPDATE workspaces SET sparse_dirs = ?1 WHERE id = ?2",
-            rusqlite::params![json, id.to_string()],
-        )?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn insert_workspace_link(&self, ws_id: &Uuid, linked_id: &Uuid) -> Result<(), AppError> {
         self.conn.execute(
             "INSERT OR IGNORE INTO workspace_links (workspace_id, linked_workspace_id) VALUES (?1, ?2)",
             rusqlite::params![ws_id.to_string(), linked_id.to_string()],
         )?;
         Ok(())
