--- src/db/workspaces.rs
+++ replace Database::list_archived_workspaces -> Result<Vec<Workspace>, AppError> with Ok(vec![])
@@ -84,53 +84,17 @@
                 })
             })?
             .filter_map(|r| r.ok())
             .collect();
         Ok(workspaces)
     }
 
     pub fn list_archived_workspaces(&self) -> Result<Vec<Workspace>, AppError> {
-        let mut stmt = self.conn.prepare(
-            "SELECT id, repo_id, name, branch, worktree_path, status, port_base, sparse_dirs, notes, created_at, archived_at, error_message, auto_commit, pinned, devcontainer_config
-             FROM workspaces WHERE status = 'archived' ORDER BY archived_at DESC",
-        )?;
-        let workspaces = stmt
-            .query_map([], |row| {
-                let status_str: String = row.get(5)?;
-                let error_msg: Option<String> = row.get(11)?;
-                Ok(Workspace {
-                    id: row.get::<_, String>(0)?.parse::<Uuid>().unwrap_or_default(),
-                    repo_id: row.get::<_, String>(1)?.parse::<Uuid>().unwrap_or_default(),
-                    name: row.get(2)?,
-                    branch: row.get(3)?,
-                    worktree_path: PathBuf::from(row.get::<_, String>(4)?),
-                    status: WorkspaceStatus::from_str(&status_str, error_msg),
-                    port_base: row.get(6)?,
-                    sparse_dirs: row
-                        .get::<_, Option<String>>(7)?
-                        .and_then(|s| serde_json::from_str(&s).ok()),
-                    notes: row.get(8)?,
-                    auto_commit: row.get::<_, i32>(12).unwrap_or(1) != 0,
-                    pinned: row.get::<_, i32>(13).unwrap_or(0) != 0,
-                    created_at: row
-                        .get::<_, String>(9)?
-                        .parse()
-                        .unwrap_or_else(|_| chrono::Utc::now()),
-                    archived_at: row
-                        .get::<_, Option<String>>(10)?
-                        .and_then(|s| s.parse().ok()),
-                    devcontainer_config: row
-                        .get::<_, Option<String>>(14)?
-                        .and_then(|s| serde_json::from_str(&s).ok()),
-                })
-            })?
-            .filter_map(|r| r.ok())
-            .collect();
-        Ok(workspaces)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn delete_workspace(&self, id: &Uuid) -> Result<(), AppError> {
         self.conn.execute(
             "DELETE FROM workspaces WHERE id = ?1",
             rusqlite::params![id.to_string()],
         )?;
         Ok(())
